Repository: NyaPuma/python-docs-pt-pt
Catalog: whatsnew/3.11.po
Languages: pt_pt

source: Added :meth:`object.__getstate__`, which provides the default implementation of the :meth:`!__getstate__` method. :mod:`copy`\ing and :mod:`pickle`\ing instances of subclasses of builtin types :class:`bytearray`, :class:`set`, :class:`frozenset`, :class:`collections.OrderedDict`, :class:`collections.deque`, :class:`weakref.WeakSet`, and :class:`datetime.tzinfo` now copies and pickles instance attributes implemented as :term:`slots <__slots__>`. This change has an unintended side effect: It trips up a small minority of existing Python projects not expecting :meth:`object.__getstate__` to exist. See the later comments on :gh:`70766` for discussions of what workarounds such code may need. (Contributed by Serhiy Storchaka in :issue:`26579`.)
pt_pt: Adicionado :meth:`object.__getstate__`, que fornece a implementação predefinida do método :meth:`!__getstate__`. A :mod:`copy` e a:mod:`pickle` de instâncias de subclasses de tipos integrados :class:`bytearray`, :class:`set`, :class:`frozenset`, :class:`collections.OrderedDict`, :class:`collections.deque`, :class:`weakref.WeakSet` e :class:`datetime.tzinfo` agora copiam e serializam atributos de instância implementados como :term:`slots <__slots__>`. Esta alteração tem um efeito colateral não intencional: afeta uma pequena minoria de projetos Python existentes que não esperavam que :meth:`object.__getstate__` existisse. Consulte os comentários posteriores em :gh:`70766` para discussões sobre possíveis soluções alternativas. (Contribuído por Serhiy Storchaka em :issue:`26579`.)

source: Added a :option:`-P` command line option and a :envvar:`PYTHONSAFEPATH` environment variable, which disable the automatic prepending to :data:`sys.path` of the script's directory when running a script, or the current directory when using :option:`-c` and :option:`-m`. This ensures only stdlib and installed modules are picked up by :keyword:`import`, and avoids unintentionally or maliciously shadowing modules with those in a local (and typically user-writable) directory. (Contributed by Victor Stinner in :gh:`57684`.)
pt_pt: Adicionada uma opção de linha de comandos :option:`-P` e uma variável de ambiente :envvar:`PYTHONSAFEPATH`, que desativam a adição automática ao :data:`sys.path` do diretório do script ao executar um script, ou do diretório atual ao usar :option:`-c` e :option:`-m`. Isto garante que apenas módulos da biblioteca padrão e instalados são selecionados por :keyword:`import`, evitando a sobreposição não intencional ou maliciosa de módulos com aqueles num diretório local (e tipicamente gravável pelo utilizador). (Contribuído por Victor Stinner em :gh:`57684`.)

source: A ``"z"`` option was added to the :ref:`formatspec` that coerces negative to positive zero after rounding to the format precision. See :pep:`682` for more details. (Contributed by John Belmonte in :gh:`90153`.)
pt_pt: Foi adicionada uma opção ``"z"`` ao :ref:`formatspec` que converte valores negativos para zero positivo após arredondamento para a precisão do formato. Consulte :pep:`682` para mais detalhes. (Contribuído por John Belmonte em :gh:`90153`.)

source: Bytes are no longer accepted on :data:`sys.path`. Support broke sometime between Python 3.2 and 3.6, with no one noticing until after Python 3.10.0 was released. In addition, bringing back support would be problematic due to interactions between :option:`-b` and :data:`sys.path_importer_cache` when there is a mixture of :class:`str` and :class:`bytes` keys. (Contributed by Thomas Grainger in :gh:`91181`.)
pt_pt: Os objetos bytes já não são aceites em :data:`sys.path`. O suporte foi interrompido em algum momento entre o Python 3.2 e o 3.6, sem que ninguém notasse até após o lançamento do Python 3.10.0. Além disso, restaurar o suporte seria problemático devido a interações entre :option:`-b` e :data:`sys.path_importer_cache` quando há uma mistura de chaves :class:`str` e :class:`bytes`. (Contribuído por Thomas Grainger em :gh:`91181`.)

source: Other CPython Implementation Changes
pt_pt: Outras alterações na implementação do CPython

source: The special methods :meth:`~object.__complex__` for :class:`complex` and :meth:`~object.__bytes__` for :class:`bytes` are implemented to support the :class:`typing.SupportsComplex` and :class:`typing.SupportsBytes` protocols. (Contributed by Mark Dickinson and Donghee Na in :issue:`24234`.)
pt_pt: Os métodos especiais :meth:`~object.__complex__` para :class:`complex` e :meth:`~object.__bytes__` para :class:`bytes` são implementados para suportar os protocolos :class:`typing.SupportsComplex` e :class:`typing.SupportsBytes`. (Contribuído por Mark Dickinson e Donghee Na em :issue:`24234`.)

source: ``siphash13`` is added as a new internal hashing algorithm. It has similar security properties as ``siphash24``, but it is slightly faster for long inputs. :class:`str`, :class:`bytes`, and some other types now use it as the default algorithm for :func:`hash`. :pep:`552` :ref:`hash-based .pyc files <pyc-invalidation>` now use ``siphash13`` too. (Contributed by Inada Naoki in :issue:`29410`.)
pt_pt: ``siphash13`` foi adicionado como um novo algoritmo de hash interno. Tem propriedades de segurança semelhantes ao ``siphash24``, mas é ligeiramente mais rápido para entradas longas. :class:`str`, :class:`bytes` e alguns outros tipos agora usam-no como o algoritmo predefinido para :func:`hash`. Os ficheiros :ref:`.pyc baseados em hash <pyc-invalidation>` da :pep:`552` agora também usam ``siphash13``. (Contribuído por Inada Naoki em :issue:`29410`.)

source: When an active exception is re-raised by a :keyword:`raise` statement with no parameters, the traceback attached to this exception is now always ``sys.exc_info()[1].__traceback__``. This means that changes made to the traceback in the current :keyword:`except` clause are reflected in the re-raised exception. (Contributed by Irit Katriel in :issue:`45711`.)
pt_pt: Quando uma exceção ativa é relançada por uma instrução :keyword:`raise` sem parâmetros, o traceback associado a esta exceção é agora sempre ``sys.exc_info()[1].__traceback__``. Isto significa que as alterações feitas ao traceback na cláusula :keyword:`except` atual são refletidas na exceção relançada. (Contribuído por Irit Katriel em :issue:`45711`.)

source: The interpreter state's representation of handled exceptions (aka ``exc_info`` or ``_PyErr_StackItem``) now only has the ``exc_value`` field; ``exc_type`` and ``exc_traceback`` have been removed, as they can be derived from ``exc_value``. (Contributed by Irit Katriel in :issue:`45711`.)
pt_pt: A representação do estado do interpretador de exceções tratadas (também conhecida como ``exc_info`` ou ``_PyErr_StackItem``) agora tem apenas o campo ``exc_value``; ``exc_type`` e ``exc_traceback`` foram removidos, uma vez que podem ser derivados de ``exc_value``. (Contribuído por Irit Katriel em :issue:`45711`.)

source: A new :ref:`command line option <install-quiet-option>`, ``AppendPath``, has been added for the Windows installer. It behaves similarly to ``PrependPath``, but appends the install and scripts directories instead of prepending them. (Contributed by Bastian Neuburger in :issue:`44934`.)
pt_pt: Foi adicionada uma nova :ref:`opção de linha de comandos <install-quiet-option>`, ``AppendPath``, para o instalador do Windows. Comporta-se de forma semelhante a ``PrependPath``, mas adiciona os diretórios de instalação e scripts em vez de os colocar no início. (Contribuído por Bastian Neuburger em :issue:`44934`.)

source: The :c:member:`PyConfig.module_search_paths_set` field must now be set to ``1`` for initialization to use :c:member:`PyConfig.module_search_paths` to initialize :data:`sys.path`. Otherwise, initialization will recalculate the path and replace any values added to ``module_search_paths``.
pt_pt: O campo :c:member:`PyConfig.module_search_paths_set` deve agora ser definido como ``1`` para que a inicialização utilize :c:member:`PyConfig.module_search_paths` para inicializar :data:`sys.path`. Caso contrário, a inicialização recalculará o caminho e substituirá quaisquer valores adicionados a ``module_search_paths``.

source: The output of the :option:`--help` option now fits in 50 lines/80 columns. Information about :ref:`Python environment variables <using-on-envvars>` and :option:`-X` options is now available using the respective :option:`--help-env` and :option:`--help-xoptions` flags, and with the new :option:`--help-all`. (Contributed by Éric Araujo in :issue:`46142`.)
pt_pt: A saída da opção :option:`--help` agora cabe em 50 linhas/80 colunas. Informações sobre :ref:`variáveis de ambiente do Python <using-on-envvars>` e opções :option:`-X` estão agora disponíveis usando as respetivas flags :option:`--help-env` e :option:`--help-xoptions`, e com a nova opção :option:`--help-all`. (Contribuído por Éric Araujo em :issue:`46142`.)

source: Converting between :class:`int` and :class:`str` in bases other than 2 (binary), 4, 8 (octal), 16 (hexadecimal), or 32 such as base 10 (decimal) now raises a :exc:`ValueError` if the number of digits in string form is above a limit to avoid potential denial of service attacks due to the algorithmic complexity. This is a mitigation for :cve:`2020-10735`. This limit can be configured or disabled by environment variable, command line flag, or :mod:`sys` APIs. See the :ref:`integer string conversion length limitation <int_max_str_digits>` documentation. The default limit is 4300 digits in string form.
pt_pt: A conversão entre :class:`int` e :class:`str` em bases diferentes de 2 (binário), 4, 8 (octal), 16 (hexadecimal) ou 32, como a base 10 (decimal), agora lança um :exc:`ValueError` se o número de dígitos na forma de cadeia de caracteres estiver acima de um limite para evitar potenciais ataques de negação de serviço devido à complexidade algorítmica. Isto é uma mitigação para :cve:`2020-10735`. Este limite pode ser configurado ou desativado por variável de ambiente, flag de linha de comandos ou APIs :mod:`sys`. Consulte a documentação :ref:`limitação de comprimento de conversão de cadeia de caracteres inteiros <int_max_str_digits>`. O limite predefinido é de 4300 dígitos na forma de cadeia de caracteres.

source: New Modules
pt_pt: Novos Módulos

source: :mod:`tomllib`: For parsing `TOML <https://toml.io/>`_. See :pep:`680` for more details. (Contributed by Taneli Hukkinen in :issue:`40059`.)
pt_pt: :mod:`tomllib`: Para análise de `TOML <https://toml.io/>`_. Consulte :pep:`680` para mais detalhes. (Contribuído por Taneli Hukkinen em :issue:`40059`.)

source: :mod:`wsgiref.types`: :pep:`WSGI <3333>`-specific types for static type checking. (Contributed by Sebastian Rittau in :issue:`42012`.)
pt_pt: :mod:`wsgiref.types`: Tipos específicos de :pep:`WSGI <3333>` para verificação estática de tipos. (Contribuído por Sebastian Rittau em :issue:`42012`.)

source: Improved Modules
pt_pt: Módulos Melhorados

source: Added the :class:`~asyncio.TaskGroup` class, an :ref:`asynchronous context manager <async-context-managers>` holding a group of tasks that will wait for all of them upon exit. For new code this is recommended over using :func:`~asyncio.create_task` and :func:`~asyncio.gather` directly. (Contributed by Yury Selivanov and others in :gh:`90908`.)
pt_pt: Adicionada a classe :class:`~asyncio.TaskGroup`, um :ref:`gestor de contexto assíncrono <async-context-managers>` que contém um grupo de tarefas que aguardará por todas elas na saída. Para novo código, isto é recomendado em vez de usar diretamente :func:`~asyncio.create_task` e :func:`~asyncio.gather`. (Contribuído por Yury Selivanov e outros em :gh:`90908`.)

source: Added :func:`~asyncio.timeout`, an asynchronous context manager for setting a timeout on asynchronous operations. For new code this is recommended over using :func:`~asyncio.wait_for` directly. (Contributed by Andrew Svetlov in :gh:`90927`.)
pt_pt: Adicionado :func:`~asyncio.timeout`, um gestor de contexto assíncrono para definir um tempo limite em operações assíncronas. Para novo código, isto é recomendado em vez de usar diretamente :func:`~asyncio.wait_for`. (Contribuído por Andrew Svetlov em :gh:`90927`.)

source: Added the :class:`~asyncio.Runner` class, which exposes the machinery used by :func:`~asyncio.run`. (Contributed by Andrew Svetlov in :gh:`91218`.)
pt_pt: Adicionada a classe :class:`~asyncio.Runner`, que expõe a maquinaria usada por :func:`~asyncio.run`. (Contribuído por Andrew Svetlov em :gh:`91218`.)

source: Added the :class:`~asyncio.Barrier` class to the synchronization primitives in the asyncio library, and the related :exc:`~asyncio.BrokenBarrierError` exception. (Contributed by Yves Duprat and Andrew Svetlov in :gh:`87518`.)
pt_pt: Adicionada a classe :class:`~asyncio.Barrier` aos primitivos de sincronização na biblioteca asyncio, e a exceção relacionada :exc:`~asyncio.BrokenBarrierError`. (Contribuído por Yves Duprat e Andrew Svetlov em :gh:`87518`.)

source: Added keyword argument *all_errors* to :meth:`asyncio.loop.create_connection` so that multiple connection errors can be raised as an :exc:`ExceptionGroup`.
pt_pt: Adicionado o argumento nomeado *all_errors* a :meth:`asyncio.loop.create_connection` para que múltiplos erros de ligação possam ser lançados como um :exc:`ExceptionGroup`.

source: Added the :meth:`asyncio.StreamWriter.start_tls` method for upgrading existing stream-based connections to TLS. (Contributed by Ian Good in :issue:`34975`.)
pt_pt: Adicionado o método :meth:`asyncio.StreamWriter.start_tls` para atualizar ligações baseadas em fluxo existentes para TLS. (Contribuído por Ian Good em :issue:`34975`.)

source: Added raw datagram socket functions to the event loop: :meth:`~asyncio.loop.sock_sendto`, :meth:`~asyncio.loop.sock_recvfrom` and :meth:`~asyncio.loop.sock_recvfrom_into`. These have implementations in :class:`~asyncio.SelectorEventLoop` and :class:`~asyncio.ProactorEventLoop`. (Contributed by Alex Grönholm in :issue:`46805`.)
pt_pt: Adicionadas funções de socket de datagrama bruto ao ciclo de eventos: :meth:`~asyncio.loop.sock_sendto`, :meth:`~asyncio.loop.sock_recvfrom` e :meth:`~asyncio.loop.sock_recvfrom_into`. Estas têm implementações em :class:`~asyncio.SelectorEventLoop` e :class:`~asyncio.ProactorEventLoop`. (Contribuído por Alex Grönholm em :issue:`46805`.)

source: Added :meth:`~asyncio.Task.cancelling` and :meth:`~asyncio.Task.uncancel` methods to :class:`~asyncio.Task`. These are primarily intended for internal use, notably by :class:`~asyncio.TaskGroup`.
pt_pt: Adicionados os métodos :meth:`~asyncio.Task.cancelling` e :meth:`~asyncio.Task.uncancel` à classe :class:`~asyncio.Task`. Estes são principalmente destinados a uso interno, notavelmente por :class:`~asyncio.TaskGroup`.

source: Added non parallel-safe :func:`~contextlib.chdir` context manager to change the current working directory and then restore it on exit. Simple wrapper around :func:`~os.chdir`. (Contributed by Filipe Laíns in :issue:`25625`)
pt_pt: Adicionado o gestor de contexto não seguro para paralelo :func:`~contextlib.chdir` para alterar o diretório de trabalho atual e restaurá-lo na saída. É um invólucro simples em torno de :func:`~os.chdir`. (Contribuído por Filipe Laíns em :issue:`25625`)

source: Change field default mutability check, allowing only defaults which are :term:`hashable` instead of any object which is not an instance of :class:`dict`, :class:`list` or :class:`set`. (Contributed by Eric V. Smith in :issue:`44674`.)
pt_pt: Alterada a verificação de mutabilidade predefinida do campo, permitindo apenas valores predefinidos que são :term:`hashable` em vez de qualquer objeto que não seja uma instância de :class:`dict`, :class:`list` ou :class:`set`. (Contribuído por Eric V. Smith em :issue:`44674`.)

source: Add :const:`datetime.UTC`, a convenience alias for :attr:`datetime.timezone.utc`. (Contributed by Kabir Kwatra in :gh:`91973`.)
pt_pt: Adicionado :const:`datetime.UTC`, um alias de conveniência para :attr:`datetime.timezone.utc`. (Contribuído por Kabir Kwatra em :gh:`91973`.)

source: :meth:`datetime.date.fromisoformat`, :meth:`datetime.time.fromisoformat` and :meth:`datetime.datetime.fromisoformat` can now be used to parse most ISO 8601 formats (barring only those that support fractional hours and minutes). (Contributed by Paul Ganssle in :gh:`80010`.)
pt_pt: :meth:`datetime.date.fromisoformat`, :meth:`datetime.time.fromisoformat` e :meth:`datetime.datetime.fromisoformat` podem agora ser usados para analisar a maioria dos formatos ISO 8601 (excluindo apenas aqueles que suportam horas e minutos fracionários). (Contribuído por Paul Ganssle em :gh:`80010`.)

source: Renamed :class:`!EnumMeta` to :class:`~enum.EnumType` (:class:`!EnumMeta` kept as an alias).
pt_pt: Renomeado :class:`!EnumMeta` para :class:`~enum.EnumType` (:class:`!EnumMeta` mantido como alias).

source: Added :class:`~enum.StrEnum`, with members that can be used as (and must be) strings.
pt_pt: Adicionado :class:`~enum.StrEnum`, cujos membros podem ser usados como (e devem ser) cadeias de caracteres.

source: Added :class:`~enum.ReprEnum`, which only modifies the :meth:`~object.__repr__` of members while returning their literal values (rather than names) for :meth:`~object.__str__` and :meth:`~object.__format__` (used by :func:`str`, :func:`format` and :term:`f-string`\s).
pt_pt: Adicionado :class:`~enum.ReprEnum`, que modifica apenas o :meth:`~object.__repr__` dos membros, retornando os seus valores literais (em vez de nomes) para :meth:`~object.__str__` e :meth:`~object.__format__` (usados por :func:`str`, :func:`format` e :term:`f-string`).

source: Changed :meth:`Enum.__format__() <enum.Enum.__format__>` (the default for :func:`format`, :meth:`str.format` and :term:`f-string`\s) to always produce the same result as :meth:`Enum.__str__() <enum.Enum.__str__>`: for enums inheriting from :class:`~enum.ReprEnum` it will be the member's value; for all other enums it will be the enum and member name (e.g. ``Color.RED``).
pt_pt: Alterado :meth:`Enum.__format__() <enum.Enum.__format__>` (o predefinido para :func:`format`, :meth:`str.format` e :term:`f-string`) para produzir sempre o mesmo resultado que :meth:`Enum.__str__() <enum.Enum.__str__>`: para enums que herdam de :class:`~enum.ReprEnum`, será o valor do membro; para todos os outros enums, será o nome do enum e do membro (por exemplo, ``Color.RED``).

source: Added a new *boundary* class parameter to :class:`~enum.Flag` enums and the :class:`~enum.FlagBoundary` enum with its options, to control how to handle out-of-range flag values.
pt_pt: Adicionado um novo parâmetro de classe *boundary* aos enums :class:`~enum.Flag` e ao enum :class:`~enum.FlagBoundary` com as suas opções, para controlar como lidar com valores de flag fora do intervalo.

source: Added the :func:`~enum.verify` enum decorator and the :class:`~enum.EnumCheck` enum with its options, to check enum classes against several specific constraints.
pt_pt: Adicionado o decorador de enum :func:`~enum.verify` e o enum :class:`~enum.EnumCheck` com as suas opções, para verificar classes de enum contra várias restrições específicas.

source: Added the :func:`~enum.member` and :func:`~enum.nonmember` decorators, to ensure the decorated object is/is not converted to an enum member.
pt_pt: Adicionados os decoradores :func:`~enum.member` e :func:`~enum.nonmember`, para garantir que o objeto decorado é/não é convertido num membro de enum.

source: Added the :func:`~enum.property` decorator, which works like :func:`property` except for enums. Use this instead of :func:`types.DynamicClassAttribute`.
pt_pt: Adicionado o decorador :func:`~enum.property`, que funciona como :func:`property` exceto para enums. Use este em vez de :func:`types.DynamicClassAttribute`.

source: Added the :func:`~enum.global_enum` enum decorator, which adjusts :meth:`~object.__repr__` and :meth:`~object.__str__` to show values as members of their module rather than the enum class. For example, ``'re.ASCII'`` for the :const:`~re.ASCII` member of :class:`re.RegexFlag` rather than ``'RegexFlag.ASCII'``.
pt_pt: Adicionado o decorador de enum :func:`~enum.global_enum`, que ajusta :meth:`~object.__repr__` e :meth:`~object.__str__` para mostrar valores como membros do seu módulo em vez da classe de enum. Por exemplo, ``'re.ASCII'`` para o membro :const:`~re.ASCII` de :class:`re.RegexFlag` em vez de ``'RegexFlag.ASCII'``.

source: Enhanced :class:`~enum.Flag` to support :func:`len`, iteration and :keyword:`in`/:keyword:`not in` on its members. For example, the following now works: ``len(AFlag(3)) == 2 and list(AFlag(3)) == (AFlag.ONE, AFlag.TWO)``
pt_pt: Melhorado :class:`~enum.Flag` para suportar :func:`len`, iteração e :keyword:`in`/:keyword:`not in` nos seus membros. Por exemplo, o seguinte agora funciona: ``len(AFlag(3)) == 2 and list(AFlag(3)) == (AFlag.ONE, AFlag.TWO)``

source: Changed :class:`~enum.Enum` and :class:`~enum.Flag` so that members are now defined before :meth:`~object.__init_subclass__` is called; :func:`dir` now includes methods, etc., from mixed-in data types.
pt_pt: Alterado :class:`~enum.Enum` e :class:`~enum.Flag` para que os membros sejam agora definidos antes de :meth:`~object.__init_subclass__` ser chamado; :func:`dir` agora inclui métodos, etc., de tipos de dados misturados.

source: Changed :class:`~enum.Flag` to only consider primary values (power of two) canonical while composite values (``3``, ``6``, ``10``, etc.) are considered aliases; inverted flags are coerced to their positive equivalent.
pt_pt: Alterado :class:`~enum.Flag` para considerar apenas valores primários (potências de dois) canónicos, enquanto valores compostos (``3``, ``6``, ``10``, etc.) são considerados alias; flags invertidos são convertidos para o seu equivalente positivo.

source: On FreeBSD, the :data:`!F_DUP2FD` and :data:`!F_DUP2FD_CLOEXEC` flags respectively are supported, the former equals to ``dup2`` usage while the latter set the ``FD_CLOEXEC`` flag in addition.
pt_pt: No FreeBSD, as flags :data:`!F_DUP2FD` e :data:`!F_DUP2FD_CLOEXEC` são suportadas, sendo a primeira equivalente ao uso de ``dup2``, enquanto a última define a flag ``FD_CLOEXEC`` adicionalmente.

source: Support :PEP:`515`-style initialization of :class:`~fractions.Fraction` from string. (Contributed by Sergey B Kirpichev in :issue:`44258`.)
pt_pt: Suporte à inicialização de :class:`~fractions.Fraction` a partir de cadeias de caracteres no estilo :PEP:`515`. (Contribuído por Sergey B Kirpichev em :issue:`44258`.)

source: :class:`~fractions.Fraction` now implements an ``__int__`` method, so that an ``isinstance(some_fraction, typing.SupportsInt)`` check passes. (Contributed by Mark Dickinson in :issue:`44547`.)
pt_pt: :class:`~fractions.Fraction` agora implementa um método ``__int__``, de modo que uma verificação ``isinstance(some_fraction, typing.SupportsInt)`` seja bem-sucedida. (Contribuído por Mark Dickinson em :issue:`44547`.)

source: :func:`functools.singledispatch` now supports :class:`types.UnionType` and :class:`typing.Union` as annotations to the dispatch argument.::
pt_pt: :func:`functools.singledispatch` agora suporta :class:`types.UnionType` e :class:`typing.Union` como anotações para o argumento de despacho.::

source: (Contributed by Yurii Karabas in :issue:`46014`.)
pt_pt: (Contribuição de Yurii Karabas na :issue:`46014`.)
