Repository: NyaPuma/python-docs-pt-pt
Catalog: whatsnew/3.11.po
Languages: pt_pt

source: The :func:`gzip.compress` function is now faster when used with the **mtime=0** argument as it delegates the compression entirely to a single :func:`zlib.compress` operation. There is one side effect of this change: The gzip file header contains an "OS" byte in its header. That was traditionally always set to a value of 255 representing "unknown" by the :mod:`gzip` module. Now, when using :func:`~gzip.compress` with **mtime=0**, it may be set to a different value by the underlying zlib C library Python was linked against. (See :gh:`112346` for details on the side effect.)
pt_pt: A função :func:`gzip.compress` é agora mais rápida quando usada com o argumento **mtime=0**, uma vez que delega a compressão inteiramente para uma única operação :func:`zlib.compress`. Há um efeito colateral nesta alteração: o cabeçalho do ficheiro gzip contém um byte "OS" no seu cabeçalho. Este era tradicionalmente sempre definido para um valor de 255, representando "desconhecido", pelo módulo :mod:`gzip`. Agora, ao usar :func:`~gzip.compress` com **mtime=0**, pode ser definido para um valor diferente pela biblioteca C zlib subjacente com a qual o Python foi ligado. (Consulte :gh:`112346` para detalhes sobre o efeito colateral.)

source: :func:`hashlib.blake2b` and :func:`hashlib.blake2s` now prefer `libb2`_ over Python's vendored copy. (Contributed by Christian Heimes in :issue:`47095`.)
pt_pt: :func:`hashlib.blake2b` e :func:`hashlib.blake2s` agora preferem `libb2`_ em vez da cópia incorporada do Python. (Contribuído por Christian Heimes em :issue:`47095`.)

source: The internal ``_sha3`` module with SHA3 and SHAKE algorithms now uses *tiny_sha3* instead of the *Keccak Code Package* to reduce code and binary size. The :mod:`hashlib` module prefers optimized SHA3 and SHAKE implementations from OpenSSL. The change affects only installations without OpenSSL support. (Contributed by Christian Heimes in :issue:`47098`.)
pt_pt: O módulo interno ``_sha3`` com algoritmos SHA3 e SHAKE agora usa *tiny_sha3* em vez do *Keccak Code Package* para reduzir o tamanho do código e do binário. O módulo :mod:`hashlib` prefere implementações otimizadas de SHA3 e SHAKE do OpenSSL. A alteração afeta apenas instalações sem suporte OpenSSL. (Contribuído por Christian Heimes em :issue:`47098`.)

source: Add :func:`hashlib.file_digest`, a helper function for efficient hashing of files or file-like objects. (Contributed by Christian Heimes in :gh:`89313`.)
pt_pt: Adicionada :func:`hashlib.file_digest`, uma função auxiliar para hash eficiente de ficheiros ou objetos tipo ficheiro. (Contribuído por Christian Heimes em :gh:`89313`.)

source: IDLE and idlelib
pt_pt: IDLE e idlelib

source: Apply syntax highlighting to ``.pyi`` files. (Contributed by Alex Waygood and Terry Jan Reedy in :issue:`45447`.)
pt_pt: Aplicar realce de sintaxe a ficheiros ``.pyi``. (Contribuído por Alex Waygood e Terry Jan Reedy em :issue:`45447`.)

source: Include prompts when saving Shell with inputs and outputs. (Contributed by Terry Jan Reedy in :gh:`95191`.)
pt_pt: Incluir prompts ao guardar a Shell com entradas e saídas. (Contribuído por Terry Jan Reedy em :gh:`95191`.)

source: Add :func:`~inspect.getmembers_static` to return all members without triggering dynamic lookup via the descriptor protocol. (Contributed by Weipeng Hong in :issue:`30533`.)
pt_pt: Adicionado :func:`~inspect.getmembers_static` para retornar todos os membros sem disparar a pesquisa dinâmica através do protocolo de descritor. (Contribuído por Weipeng Hong em :issue:`30533`.)

source: Add :func:`~inspect.ismethodwrapper` for checking if the type of an object is a :class:`~types.MethodWrapperType`. (Contributed by Hakan Çelik in :issue:`29418`.)
pt_pt: Adicionado :func:`~inspect.ismethodwrapper` para verificar se o tipo de um objeto é um :class:`~types.MethodWrapperType`. (Contribuído por Hakan Çelik em :issue:`29418`.)

source: Change the frame-related functions in the :mod:`inspect` module to return new :class:`~inspect.FrameInfo` and :class:`~inspect.Traceback` class instances (backwards compatible with the previous :term:`named tuple`-like interfaces) that includes the extended :pep:`657` position information (end line number, column and end column). The affected functions are:
pt_pt: Alteradas as funções relacionadas com frames no módulo :mod:`inspect` para retornar novas instâncias das classes :class:`~inspect.FrameInfo` e :class:`~inspect.Traceback` (compatíveis com as interfaces anteriores do tipo :term:`named tuple`) que incluem as informações de posição estendidas da :pep:`657` (número da linha final, coluna e coluna final). As funções afetadas são:

source: (Contributed by Pablo Galindo in :gh:`88116`.)
pt_pt: (Contribuição por Pablo Galindo em :gh:`88116`.)

source: Add :func:`locale.getencoding` to get the current locale encoding. It is similar to ``locale.getpreferredencoding(False)`` but ignores the :ref:`Python UTF-8 Mode <utf8-mode>`.
pt_pt: Adicionada :func:`locale.getencoding` para obter a codificação da localidade atual. É semelhante a ``locale.getpreferredencoding(False)``, mas ignora o :ref:`Modo UTF-8 do Python <utf8-mode>`.

source: Added :func:`~logging.getLevelNamesMapping` to return a mapping from logging level names (e.g. ``'CRITICAL'``) to the values of their corresponding :ref:`levels` (e.g. ``50``, by default). (Contributed by Andrei Kulakovin in :gh:`88024`.)
pt_pt: Adicionado :func:`~logging.getLevelNamesMapping` para retornar um mapeamento de nomes de níveis de registo (por exemplo, ``'CRITICAL'``) para os valores dos seus :ref:`levels` correspondentes (por exemplo, ``50``, por predefinição). (Contribuído por Andrei Kulakovin em :gh:`88024`.)

source: Added a :meth:`~logging.handlers.SysLogHandler.createSocket` method to :class:`~logging.handlers.SysLogHandler`, to match :meth:`SocketHandler.createSocket() <logging.handlers.SocketHandler.createSocket>`. It is called automatically during handler initialization and when emitting an event, if there is no active socket. (Contributed by Kirill Pinchuk in :gh:`88457`.)
pt_pt: Adicionado o método :meth:`~logging.handlers.SysLogHandler.createSocket` a :class:`~logging.handlers.SysLogHandler`, para corresponder a :meth:`SocketHandler.createSocket() <logging.handlers.SocketHandler.createSocket>`. É chamado automaticamente durante a inicialização do gestor e ao emitir um evento, se não houver um socket ativo. (Contribuído por Kirill Pinchuk em :gh:`88457`.)

source: Add :func:`math.exp2`: return 2 raised to the power of x. (Contributed by Gideon Mitchell in :issue:`45917`.)
pt_pt: Adicionada :func:`math.exp2`: retorna 2 elevado à potência de x. (Contribuído por Gideon Mitchell em :issue:`45917`.)

source: Add :func:`math.cbrt`: return the cube root of x. (Contributed by Ajith Ramachandran in :issue:`44357`.)
pt_pt: Adicionada :func:`math.cbrt`: retorna a raiz cúbica de x. (Contribuído por Ajith Ramachandran em :issue:`44357`.)

source: The behaviour of two :func:`math.pow` corner cases was changed, for consistency with the IEEE 754 specification. The operations ``math.pow(0.0, -math.inf)`` and ``math.pow(-0.0, -math.inf)`` now return ``inf``. Previously they raised :exc:`ValueError`. (Contributed by Mark Dickinson in :issue:`44339`.)
pt_pt: O comportamento de dois casos extremos de :func:`math.pow` foi alterado, para consistência com a especificação IEEE 754. As operações ``math.pow(0.0, -math.inf)`` e ``math.pow(-0.0, -math.inf)`` agora retornam ``inf``. Anteriormente, lançavam :exc:`ValueError`. (Contribuído por Mark Dickinson em :issue:`44339`.)

source: The :data:`math.nan` value is now always available. (Contributed by Victor Stinner in :issue:`46917`.)
pt_pt: O valor :data:`math.nan` está agora sempre disponível. (Contribuído por Victor Stinner em :issue:`46917`.)

source: A new function ``operator.call`` has been added, such that ``operator.call(obj, *args, **kwargs) == obj(*args, **kwargs)``. (Contributed by Antony Lee in :issue:`44019`.)
pt_pt: Foi adicionada uma nova função ``operator.call``, de modo que ``operator.call(obj, *args, **kwargs) == obj(*args, **kwargs)``. (Contribuído por Antony Lee em :issue:`44019`.)

source: On Windows, :func:`os.urandom` now uses ``BCryptGenRandom()``, instead of ``CryptGenRandom()`` which is deprecated. (Contributed by Donghee Na in :issue:`44611`.)
pt_pt: No Windows, :func:`os.urandom` agora usa ``BCryptGenRandom()``, em vez de ``CryptGenRandom()``, que está obsoleto. (Contribuído por Donghee Na em :issue:`44611`.)

source: :meth:`~pathlib.Path.glob` and :meth:`~pathlib.Path.rglob` return only directories if *pattern* ends with a pathname components separator: :data:`~os.sep` or :data:`~os.altsep`. (Contributed by Eisuke Kawasima in :issue:`22276` and :issue:`33392`.)
pt_pt: :meth:`~pathlib.Path.glob` e :meth:`~pathlib.Path.rglob` retornam apenas diretórios se *pattern* terminar com um separador de componentes de caminho: :data:`~os.sep` ou :data:`~os.altsep`. (Contribuído por Eisuke Kawasima em :issue:`22276` e :issue:`33392`.)

source: Atomic grouping (``(?>...)``) and possessive quantifiers (``*+``, ``++``, ``?+``, ``{m,n}+``) are now supported in regular expressions. (Contributed by Jeffrey C. Jacobs and Serhiy Storchaka in :issue:`433030`.)
pt_pt: Agrupamento atómico (``(?>...)``) e quantificadores possessivos (``*+``, ``++``, ``?+``, ``{m,n}+``) são agora suportados em expressões regulares. (Contribuído por Jeffrey C. Jacobs e Serhiy Storchaka em :issue:`433030`.)

source: Add optional parameter *dir_fd* in :func:`shutil.rmtree`. (Contributed by Serhiy Storchaka in :issue:`46245`.)
pt_pt: Adicionado o parâmetro opcional *dir_fd* em :func:`shutil.rmtree`. (Contribuído por Serhiy Storchaka em :issue:`46245`.)

source: Add CAN Socket support for NetBSD. (Contributed by Thomas Klausner in :issue:`30512`.)
pt_pt: Adicionado suporte para CAN Socket no NetBSD. (Contribuído por Thomas Klausner em :issue:`30512`.)

source: :meth:`~socket.create_connection` has an option to raise, in case of failure to connect, an :exc:`ExceptionGroup` containing all errors instead of only raising the last error. (Contributed by Irit Katriel in :issue:`29980`.)
pt_pt: :meth:`~socket.create_connection` tem uma opção para lançar, em caso de falha de ligação, um :exc:`ExceptionGroup` contendo todos os erros em vez de lançar apenas o último erro. (Contribuído por Irit Katriel em :issue:`29980`.)

source: You can now disable the authorizer by passing :const:`None` to :meth:`~sqlite3.Connection.set_authorizer`. (Contributed by Erlend E. Aasland in :issue:`44491`.)
pt_pt: Agora pode desativar o autorizador passando :const:`None` para :meth:`~sqlite3.Connection.set_authorizer`. (Contribuído por Erlend E. Aasland em :issue:`44491`.)

source: Collation name :meth:`~sqlite3.Connection.create_collation` can now contain any Unicode character. Collation names with invalid characters now raise :exc:`UnicodeEncodeError` instead of :exc:`sqlite3.ProgrammingError`. (Contributed by Erlend E. Aasland in :issue:`44688`.)
pt_pt: O nome de colação :meth:`~sqlite3.Connection.create_collation` pode agora conter qualquer carácter Unicode. Nomes de colação com caracteres inválidos agora lançam :exc:`UnicodeEncodeError` em vez de :exc:`sqlite3.ProgrammingError`. (Contribuído por Erlend E. Aasland em :issue:`44688`.)

source: :mod:`sqlite3` exceptions now include the SQLite extended error code as :attr:`~sqlite3.Error.sqlite_errorcode` and the SQLite error name as :attr:`~sqlite3.Error.sqlite_errorname`. (Contributed by Aviv Palivoda, Daniel Shahaf, and Erlend E. Aasland in :issue:`16379` and :issue:`24139`.)
pt_pt: As exceções :mod:`sqlite3` agora incluem o código de erro estendido do SQLite como :attr:`~sqlite3.Error.sqlite_errorcode` e o nome do erro do SQLite como :attr:`~sqlite3.Error.sqlite_errorname`. (Contribuído por Aviv Palivoda, Daniel Shahaf e Erlend E. Aasland em :issue:`16379` e :issue:`24139`.)

source: Add :meth:`~sqlite3.Connection.setlimit` and :meth:`~sqlite3.Connection.getlimit` to :class:`sqlite3.Connection` for setting and getting SQLite limits by connection basis. (Contributed by Erlend E. Aasland in :issue:`45243`.)
pt_pt: Adicionados :meth:`~sqlite3.Connection.setlimit` e :meth:`~sqlite3.Connection.getlimit` a :class:`sqlite3.Connection` para definir e obter limites do SQLite por base de ligação. (Contribuído por Erlend E. Aasland em :issue:`45243`.)

source: :mod:`sqlite3` now sets :attr:`sqlite3.threadsafety` based on the default threading mode the underlying SQLite library has been compiled with. (Contributed by Erlend E. Aasland in :issue:`45613`.)
pt_pt: :mod:`sqlite3` agora define :attr:`sqlite3.threadsafety` com base no modo de encadeamento predefinido com o qual a biblioteca SQLite subjacente foi compilada. (Contribuído por Erlend E. Aasland em :issue:`45613`.)

source: :mod:`sqlite3` C callbacks now use unraisable exceptions if callback tracebacks are enabled. Users can now register an :func:`unraisable hook handler <sys.unraisablehook>` to improve their debug experience. (Contributed by Erlend E. Aasland in :issue:`45828`.)
pt_pt: Os callbacks C de :mod:`sqlite3` agora usam exceções não lançáveis se os tracebacks de callback estiverem ativados. Os utilizadores podem agora registar um gestor de :func:`unraisable hook <sys.unraisablehook>` para melhorar a sua experiência de depuração. (Contribuído por Erlend E. Aasland em :issue:`45828`.)

source: Fetch across rollback no longer raises :exc:`~sqlite3.InterfaceError`. Instead we leave it to the SQLite library to handle these cases. (Contributed by Erlend E. Aasland in :issue:`44092`.)
pt_pt: A busca através de rollback já não lança :exc:`~sqlite3.InterfaceError`. Em vez disso, deixamos que a biblioteca SQLite trate destes casos. (Contribuído por Erlend E. Aasland em :issue:`44092`.)

source: Add :meth:`~sqlite3.Connection.serialize` and :meth:`~sqlite3.Connection.deserialize` to :class:`sqlite3.Connection` for serializing and deserializing databases. (Contributed by Erlend E. Aasland in :issue:`41930`.)
pt_pt: Adicionados :meth:`~sqlite3.Connection.serialize` e :meth:`~sqlite3.Connection.deserialize` a :class:`sqlite3.Connection` para serializar e desserializar bases de dados. (Contribuído por Erlend E. Aasland em :issue:`41930`.)

source: Add :meth:`~sqlite3.Connection.create_window_function` to :class:`sqlite3.Connection` for creating aggregate window functions. (Contributed by Erlend E. Aasland in :issue:`34916`.)
pt_pt: Adicionado :meth:`~sqlite3.Connection.create_window_function` a :class:`sqlite3.Connection` para criar funções de janela agregadas. (Contribuído por Erlend E. Aasland em :issue:`34916`.)

source: Add :meth:`~sqlite3.Connection.blobopen` to :class:`sqlite3.Connection`. :class:`sqlite3.Blob` allows incremental I/O operations on blobs. (Contributed by Aviv Palivoda and Erlend E. Aasland in :issue:`24905`.)
pt_pt: Adicionado :meth:`~sqlite3.Connection.blobopen` a :class:`sqlite3.Connection`. :class:`sqlite3.Blob` permite operações de I/O incrementais em blobs. (Contribuído por Aviv Palivoda e Erlend E. Aasland em :issue:`24905`.)

source: Add :meth:`~string.Template.get_identifiers` and :meth:`~string.Template.is_valid` to :class:`string.Template`, which respectively return all valid placeholders, and whether any invalid placeholders are present. (Contributed by Ben Kehoe in :gh:`90465`.)
pt_pt: Adicionados :meth:`~string.Template.get_identifiers` e :meth:`~string.Template.is_valid` a :class:`string.Template`, que retornam, respetivamente, todos os espaços reservados válidos e se existem espaços reservados inválidos. (Contribuído por Ben Kehoe em :gh:`90465`.)

source: :func:`sys.exc_info` now derives the ``type`` and ``traceback`` fields from the ``value`` (the exception instance), so when an exception is modified while it is being handled, the changes are reflected in the results of subsequent calls to :func:`!exc_info`. (Contributed by Irit Katriel in :issue:`45711`.)
pt_pt: :func:`sys.exc_info` agora deriva os campos ``type`` e ``traceback`` do ``value`` (a instância da exceção), de modo que, quando uma exceção é modificada enquanto está a ser tratada, as alterações são refletidas nos resultados de chamadas subsequentes a :func:`!exc_info`. (Contribuído por Irit Katriel em :issue:`45711`.)

source: Add :func:`sys.exception` which returns the active exception instance (equivalent to ``sys.exc_info()[1]``). (Contributed by Irit Katriel in :issue:`46328`.)
pt_pt: Adicionada :func:`sys.exception`, que retorna a instância da exceção ativa (equivalente a ``sys.exc_info()[1]``). (Contribuído por Irit Katriel em :issue:`46328`.)

source: Add the :data:`sys.flags.safe_path <sys.flags>` flag. (Contributed by Victor Stinner in :gh:`57684`.)
pt_pt: Adicionada a flag :data:`sys.flags.safe_path <sys.flags>`. (Contribuído por Victor Stinner em :gh:`57684`.)

source: Three new :ref:`installation schemes <installation_paths>` (*posix_venv*, *nt_venv* and *venv*) were added and are used when Python creates new virtual environments or when it is running from a virtual environment. The first two schemes (*posix_venv* and *nt_venv*) are OS-specific for non-Windows and Windows, the *venv* is essentially an alias to one of them according to the OS Python runs on. This is useful for downstream distributors who modify :func:`sysconfig.get_preferred_scheme`. Third party code that creates new virtual environments should use the new *venv* installation scheme to determine the paths, as does :mod:`venv`. (Contributed by Miro Hrončok in :issue:`45413`.)
pt_pt: Foram adicionados três novos :ref:`esquemas de instalação <installation_paths>` (*posix_venv*, *nt_venv* e *venv*), que são usados quando o Python cria novos ambientes virtuais ou quando está a ser executado a partir de um ambiente virtual. Os dois primeiros esquemas (*posix_venv* e *nt_venv*) são específicos do sistema operativo para não-Windows e Windows, respetivamente; *venv* é essencialmente um alias para um deles, de acordo com o sistema operativo em que o Python está a ser executado. Isto é útil para distribuidores que modificam :func:`sysconfig.get_preferred_scheme`. Código de terceiros que cria novos ambientes virtuais deve usar o novo esquema de instalação *venv* para determinar os caminhos, tal como faz :mod:`venv`. (Contribuído por Miro Hrončok em :issue:`45413`.)

source: :class:`~tempfile.SpooledTemporaryFile` objects now fully implement the methods of :class:`io.BufferedIOBase` or :class:`io.TextIOBase` (depending on file mode). This lets them work correctly with APIs that expect file-like objects, such as compression modules. (Contributed by Carey Metcalfe in :gh:`70363`.)
pt_pt: Os objetos :class:`~tempfile.SpooledTemporaryFile` agora implementam totalmente os métodos de :class:`io.BufferedIOBase` ou :class:`io.TextIOBase` (dependendo do modo do ficheiro). Isto permite que funcionem corretamente com APIs que esperam objetos semelhantes a ficheiros, como módulos de compressão. (Contribuído por Carey Metcalfe em :gh:`70363`.)

source: On Unix, if the ``sem_clockwait()`` function is available in the C library (glibc 2.30 and newer), the :meth:`threading.Lock.acquire` method now uses the monotonic clock (:const:`time.CLOCK_MONOTONIC`) for the timeout, rather than using the system clock (:const:`time.CLOCK_REALTIME`), to not be affected by system clock changes. (Contributed by Victor Stinner in :issue:`41710`.)
pt_pt: No Unix, se a função ``sem_clockwait()`` estiver disponível na biblioteca C (glibc 2.30 e mais recente), o método :meth:`threading.Lock.acquire` agora usa o relógio monotónico (:const:`time.CLOCK_MONOTONIC`) para o tempo limite, em vez de usar o relógio do sistema (:const:`time.CLOCK_REALTIME`), para não ser afetado por alterações no relógio do sistema. (Contribuído por Victor Stinner em :issue:`41710`.)

source: On Unix, :func:`time.sleep` now uses the ``clock_nanosleep()`` or ``nanosleep()`` function, if available, which has a resolution of 1 nanosecond (10\ :sup:`-9` seconds), rather than using ``select()`` which has a resolution of 1 microsecond (10\ :sup:`-6` seconds). (Contributed by Benjamin Szőke and Victor Stinner in :issue:`21302`.)
pt_pt: No Unix, :func:`time.sleep` agora usa a função ``clock_nanosleep()`` ou ``nanosleep()``, se disponível, que tem uma resolução de 1 nanosegundo (10\ :sup:`-9` segundos), em vez de usar ``select()``, que tem uma resolução de 1 microsegundo (10\ :sup:`-6` segundos). (Contribuído por Benjamin Szőke e Victor Stinner em :issue:`21302`.)

source: On Windows 8.1 and newer, :func:`time.sleep` now uses a waitable timer based on `high-resolution timers <https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/high-resolution-timers>`_ which has a resolution of 100 nanoseconds (10\ :sup:`-7` seconds). Previously, it had a resolution of 1 millisecond (10\ :sup:`-3` seconds). (Contributed by Benjamin Szőke, Donghee Na, Eryk Sun and Victor Stinner in :issue:`21302` and :issue:`45429`.)
pt_pt: No Windows 8.1 e mais recente, :func:`time.sleep` agora usa um temporizador aguardável baseado em `temporizadores de alta resolução <https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/high-resolution-timers>`_, que tem uma resolução de 100 nanosegundos (10\ :sup:`-7` segundos). Anteriormente, tinha uma resolução de 1 milissegundo (10\ :sup:`-3` segundos). (Contribuído por Benjamin Szőke, Donghee Na, Eryk Sun e Victor Stinner em :issue:`21302` e :issue:`45429`.)

source: Added method ``info_patchlevel()`` which returns the exact version of the Tcl library as a named tuple similar to :data:`sys.version_info`. (Contributed by Serhiy Storchaka in :gh:`91827`.)
pt_pt: Adicionado o método ``info_patchlevel()``, que retorna a versão exata da biblioteca Tcl como um tuplo nomeado semelhante a :data:`sys.version_info`. (Contribuído por Serhiy Storchaka em :gh:`91827`.)

source: Add :func:`traceback.StackSummary.format_frame_summary` to allow users to override which frames appear in the traceback, and how they are formatted. (Contributed by Ammar Askar in :issue:`44569`.)
pt_pt: Adicionado :func:`traceback.StackSummary.format_frame_summary` para permitir que os utilizadores substituam quais frames aparecem no traceback e como são formatados. (Contribuído por Ammar Askar em :issue:`44569`.)

source: Add :func:`traceback.TracebackException.print`, which prints the formatted :exc:`~traceback.TracebackException` instance to a file. (Contributed by Irit Katriel in :issue:`33809`.)
pt_pt: Adicionado :func:`traceback.TracebackException.print`, que imprime a instância formatada :exc:`~traceback.TracebackException` para um ficheiro. (Contribuído por Irit Katriel em :issue:`33809`.)

source: For major changes, see :ref:`new-feat-related-type-hints-311`.
pt_pt: Para alterações principais, consulte :ref:`new-feat-related-type-hints-311`.

source: Add :func:`typing.assert_never` and :class:`typing.Never`. :func:`typing.assert_never` is useful for asking a type checker to confirm that a line of code is not reachable. At runtime, it raises an :exc:`AssertionError`. (Contributed by Jelle Zijlstra in :gh:`90633`.)
pt_pt: Adicionados :func:`typing.assert_never` e :class:`typing.Never`. :func:`typing.assert_never` é útil para pedir a um verificador de tipo que confirme que uma linha de código não é alcançável. Em tempo de execução, lança um :exc:`AssertionError`. (Contribuído por Jelle Zijlstra em :gh:`90633`.)

source: Add :func:`typing.reveal_type`. This is useful for asking a type checker what type it has inferred for a given expression. At runtime it prints the type of the received value. (Contributed by Jelle Zijlstra in :gh:`90572`.)
pt_pt: Adicionado :func:`typing.reveal_type`. Isto é útil para pedir a um verificador de tipo que tipo inferiu para uma determinada expressão. Em tempo de execução, imprime o tipo do valor recebido. (Contribuído por Jelle Zijlstra em :gh:`90572`.)
