Repository: NyaPuma/python-docs-pt-pt
Catalog: whatsnew/3.11.po
Languages: pt_pt

source: Add :func:`typing.assert_type`. This is useful for asking a type checker to confirm that the type it has inferred for a given expression matches the given type. At runtime it simply returns the received value. (Contributed by Jelle Zijlstra in :gh:`90638`.)
pt_pt: Adicionado :func:`typing.assert_type`. Isto é útil para pedir a um verificador de tipo que confirme que o tipo que inferiu para uma determinada expressão corresponde ao tipo dado. Em tempo de execução, simplesmente retorna o valor recebido. (Contribuído por Jelle Zijlstra em :gh:`90638`.)

source: :data:`typing.TypedDict` types can now be generic. (Contributed by Samodya Abeysiriwardane in :gh:`89026`.)
pt_pt: Os tipos :data:`typing.TypedDict` podem agora ser genéricos. (Contribuído por Samodya Abeysiriwardane em :gh:`89026`.)

source: :class:`~typing.NamedTuple` types can now be generic. (Contributed by Serhiy Storchaka in :issue:`43923`.)
pt_pt: Os tipos :class:`~typing.NamedTuple` podem agora ser genéricos. (Contribuído por Serhiy Storchaka em :issue:`43923`.)

source: Allow subclassing of :class:`typing.Any`. This is useful for avoiding type checker errors related to highly dynamic class, such as mocks. (Contributed by Shantanu Jain in :gh:`91154`.)
pt_pt: Permitida a subclassificação de :class:`typing.Any`. Isto é útil para evitar erros de verificador de tipo relacionados com classes altamente dinâmicas, como mocks. (Contribuído por Shantanu Jain em :gh:`91154`.)

source: The :func:`typing.final` decorator now sets the ``__final__`` attributed on the decorated object. (Contributed by Jelle Zijlstra in :gh:`90500`.)
pt_pt: O decorador :func:`typing.final` agora define o atributo ``__final__`` no objeto decorado. (Contribuído por Jelle Zijlstra em :gh:`90500`.)

source: The :func:`typing.get_overloads` function can be used for introspecting the overloads of a function. :func:`typing.clear_overloads` can be used to clear all registered overloads of a function. (Contributed by Jelle Zijlstra in :gh:`89263`.)
pt_pt: A função :func:`typing.get_overloads` pode ser usada para introspeção das sobrecargas de uma função. :func:`typing.clear_overloads` pode ser usada para limpar todas as sobrecargas registadas de uma função. (Contribuído por Jelle Zijlstra em :gh:`89263`.)

source: The :meth:`~object.__init__` method of :class:`~typing.Protocol` subclasses is now preserved. (Contributed by Adrian Garcia Badarasco in :gh:`88970`.)
pt_pt: O método :meth:`~object.__init__` das subclasses de :class:`~typing.Protocol` é agora preservado. (Contribuído por Adrian Garcia Badarasco em :gh:`88970`.)

source: The representation of empty tuple types (``Tuple[()]``) is simplified. This affects introspection, e.g. ``get_args(Tuple[()])`` now evaluates to ``()`` instead of ``((),)``. (Contributed by Serhiy Storchaka in :gh:`91137`.)
pt_pt: A representação de tipos de tuplos vazios (``Tuple[()]``) foi simplificada. Isto afeta a introspeção, por exemplo, ``get_args(Tuple[()])`` agora avalia para ``()`` em vez de ``((),)``. (Contribuído por Serhiy Storchaka em :gh:`91137`.)

source: Loosen runtime requirements for type annotations by removing the callable check in the private ``typing._type_check`` function. (Contributed by Gregory Beauregard in :gh:`90802`.)
pt_pt: Relaxados os requisitos de tempo de execução para anotações de tipo, removendo a verificação de chamável na função privada ``typing._type_check``. (Contribuído por Gregory Beauregard em :gh:`90802`.)

source: :func:`typing.get_type_hints` now supports evaluating strings as forward references in :ref:`PEP 585 generic aliases <types-genericalias>`. (Contributed by Niklas Rosenstein in :gh:`85542`.)
pt_pt: :func:`typing.get_type_hints` agora suporta a avaliação de cadeias de caracteres como referências antecipadas em :ref:`alias genéricos da PEP 585 <types-genericalias>`. (Contribuído por Niklas Rosenstein em :gh:`85542`.)

source: :func:`typing.get_type_hints` no longer adds :data:`~typing.Optional` to parameters with ``None`` as a default. (Contributed by Nikita Sobolev in :gh:`90353`.)
pt_pt: :func:`typing.get_type_hints` já não adiciona :data:`~typing.Optional` a parâmetros com ``None`` como valor predefinido. (Contribuído por Nikita Sobolev em :gh:`90353`.)

source: :func:`typing.get_type_hints` now supports evaluating bare stringified :data:`~typing.ClassVar` annotations. (Contributed by Gregory Beauregard in :gh:`90711`.)
pt_pt: :func:`typing.get_type_hints` agora suporta a avaliação de anotações :data:`~typing.ClassVar` em forma de cadeia de caracteres simples. (Contribuído por Gregory Beauregard em :gh:`90711`.)

source: :func:`typing.no_type_check` no longer modifies external classes and functions. It also now correctly marks classmethods as not to be type checked. (Contributed by Nikita Sobolev in :gh:`90729`.)
pt_pt: :func:`typing.no_type_check` já não modifica classes e funções externas. Também marca agora corretamente os classmethods como não sendo para verificação de tipo. (Contribuído por Nikita Sobolev em :gh:`90729`.)

source: The Unicode database has been updated to version 14.0.0. (Contributed by Benjamin Peterson in :issue:`45190`).
pt_pt: A base de dados Unicode foi atualizada para a versão 14.0.0. (Contribuído por Benjamin Peterson em :issue:`45190`.)

source: Added methods :meth:`~unittest.TestCase.enterContext` and :meth:`~unittest.TestCase.enterClassContext` of class :class:`~unittest.TestCase`, method :meth:`~unittest.IsolatedAsyncioTestCase.enterAsyncContext` of class :class:`~unittest.IsolatedAsyncioTestCase` and function :func:`unittest.enterModuleContext`. (Contributed by Serhiy Storchaka in :issue:`45046`.)
pt_pt: Adicionados os métodos :meth:`~unittest.TestCase.enterContext` e :meth:`~unittest.TestCase.enterClassContext` da classe :class:`~unittest.TestCase`, o método :meth:`~unittest.IsolatedAsyncioTestCase.enterAsyncContext` da classe :class:`~unittest.IsolatedAsyncioTestCase` e a função :func:`unittest.enterModuleContext`. (Contribuído por Serhiy Storchaka em :issue:`45046`.)

source: When new Python virtual environments are created, the *venv* :ref:`sysconfig installation scheme <installation_paths>` is used to determine the paths inside the environment. When Python runs in a virtual environment, the same installation scheme is the default. That means that downstream distributors can change the default sysconfig install scheme without changing behavior of virtual environments. Third party code that also creates new virtual environments should do the same. (Contributed by Miro Hrončok in :issue:`45413`.)
pt_pt: Quando novos ambientes virtuais Python são criados, o *venv* :ref:`esquema de instalação sysconfig <installation_paths>` é usado para determinar os caminhos dentro do ambiente. Quando o Python é executado em um ambiente virtual, o mesmo esquema de instalação é o padrão. Isso significa que os distribuidores downstream podem alterar o esquema de instalação sysconfig padrão sem alterar o comportamento dos ambientes virtuais. O código de terceiros que também cria novos ambientes virtuais deve fazer o mesmo. (Contribuição de Miro Hrončok em :issue:`45413`.)

source: :func:`warnings.catch_warnings` now accepts arguments for :func:`warnings.simplefilter`, providing a more concise way to locally ignore warnings or convert them to errors. (Contributed by Zac Hatfield-Dodds in :issue:`47074`.)
pt_pt: :func:`warnings.catch_warnings` agora aceita argumentos para :func:`warnings.simplefilter`, fornecendo uma forma mais concisa de ignorar localmente avisos ou convertê-los em erros. (Contribuído por Zac Hatfield-Dodds em :issue:`47074`.)

source: Added support for specifying member name encoding for reading metadata in a :class:`~zipfile.ZipFile`'s directory and file headers. (Contributed by Stephen J. Turnbull and Serhiy Storchaka in :issue:`28080`.)
pt_pt: Adicionado suporte para especificar a codificação do nome do membro para ler metadados num diretório e cabeçalhos de ficheiros de um :class:`~zipfile.ZipFile`. (Contribuído por Stephen J. Turnbull e Serhiy Storchaka em :issue:`28080`.)

source: Added :meth:`ZipFile.mkdir() <zipfile.ZipFile.mkdir>` for creating new directories inside ZIP archives. (Contributed by Sam Ezeh in :gh:`49083`.)
pt_pt: Adicionado :meth:`ZipFile.mkdir() <zipfile.ZipFile.mkdir>` para criar novos diretórios dentro de arquivos ZIP. (Contribuído por Sam Ezeh em :gh:`49083`.)

source: Added :attr:`~zipfile.Path.stem`, :attr:`~zipfile.Path.suffix` and :attr:`~zipfile.Path.suffixes` to :class:`zipfile.Path`. (Contributed by Miguel Brito in :gh:`88261`.)
pt_pt: Adicionados :attr:`~zipfile.Path.stem`, :attr:`~zipfile.Path.suffix` e :attr:`~zipfile.Path.suffixes` a :class:`zipfile.Path`. (Contribuído por Miguel Brito em :gh:`88261`.)

source: Optimizations
pt_pt: Otimizações

source: This section covers specific optimizations independent of the :ref:`whatsnew311-faster-cpython` project, which is covered in its own section.
pt_pt: Esta secção abrange otimizações específicas independentes do projeto :ref:`whatsnew311-faster-cpython`, que é abordado na sua própria secção.

source: The compiler now optimizes simple :ref:`printf-style % formatting <old-string-formatting>` on string literals containing only the format codes ``%s``, ``%r`` and ``%a`` and makes it as fast as a corresponding :term:`f-string` expression. (Contributed by Serhiy Storchaka in :issue:`28307`.)
pt_pt: O compilador agora otimiza a formatação simples no estilo :ref:`printf <old-string-formatting>` em literais de cadeia de caracteres que contêm apenas os códigos de formato ``%s``, ``%r`` e ``%a``, tornando-a tão rápida quanto uma expressão :term:`f-string` correspondente. (Contribuído por Serhiy Storchaka em :issue:`28307`.)

source: Integer division (``//``) is better tuned for optimization by compilers. It is now around 20% faster on x86-64 when dividing an :class:`int` by a value smaller than ``2**30``. (Contributed by Gregory P. Smith and Tim Peters in :gh:`90564`.)
pt_pt: A divisão inteira (``//``) está agora melhor otimizada pelos compiladores. É cerca de 20% mais rápida em x86-64 ao dividir um :class:`int` por um valor menor que ``2**30``. (Contribuído por Gregory P. Smith e Tim Peters em :gh:`90564`.)

source: :func:`sum` is now nearly 30% faster for integers smaller than ``2**30``. (Contributed by Stefan Behnel in :gh:`68264`.)
pt_pt: :func:`sum` é agora quase 30% mais rápida para inteiros menores que ``2**30``. (Contribuído por Stefan Behnel em :gh:`68264`.)

source: Resizing lists is streamlined for the common case, speeding up :meth:`list.append` by ≈15% and simple :term:`list comprehension`\s by up to 20-30% (Contributed by Dennis Sweeney in :gh:`91165`.)
pt_pt: O redimensionamento de listas foi otimizado para o caso comum, acelerando :meth:`list.append` em ≈15% e :term:`list comprehension` simples em até 20-30%. (Contribuído por Dennis Sweeney em :gh:`91165`.)

source: Dictionaries don't store hash values when all keys are Unicode objects, decreasing :class:`dict` size. For example, ``sys.getsizeof(dict.fromkeys("abcdefg"))`` is reduced from 352 bytes to 272 bytes (23% smaller) on 64-bit platforms. (Contributed by Inada Naoki in :issue:`46845`.)
pt_pt: Os dicionários não armazenam valores de hash quando todas as chaves são objetos Unicode, reduzindo o tamanho de :class:`dict`. Por exemplo, ``sys.getsizeof(dict.fromkeys("abcdefg"))`` é reduzido de 352 bytes para 272 bytes (23% menor) em plataformas de 64 bits. (Contribuído por Inada Naoki em :issue:`46845`.)

source: Using :class:`asyncio.DatagramProtocol` is now orders of magnitude faster when transferring large files over UDP, with speeds over 100 times higher for a ≈60 MiB file. (Contributed by msoxzw in :gh:`91487`.)
pt_pt: O uso de :class:`asyncio.DatagramProtocol` é agora ordens de magnitude mais rápido ao transferir ficheiros grandes através de UDP, com velocidades mais de 100 vezes superiores para um ficheiro de ≈60 MiB. (Contribuído por msoxzw em :gh:`91487`.)

source: :mod:`math` functions :func:`~math.comb` and :func:`~math.perm` are now ≈10 times faster for large arguments (with a larger speedup for larger *k*). (Contributed by Serhiy Storchaka in :issue:`37295`.)
pt_pt: As funções :mod:`math` :func:`~math.comb` e :func:`~math.perm` são agora ≈10 vezes mais rápidas para argumentos grandes (com um aumento de velocidade maior para *k* maiores). (Contribuído por Serhiy Storchaka em :issue:`37295`.)

source: The :mod:`statistics` functions :func:`~statistics.mean`, :func:`~statistics.variance` and :func:`~statistics.stdev` now consume iterators in one pass rather than converting them to a :class:`list` first. This is twice as fast and can save substantial memory. (Contributed by Raymond Hettinger in :gh:`90415`.)
pt_pt: As funções :mod:`statistics` :func:`~statistics.mean`, :func:`~statistics.variance` e :func:`~statistics.stdev` agora consomem iteradores numa única passagem, em vez de os converter primeiro para uma :class:`list`. Isto é duas vezes mais rápido e pode poupar memória substancial. (Contribuído por Raymond Hettinger em :gh:`90415`.)

source: :func:`unicodedata.normalize` now normalizes pure-ASCII strings in constant time. (Contributed by Donghee Na in :issue:`44987`.)
pt_pt: :func:`unicodedata.normalize` agora normaliza cadeias de caracteres puramente ASCII em tempo constante. (Contribuído por Donghee Na em :issue:`44987`.)

source: Faster CPython
pt_pt: CPython mais rápido

source: CPython 3.11 is an average of `25% faster <https://github.com/faster-cpython/ideas#published-results>`_ than CPython 3.10 as measured with the `pyperformance <https://github.com/python/pyperformance>`_ benchmark suite, when compiled with GCC on Ubuntu Linux. Depending on your workload, the overall speedup could be 10-60%.
pt_pt: O CPython 3.11 é, em média, `25% mais rápido <https://github.com/faster-cpython/ideas#published-results>`_ do que o CPython 3.10, medido com a suite de benchmark `pyperformance <https://github.com/python/pyperformance>`_, quando compilado com GCC no Ubuntu Linux. Dependendo da carga de trabalho, o aumento geral de velocidade pode ser de 10-60%.

source: This project focuses on two major areas in Python: :ref:`whatsnew311-faster-startup` and :ref:`whatsnew311-faster-runtime`. Optimizations not covered by this project are listed separately under :ref:`whatsnew311-optimizations`.
pt_pt: Este projeto centra-se em duas áreas principais no Python: :ref:`whatsnew311-faster-startup` e :ref:`whatsnew311-faster-runtime`. As otimizações não abrangidas por este projeto estão listadas separadamente em :ref:`whatsnew311-optimizations`.

source: Faster Startup
pt_pt: Arranque mais rápido

source: Frozen imports / Static code objects
pt_pt: Importações congeladas / Objetos de código estáticos

source: Python caches :term:`bytecode` in the :ref:`__pycache__ <tut-pycache>` directory to speed up module loading.
pt_pt: O Python guarda em cache o :term:`bytecode` no diretório :ref:`__pycache__ <tut-pycache>` para acelerar o carregamento de módulos.

source: Previously in 3.10, Python module execution looked like this:
pt_pt: Anteriormente, no Python 3.10, a execução do módulo era assim:

source: Read __pycache__ -> Unmarshal -> Heap allocated code object -> Evaluate
pt_pt: Ler __pycache__ -> Desmarshalling -> Objeto de código alocado no heap -> Avaliar

source: In Python 3.11, the core modules essential for Python startup are "frozen". This means that their :ref:`codeobjects` (and bytecode) are statically allocated by the interpreter. This reduces the steps in module execution process to:
pt_pt: No Python 3.11, os módulos principais essenciais para o arranque do Python estão "congelados". Isto significa que os seus :ref:`codeobjects` (e bytecode) são alocados estaticamente pelo interpretador. Isto reduz os passos no processo de execução do módulo para:

source: Statically allocated code object -> Evaluate
pt_pt: Objeto de código alocado estaticamente -> Avaliar

source: Interpreter startup is now 10-15% faster in Python 3.11. This has a big impact for short-running programs using Python.
pt_pt: O arranque do interpretador é agora 10-15% mais rápido no Python 3.11. Isto tem um grande impacto em programas de curta duração que usam Python.

source: (Contributed by Eric Snow, Guido van Rossum and Kumar Aditya in many issues.)
pt_pt: (Contribuído por Eric Snow, Guido van Rossum e Kumar Aditya em várias issues.)

source: Faster Runtime
pt_pt: Tempo de execução mais rápido

source: Cheaper, lazy Python frames
pt_pt: Frames Python mais económicos e preguiçosos

source: Python frames, holding execution information, are created whenever Python calls a Python function. The following are new frame optimizations:
pt_pt: Os frames Python, que contêm informações de execução, são criados sempre que o Python chama uma função Python. As seguintes são novas otimizações de frames:

source: Streamlined the frame creation process.
pt_pt: Processo de criação de frames simplificado.

source: Avoided memory allocation by generously re-using frame space on the C stack.
pt_pt: Evitada alocação de memória através da reutilização generosa do espaço de frames na pilha C.

source: Streamlined the internal frame struct to contain only essential information. Frames previously held extra debugging and memory management information.
pt_pt: Simplificada a estrutura interna de frames para conter apenas informações essenciais. Anteriormente, os frames continham informações extra de depuração e gestão de memória.

source: Old-style :ref:`frame objects <frame-objects>` are now created only when requested by debuggers or by Python introspection functions such as :func:`sys._getframe` and :func:`inspect.currentframe`. For most user code, no frame objects are created at all. As a result, nearly all Python functions calls have sped up significantly. We measured a 3-7% speedup in pyperformance.
pt_pt: Objetos de frames no estilo antigo :ref:`frame objects <frame-objects>` são agora criados apenas quando solicitados por depuradores ou por funções de introspeção do Python, como :func:`sys._getframe` e :func:`inspect.currentframe`. Para a maioria do código do utilizador, nenhum objeto de frame é criado. Como resultado, quase todas as chamadas de função Python ficaram significativamente mais rápidas. Medimos um aumento de velocidade de 3-7% no pyperformance.

source: (Contributed by Mark Shannon in :issue:`44590`.)
pt_pt: (Contribuído por Mark Shannon em :issue:`44590`.)

source: Inlined Python function calls
pt_pt: Chamadas de função Python em linha

source: During a Python function call, Python will call an evaluating C function to interpret that function's code. This effectively limits pure Python recursion to what's safe for the C stack.
pt_pt: Durante uma chamada de função Python, o Python chamará uma função C de avaliação para interpretar o código dessa função. Isto limita efetivamente a recursão pura do Python ao que é seguro para a pilha C.

source: In 3.11, when CPython detects Python code calling another Python function, it sets up a new frame, and "jumps" to the new code inside the new frame. This avoids calling the C interpreting function altogether.
pt_pt: No Python 3.11, quando o CPython deteta código Python a chamar outra função Python, configura um novo frame e "salta" para o novo código dentro do novo frame. Isto evita chamar completamente a função de interpretação C.

source: Most Python function calls now consume no C stack space, speeding them up. In simple recursive functions like fibonacci or factorial, we observed a 1.7x speedup. This also means recursive functions can recurse significantly deeper (if the user increases the recursion limit with :func:`sys.setrecursionlimit`). We measured a 1-3% improvement in pyperformance.
pt_pt: A maioria das chamadas de função Python agora não consome espaço na pilha C, acelerando-as. Em funções recursivas simples como fibonacci ou fatorial, observámos um aumento de velocidade de 1,7x. Isto também significa que funções recursivas podem recursar significativamente mais profundamente (se o utilizador aumentar o limite de recursão com :func:`sys.setrecursionlimit`). Medimos uma melhoria de 1-3% no pyperformance.

source: (Contributed by Pablo Galindo and Mark Shannon in :issue:`45256`.)
pt_pt: (Contribuído por Pablo Galindo e Mark Shannon em :issue:`45256`.)

source: PEP 659: Specializing Adaptive Interpreter
pt_pt: PEP 659: Interpretador adaptativo especializado

source: :pep:`659` is one of the key parts of the Faster CPython project. The general idea is that while Python is a dynamic language, most code has regions where objects and types rarely change. This concept is known as *type stability*.
pt_pt: A :pep:`659` é uma das partes-chave do projeto Faster CPython. A ideia geral é que, embora o Python seja uma linguagem dinâmica, a maioria do código tem regiões onde objetos e tipos raramente mudam. Este conceito é conhecido como *estabilidade de tipo*.

source: At runtime, Python will try to look for common patterns and type stability in the executing code. Python will then replace the current operation with a more specialized one. This specialized operation uses fast paths available only to those use cases/types, which generally outperform their generic counterparts. This also brings in another concept called *inline caching*, where Python caches the results of expensive operations directly in the :term:`bytecode`.
pt_pt: Em tempo de execução, o Python tentará procurar padrões comuns e estabilidade de tipo no código em execução. O Python substituirá então a operação atual por uma mais especializada. Esta operação especializada usa caminhos rápidos disponíveis apenas para esses casos de uso/tipos, que geralmente superam as suas contrapartes genéricas. Isto também introduz outro conceito chamado *cache em linha*, onde o Python guarda em cache os resultados de operações dispendiosas diretamente no :term:`bytecode`.

source: The specializer will also combine certain common instruction pairs into one superinstruction, reducing the overhead during execution.
pt_pt: O especializador também combinará certos pares de instruções comuns numa única superinstrução, reduzindo a sobrecarga durante a execução.

source: Python will only specialize when it sees code that is "hot" (executed multiple times). This prevents Python from wasting time on run-once code. Python can also de-specialize when code is too dynamic or when the use changes. Specialization is attempted periodically, and specialization attempts are not too expensive, allowing specialization to adapt to new circumstances.
pt_pt: O Python só especializará quando vir código que é "quente" (executado múltiplas vezes). Isto evita que o Python perca tempo com código executado apenas uma vez. O Python também pode desespecializar quando o código é demasiado dinâmico ou quando o uso muda. A especialização é tentada periodicamente, e as tentativas de especialização não são demasiado dispendiosas, permitindo que a especialização se adapte a novas circunstâncias.

source: (PEP written by Mark Shannon, with ideas inspired by Stefan Brunthaler. See :pep:`659` for more information. Implementation by Mark Shannon and Brandt Bucher, with additional help from Irit Katriel and Dennis Sweeney.)
pt_pt: (PEP escrita por Mark Shannon, com ideias inspiradas por Stefan Brunthaler. Consulte :pep:`659` para mais informações. Implementação por Mark Shannon e Brandt Bucher, com ajuda adicional de Irit Katriel e Dennis Sweeney.)

source: Operation
pt_pt: Operação

source: Form
pt_pt: Forma

source: Specialization
pt_pt: Especialização

source: Operation speedup (up to)
pt_pt: Aumento de velocidade da operação (até)

source: Contributor(s)
pt_pt: Contribuidor(es)

source: Binary operations
pt_pt: Operações binárias
