Repository: NyaPuma/python-docs-pt-pt
Catalog: whatsnew/3.11.po
Languages: pt_pt

source: ``stackcheck_counter``: removed.
pt_pt: ``stackcheck_counter``: removido.

source: Code defining ``PyThreadState_GetFrame()`` on Python 3.8 and older::
pt_pt: Código que define ``PyThreadState_GetFrame()`` no Python 3.8 e anteriores::

source: Code defining ``PyThreadState_EnterTracing()`` and ``PyThreadState_LeaveTracing()`` on Python 3.10 and older::
pt_pt: Código que define ``PyThreadState_EnterTracing()`` e ``PyThreadState_LeaveTracing()`` no Python 3.10 e anteriores::

source: Or use `the pythoncapi-compat project <https://github.com/python/pythoncapi-compat>`__ to get these functions on old Python functions.
pt_pt: Ou use o `projeto pythoncapi-compat <https://github.com/python/pythoncapi-compat>`__ para obter estas funções em versões antigas do Python.

source: Distributors are encouraged to build Python with the optimized Blake2 library `libb2`_.
pt_pt: Os distribuidores são incentivados a compilar o Python com a biblioteca Blake2 otimizada `libb2`_.

source: The :c:member:`PyConfig.module_search_paths_set` field must now be set to 1 for initialization to use :c:member:`PyConfig.module_search_paths` to initialize :data:`sys.path`. Otherwise, initialization will recalculate the path and replace any values added to ``module_search_paths``.
pt_pt: O campo :c:member:`PyConfig.module_search_paths_set` deve agora ser definido como 1 para que a inicialização utilize :c:member:`PyConfig.module_search_paths` para inicializar :data:`sys.path`. Caso contrário, a inicialização recalculará o caminho e substituirá quaisquer valores adicionados a ``module_search_paths``.

source: :c:func:`PyConfig_Read` no longer calculates the initial search path, and will not fill any values into :c:member:`PyConfig.module_search_paths`. To calculate default paths and then modify them, finish initialization and use :c:func:`PySys_GetObject` to retrieve :data:`sys.path` as a Python list object and modify it directly.
pt_pt: :c:func:`PyConfig_Read` já não calcula o caminho de pesquisa inicial e não preencherá quaisquer valores em :c:member:`PyConfig.module_search_paths`. Para calcular caminhos predefinidos e depois modificá-los, termine a inicialização e use :c:func:`PySys_GetObject` para recuperar :data:`sys.path` como um objeto de lista Python e modifique-o diretamente.

source: Deprecate the following functions to configure the Python initialization:
pt_pt: As seguintes funções para configurar a inicialização do Python estão obsoletas:

source: Use the new :c:type:`PyConfig` API of the :ref:`Python Initialization Configuration <init-config>` instead (:pep:`587`). (Contributed by Victor Stinner in :gh:`88279`.)
pt_pt: Use a nova API :c:type:`PyConfig` da :ref:`Configuração de Inicialização do Python <init-config>` em vez disso (:pep:`587`). (Contribuído por Victor Stinner em :gh:`88279`.)

source: Deprecate the ``ob_shash`` member of the :c:type:`PyBytesObject`. Use :c:func:`PyObject_Hash` instead. (Contributed by Inada Naoki in :issue:`46864`.)
pt_pt: O membro ``ob_shash`` de :c:type:`PyBytesObject` está obsoleto. Use :c:func:`PyObject_Hash` em vez disso. (Contribuído por Inada Naoki em :issue:`46864`.)

source: The following C APIs have been deprecated in earlier Python releases, and will be removed in Python 3.12.
pt_pt: As seguintes APIs C foram obsoletas em versões anteriores do Python e serão removidas no Python 3.12.

source: :c:func:`!PyFrame_BlockSetup` and :c:func:`!PyFrame_BlockPop` have been removed. (Contributed by Mark Shannon in :issue:`40222`.)
pt_pt: :c:func:`!PyFrame_BlockSetup` e :c:func:`!PyFrame_BlockPop` foram removidas. (Contribuído por Mark Shannon em :issue:`40222`.)

source: Remove the following math macros using the ``errno`` variable:
pt_pt: Remover as seguintes macros matemáticas que usam a variável ``errno``:

source: (Contributed by Victor Stinner in :issue:`45412`.)
pt_pt: (Contribuído por Victor Stinner em :issue:`45412`.)

source: Remove ``Py_UNICODE_COPY()`` and ``Py_UNICODE_FILL()`` macros, deprecated since Python 3.3. Use ``PyUnicode_CopyCharacters()`` or ``memcpy()`` (``wchar_t*`` string), and ``PyUnicode_Fill()`` functions instead. (Contributed by Victor Stinner in :issue:`41123`.)
pt_pt: Remover as macros ``Py_UNICODE_COPY()`` e ``Py_UNICODE_FILL()``, obsoletas desde o Python 3.3. Use as funções ``PyUnicode_CopyCharacters()`` ou ``memcpy()`` (cadeia de caracteres ``wchar_t*``), e ``PyUnicode_Fill()`` em vez disso. (Contribuído por Victor Stinner em :issue:`41123`.)

source: Remove the ``pystrhex.h`` header file. It only contains private functions. C extensions should only include the main ``<Python.h>`` header file. (Contributed by Victor Stinner in :issue:`45434`.)
pt_pt: Remover o ficheiro de cabeçalho ``pystrhex.h``. Contém apenas funções privadas. As extensões C devem incluir apenas o ficheiro de cabeçalho principal ``<Python.h>``. (Contribuído por Victor Stinner em :issue:`45434`.)

source: Remove the ``Py_FORCE_DOUBLE()`` macro. It was used by the ``Py_IS_INFINITY()`` macro. (Contributed by Victor Stinner in :issue:`45440`.)
pt_pt: Remover a macro ``Py_FORCE_DOUBLE()``. Era usada pela macro ``Py_IS_INFINITY()``. (Contribuído por Victor Stinner em :issue:`45440`.)

source: The following items are no longer available when :c:macro:`Py_LIMITED_API` is defined:
pt_pt: Os seguintes itens já não estão disponíveis quando :c:macro:`Py_LIMITED_API` está definido:

source: the ``Py_MARSHAL_VERSION`` macro
pt_pt: a macro ``Py_MARSHAL_VERSION``

source: These are not part of the :ref:`limited API <limited-api-list>`.
pt_pt: Estes não fazem parte da :ref:`API limitada <limited-api-list>`.

source: (Contributed by Victor Stinner in :issue:`45474`.)
pt_pt: (Contribuído por Victor Stinner em :issue:`45474`.)

source: Exclude :c:func:`PyWeakref_GET_OBJECT` from the limited C API. It never worked since the :c:type:`!PyWeakReference` structure is opaque in the limited C API. (Contributed by Victor Stinner in :issue:`35134`.)
pt_pt: Excluir :c:func:`PyWeakref_GET_OBJECT` da API C limitada. Nunca funcionou, uma vez que a estrutura :c:type:`!PyWeakReference` é opaca na API C limitada. (Contribuído por Victor Stinner em :issue:`35134`.)

source: Remove the ``PyHeapType_GET_MEMBERS()`` macro. It was exposed in the public C API by mistake, it must only be used by Python internally. Use the ``PyTypeObject.tp_members`` member instead. (Contributed by Victor Stinner in :issue:`40170`.)
pt_pt: Remover a macro ``PyHeapType_GET_MEMBERS()``. Foi exposta na API C pública por engano; deve ser usada apenas internamente pelo Python. Use o membro ``PyTypeObject.tp_members`` em vez disso. (Contribuído por Victor Stinner em :issue:`40170`.)

source: Remove the ``HAVE_PY_SET_53BIT_PRECISION`` macro (moved to the internal C API). (Contributed by Victor Stinner in :issue:`45412`.)
pt_pt: Remover a macro ``HAVE_PY_SET_53BIT_PRECISION`` (movida para a API C interna). (Contribuído por Victor Stinner em :issue:`45412`.)

source: Remove the :c:type:`Py_UNICODE` encoder APIs, as they have been deprecated since Python 3.3, are little used and are inefficient relative to the recommended alternatives.
pt_pt: Remover as APIs de codificação :c:type:`Py_UNICODE`, uma vez que estão obsoletas desde o Python 3.3, são pouco usadas e são ineficientes em relação às alternativas recomendadas.

source: The removed functions are:
pt_pt: As funções removidas são:

source: See :pep:`624` for details and :pep:`migration guidance <624#alternative-apis>`. (Contributed by Inada Naoki in :issue:`44029`.)
pt_pt: Consulte :pep:`624` para detalhes e :pep:`orientações de migração <624#alternative-apis>`. (Contribuído por Inada Naoki em :issue:`44029`.)

source: Notable changes in 3.11.4
pt_pt: Alterações notáveis no 3.11.4

source: The extraction methods in :mod:`tarfile`, and :func:`shutil.unpack_archive`, have a new a *filter* argument that allows limiting tar features than may be surprising or dangerous, such as creating files outside the destination directory. See :ref:`tarfile-extraction-filter` for details. In Python 3.12, use without the *filter* argument will show a :exc:`DeprecationWarning`. In Python 3.14, the default will switch to ``'data'``. (Contributed by Petr Viktorin in :pep:`706`.)
pt_pt: Os métodos de extração em :mod:`tarfile` e :func:`shutil.unpack_archive` têm um novo argumento *filter* que permite limitar funcionalidades tar que podem ser surpreendentes ou perigosas, como criar ficheiros fora do diretório de destino. Consulte :ref:`tarfile-extraction-filter` para mais detalhes. No Python 3.12, o uso sem o argumento *filter* mostrará um :exc:`DeprecationWarning`. No Python 3.14, o predefinido mudará para ``'data'``. (Contribuído por Petr Viktorin em :pep:`706`.)

source: Notable changes in 3.11.5
pt_pt: Alterações notáveis no 3.11.5

source: Windows builds and macOS installers from python.org now use OpenSSL 3.0.
pt_pt: As compilações para Windows e os instaladores para macOS do python.org agora usam o OpenSSL 3.0.
