Repository: NyaPuma/python-docs-pt-pt
Catalog: whatsnew/3.11.po
Languages: pt_pt

source: :class:`typing.Text`, which exists solely to provide compatibility support between Python 2 and Python 3 code, is now deprecated. Its removal is currently unplanned, but users are encouraged to use :class:`str` instead wherever possible. (Contributed by Alex Waygood in :gh:`92332`.)
pt_pt: :class:`typing.Text`, que existe apenas para fornecer suporte de compatibilidade entre código Python 2 e Python 3, está agora obsoleto. A sua remoção não está atualmente planeada, mas os utilizadores são incentivados a usar :class:`str` em vez disso, sempre que possível. (Contribuído por Alex Waygood em :gh:`92332`.)

source: The keyword argument syntax for constructing :data:`typing.TypedDict` types is now deprecated. Support will be removed in Python 3.13. (Contributed by Jingchen Ye in :gh:`90224`.)
pt_pt: A sintaxe de argumento nomeado para construir tipos :data:`typing.TypedDict` está agora obsoleta. O suporte será removido no Python 3.13. (Contribuído por Jingchen Ye em :gh:`90224`.)

source: :class:`!webbrowser.MacOSX` is deprecated and will be removed in Python 3.13. It is untested, undocumented, and not used by :mod:`webbrowser` itself. (Contributed by Donghee Na in :issue:`42255`.)
pt_pt: :class:`!webbrowser.MacOSX` está obsoleto e será removido no Python 3.13. Não é testado, não está documentado e não é usado pelo próprio :mod:`webbrowser`. (Contribuído por Donghee Na em :issue:`42255`.)

source: The behavior of returning a value from a :class:`~unittest.TestCase` and :class:`~unittest.IsolatedAsyncioTestCase` test methods (other than the default ``None`` value) is now deprecated.
pt_pt: O comportamento de retornar um valor de métodos de teste :class:`~unittest.TestCase` e :class:`~unittest.IsolatedAsyncioTestCase` (diferente do valor predefinido ``None``) está agora obsoleto.

source: Deprecated the following not-formally-documented :mod:`unittest` functions, scheduled for removal in Python 3.13:
pt_pt: As seguintes funções não formalmente documentadas do :mod:`unittest` estão obsoletas, programadas para remoção no Python 3.13:

source: Use :class:`~unittest.TestLoader` methods instead:
pt_pt: Use os métodos :class:`~unittest.TestLoader` em vez disso:

source: (Contributed by Erlend E. Aasland in :issue:`5846`.)
pt_pt: (Contribuído por Erlend E. Aasland em :issue:`5846`.)

source: :meth:`!unittest.TestProgram.usageExit` is marked deprecated, to be removed in 3.13. (Contributed by Carlos Damázio in :gh:`67048`.)
pt_pt: :meth:`!unittest.TestProgram.usageExit` está marcado como obsoleto, para ser removido no Python 3.13. (Contribuído por Carlos Damázio em :gh:`67048`.)

source: Pending Removal in Python 3.12
pt_pt: Remoção pendente no Python 3.12

source: The following Python APIs have been deprecated in earlier Python releases, and will be removed in Python 3.12.
pt_pt: As seguintes APIs do Python foram obsoletas em versões anteriores do Python e serão removidas no Python 3.12.

source: C APIs pending removal are :ref:`listed separately <whatsnew311-c-api-pending-removal>`.
pt_pt: As APIs C pendentes de remoção estão :ref:`listadas separadamente <whatsnew311-c-api-pending-removal>`.

source: The :mod:`!asynchat` module
pt_pt: O módulo :mod:`!asynchat`

source: The :mod:`!asyncore` module
pt_pt: O módulo :mod:`!asyncore`

source: The :ref:`entire distutils package <distutils-deprecated>`
pt_pt: O :ref:`pacote distutils completo <distutils-deprecated>`

source: The :mod:`!imp` module
pt_pt: O módulo :mod:`!imp`

source: The :class:`typing.io <typing.IO>` namespace
pt_pt: O espaço de nomes :class:`typing.io <typing.IO>`

source: The :class:`typing.re <typing.Pattern>` namespace
pt_pt: O espaço de nomes :class:`typing.re <typing.Pattern>`

source: :envvar:`!PYTHONTHREADDEBUG` environment variable
pt_pt: Variável de ambiente :envvar:`!PYTHONTHREADDEBUG`

source: The following deprecated aliases in :mod:`unittest`:
pt_pt: Os seguintes alias obsoletos em :mod:`unittest`:

source: Deprecated alias
pt_pt: Alias obsoleto

source: Method Name
pt_pt: Nome do método

source: Deprecated in
pt_pt: Obsoleto em

source: Removed
pt_pt: Removido

source: This section lists Python APIs that have been removed in Python 3.11.
pt_pt: Esta secção lista as APIs do Python que foram removidas no Python 3.11.

source: Removed C APIs are :ref:`listed separately <whatsnew311-c-api-removed>`.
pt_pt: As APIs C removidas estão :ref:`listadas separadamente <whatsnew311-c-api-removed>`.

source: Removed the :func:`!@asyncio.coroutine` :term:`decorator` enabling legacy generator-based coroutines to be compatible with :keyword:`async` / :keyword:`await` code. The function has been deprecated since Python 3.8 and the removal was initially scheduled for Python 3.10. Use :keyword:`async def` instead. (Contributed by Illia Volochii in :issue:`43216`.)
pt_pt: Removido o :term:`decorador` :func:`!@asyncio.coroutine`, que permitia que co-rotinas baseadas em geradores legados fossem compatíveis com código :keyword:`async` / :keyword:`await`. A função estava obsoleta desde o Python 3.8 e a remoção estava inicialmente programada para o Python 3.10. Use :keyword:`async def` em vez disso. (Contribuído por Illia Volochii em :issue:`43216`.)

source: Removed :class:`!asyncio.coroutines.CoroWrapper` used for wrapping legacy generator-based coroutine objects in the debug mode. (Contributed by Illia Volochii in :issue:`43216`.)
pt_pt: Removido :class:`!asyncio.coroutines.CoroWrapper`, usado para envolver objetos de co-rotina baseados em geradores legados no modo de depuração. (Contribuído por Illia Volochii em :issue:`43216`.)

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint`, disabled in Python 3.9, is now entirely removed. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. (Contributed by Hugo van Kemenade in :issue:`45129`.)
pt_pt: Devido a preocupações significativas de segurança, o parâmetro *reuse_address* de :meth:`asyncio.loop.create_datagram_endpoint`, desativado no Python 3.9, foi agora completamente removido. Isto deve-se ao comportamento da opção de socket ``SO_REUSEADDR`` em UDP. (Contribuído por Hugo van Kemenade em :issue:`45129`.)

source: Removed the :mod:`!binhex` module, deprecated in Python 3.9. Also removed the related, similarly-deprecated :mod:`binascii` functions:
pt_pt: Removido o módulo :mod:`!binhex`, obsoleto no Python 3.9. Também foram removidas as funções relacionadas e igualmente obsoletas do :mod:`binascii`:

source: The :func:`binascii.crc_hqx` function remains available.
pt_pt: A função :func:`binascii.crc_hqx` continua disponível.

source: (Contributed by Victor Stinner in :issue:`45085`.)
pt_pt: (Contribuído por Victor Stinner em :issue:`45085`.)

source: Removed the :mod:`!distutils` ``bdist_msi`` command deprecated in Python 3.9. Use ``bdist_wheel`` (wheel packages) instead. (Contributed by Hugo van Kemenade in :issue:`45124`.)
pt_pt: Removido o comando ``bdist_msi`` do :mod:`!distutils`, obsoleto no Python 3.9. Use ``bdist_wheel`` (pacotes wheel) em vez disso. (Contribuído por Hugo van Kemenade em :issue:`45124`.)

source: Removed the :meth:`~object.__getitem__` methods of :class:`xml.dom.pulldom.DOMEventStream`, :class:`wsgiref.util.FileWrapper` and :class:`fileinput.FileInput`, deprecated since Python 3.9. (Contributed by Hugo van Kemenade in :issue:`45132`.)
pt_pt: Removidos os métodos :meth:`~object.__getitem__` de :class:`xml.dom.pulldom.DOMEventStream`, :class:`wsgiref.util.FileWrapper` e :class:`fileinput.FileInput`, obsoletos desde o Python 3.9. (Contribuído por Hugo van Kemenade em :issue:`45132`.)

source: Removed the deprecated :mod:`gettext` functions :func:`!lgettext`, :func:`!ldgettext`, :func:`!lngettext` and :func:`!ldngettext`. Also removed the :func:`!bind_textdomain_codeset` function, the :meth:`!NullTranslations.output_charset` and :meth:`!NullTranslations.set_output_charset` methods, and the *codeset* parameter of :func:`!translation` and :func:`!install`, since they are only used for the :func:`!l*gettext` functions. (Contributed by Donghee Na and Serhiy Storchaka in :issue:`44235`.)
pt_pt: Removidas as funções obsoletas do :mod:`gettext`: :func:`!lgettext`, :func:`!ldgettext`, :func:`!lngettext` e :func:`!ldngettext`. Também foram removidas a função :func:`!bind_textdomain_codeset`, os métodos :meth:`!NullTranslations.output_charset` e :meth:`!NullTranslations.set_output_charset`, e o parâmetro *codeset* de :func:`!translation` e :func:`!install`, uma vez que são usados apenas para as funções :func:`!l*gettext`. (Contribuído por Donghee Na e Serhiy Storchaka em :issue:`44235`.)

source: Removed from the :mod:`inspect` module:
pt_pt: Removido do módulo :mod:`inspect`:

source: The :func:`!getargspec` function, deprecated since Python 3.0; use :func:`inspect.signature` or :func:`inspect.getfullargspec` instead.
pt_pt: A função :func:`!getargspec`, obsoleta desde o Python 3.0; use :func:`inspect.signature` ou :func:`inspect.getfullargspec` em vez disso.

source: The :func:`!formatargspec` function, deprecated since Python 3.5; use the :func:`inspect.signature` function or the :class:`inspect.Signature` object directly.
pt_pt: A função :func:`!formatargspec`, obsoleta desde o Python 3.5; use a função :func:`inspect.signature` ou o objeto :class:`inspect.Signature` diretamente.

source: The undocumented :meth:`!Signature.from_builtin` and :meth:`!Signature.from_function` methods, deprecated since Python 3.5; use the :meth:`Signature.from_callable() <inspect.Signature.from_callable>` method instead.
pt_pt: Os métodos não documentados :meth:`!Signature.from_builtin` e :meth:`!Signature.from_function`, obsoletos desde o Python 3.5; use o método :meth:`Signature.from_callable() <inspect.Signature.from_callable>` em vez disso.

source: (Contributed by Hugo van Kemenade in :issue:`45320`.)
pt_pt: (Contribuído por Hugo van Kemenade em :issue:`45320`.)

source: Removed the :meth:`~object.__class_getitem__` method from :class:`pathlib.PurePath`, because it was not used and added by mistake in previous versions. (Contributed by Nikita Sobolev in :issue:`46483`.)
pt_pt: Removido o método :meth:`~object.__class_getitem__` de :class:`pathlib.PurePath`, porque não era usado e foi adicionado por engano em versões anteriores. (Contribuído por Nikita Sobolev em :issue:`46483`.)

source: Removed the :class:`!MailmanProxy` class in the :mod:`!smtpd` module, as it is unusable without the external :mod:`!mailman` package. (Contributed by Donghee Na in :issue:`35800`.)
pt_pt: Removida a classe :class:`!MailmanProxy` do módulo :mod:`!smtpd`, uma vez que é inutilizável sem o pacote externo :mod:`!mailman`. (Contribuído por Donghee Na em :issue:`35800`.)

source: Removed the deprecated :meth:`!split` method of :class:`!_tkinter.TkappType`. (Contributed by Erlend E. Aasland in :issue:`38371`.)
pt_pt: Removido o método obsoleto :meth:`!split` de :class:`!_tkinter.TkappType`. (Contribuído por Erlend E. Aasland em :issue:`38371`.)

source: Removed namespace package support from :mod:`unittest` discovery. It was introduced in Python 3.4 but has been broken since Python 3.7. (Contributed by Inada Naoki in :issue:`23882`.)
pt_pt: Removido o suporte para pacotes de espaço de nomes da descoberta :mod:`unittest`. Foi introduzido no Python 3.4, mas está quebrado desde o Python 3.7. (Contribuído por Inada Naoki em :issue:`23882`.)

source: Removed the undocumented private :meth:`!float.__set_format__` method, previously known as :meth:`!float.__setformat__` in Python 3.7. Its docstring said: "You probably don't want to use this function. It exists mainly to be used in Python's test suite." (Contributed by Victor Stinner in :issue:`46852`.)
pt_pt: Removido o método privado não documentado :meth:`!float.__set_format__`, anteriormente conhecido como :meth:`!float.__setformat__` no Python 3.7. A sua docstring dizia: "Provavelmente não quer usar esta função. Ela existe principalmente para ser usada na suite de testes do Python." (Contribuído por Victor Stinner em :issue:`46852`.)

source: The :option:`!--experimental-isolated-subinterpreters` configure flag (and corresponding :c:macro:`!EXPERIMENTAL_ISOLATED_SUBINTERPRETERS` macro) have been removed.
pt_pt: A flag de configuração :option:`!--experimental-isolated-subinterpreters` (e a macro correspondente :c:macro:`!EXPERIMENTAL_ISOLATED_SUBINTERPRETERS`) foram removidas.

source: :pypi:`Pynche` --- The Pythonically Natural Color and Hue Editor --- has been moved out of ``Tools/scripts`` and is `being developed independently <https://gitlab.com/warsaw/pynche/-/tree/main>`_ from the Python source tree.
pt_pt: :pypi:`Pynche` --- O Editor de Cor e Matiz Naturalmente Pythonico --- foi movido de ``Tools/scripts`` e está a `ser desenvolvido independentemente <https://gitlab.com/warsaw/pynche/-/tree/main>`_ da árvore de origem do Python.

source: Porting to Python 3.11
pt_pt: Portabilidade para Python 3.11

source: This section lists previously described changes and other bugfixes in the Python API that may require changes to your Python code.
pt_pt: Esta secção lista alterações previamente descritas e outras correções de bugs na API do Python que podem exigir alterações ao seu código Python.

source: Porting notes for the C API are :ref:`listed separately <whatsnew311-c-api-porting>`.
pt_pt: As notas de portabilidade para a API C são :ref:`listadas separadamente <whatsnew311-c-api-porting>`.

source: :func:`open`, :func:`io.open`, :func:`codecs.open` and :class:`fileinput.FileInput` no longer accept ``'U'`` ("universal newline") in the file mode. In Python 3, "universal newline" mode is used by default whenever a file is opened in text mode, and the ``'U'`` flag has been deprecated since Python 3.3. The :ref:`newline parameter <open-newline-parameter>` to these functions controls how universal newlines work. (Contributed by Victor Stinner in :issue:`37330`.)
pt_pt: :func:`open`, :func:`io.open`, :func:`codecs.open` e :class:`fileinput.FileInput` já não aceitam ``'U'`` ("nova linha universal") no modo de ficheiro. No Python 3, o modo «nova linha universal» é usado por predefinição sempre que um ficheiro é aberto no modo texto, e o sinalizador ``'U'`` foi descontinuado desde o Python 3.3. O :ref:`parâmetro nova linha <open-newline-parameter>` para estas funções controla como as novas linhas universais funcionam. (Contribuição de Victor Stinner na :issue:`37330`.)

source: :class:`ast.AST` node positions are now validated when provided to :func:`compile` and other related functions. If invalid positions are detected, a :exc:`ValueError` will be raised. (Contributed by Pablo Galindo in :gh:`93351`)
pt_pt: As posições dos nós :class:`ast.AST` são agora validadas quando fornecidas a :func:`compile` e outras funções relacionadas. Se forem detetadas posições inválidas, será lançado um :exc:`ValueError`. (Contribuído por Pablo Galindo em :gh:`93351`)

source: Prohibited passing non-:class:`concurrent.futures.ThreadPoolExecutor` executors to :meth:`asyncio.loop.set_default_executor` following a deprecation in Python 3.8. (Contributed by Illia Volochii in :issue:`43234`.)
pt_pt: Proibida a passagem de executores que não sejam :class:`concurrent.futures.ThreadPoolExecutor` para :meth:`asyncio.loop.set_default_executor`, seguindo uma obsolescência no Python 3.8. (Contribuído por Illia Volochii em :issue:`43234`.)

source: :mod:`calendar`: The :class:`calendar.LocaleTextCalendar` and :class:`calendar.LocaleHTMLCalendar` classes now use :func:`locale.getlocale`, instead of using :func:`locale.getdefaultlocale`, if no locale is specified. (Contributed by Victor Stinner in :issue:`46659`.)
pt_pt: :mod:`calendar`: As classes :class:`calendar.LocaleTextCalendar` e :class:`calendar.LocaleHTMLCalendar` agora usam :func:`locale.getlocale`, em vez de :func:`locale.getdefaultlocale`, se nenhuma localidade for especificada. (Contribuído por Victor Stinner em :issue:`46659`.)

source: The :mod:`pdb` module now reads the :file:`.pdbrc` configuration file with the ``'UTF-8'`` encoding. (Contributed by Srinivas Reddy Thatiparthy (శ్రీనివాస్ రెడ్డి తాటిపర్తి) in :issue:`41137`.)
pt_pt: O módulo :mod:`pdb` agora lê o ficheiro de configuração :file:`.pdbrc` com a codificação ``'UTF-8'``. (Contribuído por Srinivas Reddy Thatiparthy (శ్రీనివాస్ రెడ్డి తాటిపర్తి) em :issue:`41137`.)

source: The *population* parameter of :func:`random.sample` must be a sequence, and automatic conversion of :class:`set`\s to :class:`list`\s is no longer supported. Also, if the sample size is larger than the population size, a :exc:`ValueError` is raised. (Contributed by Raymond Hettinger in :issue:`40465`.)
pt_pt: O parâmetro *population* de :func:`random.sample` deve ser uma sequência, e a conversão automática de :class:`set` para :class:`list` já não é suportada. Além disso, se o tamanho da amostra for maior que o tamanho da população, é lançado um :exc:`ValueError`. (Contribuído por Raymond Hettinger em :issue:`40465`.)

source: The *random* optional parameter of :func:`random.shuffle` was removed. It was previously an arbitrary random function to use for the shuffle; now, :func:`random.random` (its previous default) will always be used.
pt_pt: O parâmetro opcional *random* de :func:`random.shuffle` foi removido. Era anteriormente uma função aleatória arbitrária a usar para a embaralhamento; agora, :func:`random.random` (o seu valor predefinido anterior) será sempre usado.

source: In :mod:`re` :ref:`re-syntax`, global inline flags (e.g. ``(?i)``) can now only be used at the start of regular expressions. Using them elsewhere has been deprecated since Python 3.6. (Contributed by Serhiy Storchaka in :issue:`47066`.)
pt_pt: Em :mod:`re` :ref:`re-syntax`, as flags em linha globais (por exemplo, ``(?i)``) agora só podem ser usadas no início de expressões regulares. O seu uso noutros locais está obsoleto desde o Python 3.6. (Contribuído por Serhiy Storchaka em :issue:`47066`.)

source: In the :mod:`re` module, several long-standing bugs where fixed that, in rare cases, could cause capture groups to get the wrong result. Therefore, this could change the captured output in these cases. (Contributed by Ma Lin in :issue:`35859`.)
pt_pt: No módulo :mod:`re`, vários bugs de longa data foram corrigidos que, em casos raros, podiam fazer com que os grupos de captura obtivessem o resultado errado. Portanto, isto poderia alterar a saída capturada nestes casos. (Contribuído por Ma Lin em :issue:`35859`.)

source: Build Changes
pt_pt: Alterações na compilação

source: CPython now has :pep:`11` :pep:`Tier 3 support <11#tier-3>` for cross compiling to the `WebAssembly <https://webassembly.org/>`_ platforms `Emscripten <https://emscripten.org/>`_ (``wasm32-unknown-emscripten``, i.e. Python in the browser) and `WebAssembly System Interface (WASI) <https://wasi.dev/>`_ (``wasm32-unknown-wasi``). The effort is inspired by previous work like `Pyodide <https://pyodide.org/>`_. These platforms provide a limited subset of POSIX APIs; Python standard libraries features and modules related to networking, processes, threading, signals, mmap, and users/groups are not available or don't work. (Emscripten contributed by Christian Heimes and Ethan Smith in :gh:`84461` and WASI contributed by Christian Heimes in :gh:`90473`; platforms promoted in :gh:`95085`)
pt_pt: O CPython agora tem suporte :pep:`11` :pep:`Tier 3 <11#tier-3>` para compilação cruzada para as plataformas `WebAssembly <https://webassembly.org/>`_ `Emscripten <https://emscripten.org/>`_ (``wasm32-unknown-emscripten``, ou seja, Python no navegador) e `WebAssembly System Interface (WASI) <https://wasi.dev/>`_ (``wasm32-unknown-wasi``). O esforço é inspirado por trabalhos anteriores como `Pyodide <https://pyodide.org/>`_. Estas plataformas fornecem um subconjunto limitado de APIs POSIX; funcionalidades e módulos da biblioteca padrão do Python relacionados com redes, processos, threads, sinais, mmap e utilizadores/grupos não estão disponíveis ou não funcionam. (Emscripten contribuído por Christian Heimes e Ethan Smith em :gh:`84461` e WASI contribuído por Christian Heimes em :gh:`90473`; plataformas promovidas em :gh:`95085`)

source: Building CPython now requires:
pt_pt: A compilação do CPython agora requer:

source: A `C11 <https://en.cppreference.com/w/c/11>`_ compiler and standard library. `Optional C11 features <https://en.wikipedia.org/wiki/C11_(C_standard_revision)#Optional_features>`_ are not required. (Contributed by Victor Stinner in :issue:`46656`, :issue:`45440` and :issue:`46640`.)
pt_pt: Um compilador e biblioteca padrão `C11 <https://en.cppreference.com/w/c/11>`_. Funcionalidades opcionais do C11 <https://en.wikipedia.org/wiki/C11_(C_standard_revision)#Optional_features>`_ não são necessárias. (Contribuído por Victor Stinner em :issue:`46656`, :issue:`45440` e :issue:`46640`.)

source: Support for `IEEE 754 <https://en.wikipedia.org/wiki/IEEE_754>`_ floating-point numbers. (Contributed by Victor Stinner in :issue:`46917`.)
pt_pt: Suporte para números de `ponto flutuante IEEE 754 <https://en.wikipedia.org/wiki/IEEE_754>`_. (Contribuído por Victor Stinner em :issue:`46917`.)

source: The :c:macro:`!Py_NO_NAN` macro has been removed. Since CPython now requires IEEE 754 floats, NaN values are always available. (Contributed by Victor Stinner in :issue:`46656`.)
pt_pt: A macro :c:macro:`!Py_NO_NAN` foi removida. Uma vez que o CPython agora requer flutuantes IEEE 754, os valores NaN estão sempre disponíveis. (Contribuído por Victor Stinner em :issue:`46656`.)

source: The :mod:`tkinter` package now requires `Tcl/Tk <https://www.tcl.tk>`_ version 8.5.12 or newer. (Contributed by Serhiy Storchaka in :issue:`46996`.)
pt_pt: O pacote :mod:`tkinter` agora requer a versão 8.5.12 ou mais recente do `Tcl/Tk <https://www.tcl.tk>`_. (Contribuído por Serhiy Storchaka em :issue:`46996`.)

source: Build dependencies, compiler flags, and linker flags for most stdlib extension modules are now detected by :program:`configure`. libffi, libnsl, libsqlite3, zlib, bzip2, liblzma, libcrypt, Tcl/Tk, and uuid flags are detected by `pkg-config <https://www.freedesktop.org/wiki/Software/pkg-config/>`_ (when available). :mod:`tkinter` now requires a pkg-config command to detect development settings for `Tcl/Tk`_ headers and libraries. (Contributed by Christian Heimes and Erlend Egeberg Aasland in :issue:`45847`, :issue:`45747`, and :issue:`45763`.)
pt_pt: As dependências de compilação, flags do compilador e flags do ligador para a maioria dos módulos de extensão da biblioteca padrão são agora detetadas por :program:`configure`. As flags libffi, libnsl, libsqlite3, zlib, bzip2, liblzma, libcrypt, Tcl/Tk e uuid são detetadas pelo `pkg-config <https://www.freedesktop.org/wiki/Software/pkg-config/>`_ (quando disponível). O :mod:`tkinter` agora requer um comando pkg-config para detetar as definições de desenvolvimento para os cabeçalhos e bibliotecas do `Tcl/Tk`_. (Contribuído por Christian Heimes e Erlend Egeberg Aasland em :issue:`45847`, :issue:`45747` e :issue:`45763`.)

source: libpython is no longer linked against libcrypt. (Contributed by Mike Gilbert in :issue:`45433`.)
pt_pt: A libpython já não está ligada à libcrypt. (Contribuído por Mike Gilbert em :issue:`45433`.)

source: CPython can now be built with the `ThinLTO <https://clang.llvm.org/docs/ThinLTO.html>`_ option via passing ``thin`` to :option:`--with-lto`, i.e. ``--with-lto=thin``. (Contributed by Donghee Na and Brett Holman in :issue:`44340`.)
pt_pt: O CPython pode agora ser compilado com a opção `ThinLTO <https://clang.llvm.org/docs/ThinLTO.html>`_ passando ``thin`` para :option:`--with-lto`, ou seja, ``--with-lto=thin``. (Contribuído por Donghee Na e Brett Holman em :issue:`44340`.)
