Repository: NyaPuma/python-docs-pt-pt
Catalog: whatsnew/3.11.po
Languages: pt_pt

source: What's New In Python 3.11
pt_pt: Novidades no Python 3.11

source: This article explains the new features in Python 3.11, compared to 3.10. Python 3.11 was released on October 24, 2022. For full details, see the :ref:`changelog <changelog>`.
pt_pt: Este artigo explica as novas funcionalidades do Python 3.11, em comparação com o 3.10. O Python 3.11 foi lançado a 24 de outubro de 2022. Para detalhes completos, consulte o :ref:`registo de alterações <changelog>`.

source: Summary -- Release highlights
pt_pt: Resumo — Destaques da versão

source: Python 3.11 is between 10-60% faster than Python 3.10. On average, we measured a 1.25x speedup on the standard benchmark suite. See :ref:`whatsnew311-faster-cpython` for details.
pt_pt: O Python 3.11 é entre 10% a 60% mais rápido do que o Python 3.10. Em média, medimos um aumento de velocidade de 1,25x no conjunto de testes de referência padrão. Consulte :ref:`whatsnew311-faster-cpython` para mais detalhes.

source: New syntax features:
pt_pt: Novas funcionalidades de sintaxe:

source: New built-in features:
pt_pt: Novas funcionalidades integradas:

source: New standard library modules:
pt_pt: Novos módulos da biblioteca padrão:

source: :pep:`680`: :mod:`tomllib` — Support for parsing `TOML <https://toml.io/>`_ in the Standard Library
pt_pt: :pep:`680`: :mod:`tomllib` — Suporte para análise de `TOML <https://toml.io/>`_ na Biblioteca Padrão

source: Interpreter improvements:
pt_pt: Melhorias no interpretador:

source: New :option:`-P` command line option and :envvar:`PYTHONSAFEPATH` environment variable to :ref:`disable automatically prepending potentially unsafe paths <whatsnew311-pythonsafepath>` to :data:`sys.path`
pt_pt: Nova opção de linha de comando :option:`-P` e variável de ambiente :envvar:`PYTHONSAFEPATH` para :ref:`desabilitar automaticamente a anteposição automática de caminhos potencialmente inseguros <whatsnew311-pythonsafepath>` para :data:`sys.path`

source: New typing features:
pt_pt: Novas funcionalidades de tipagem:

source: Important deprecations, removals and restrictions:
pt_pt: Descontinuações, remoções e restrições importantes:

source: :pep:`594`: :ref:`Many legacy standard library modules have been deprecated <whatsnew311-pep594>` and will be removed in Python 3.13
pt_pt: :pep:`594`: :ref:`Muitos módulos legados de biblioteca padrão foram descontinuados <whatsnew311-pep594>` e serão removidos no Python 3.13

source: :pep:`624`: :ref:`Py_UNICODE encoder APIs have been removed <whatsnew311-pep624>`
pt_pt: :pep:`624`: :ref:`APIs do codificador Py_UNICODE foram removidas <whatsnew311-pep624>`

source: :pep:`670`: :ref:`Macros converted to static inline functions <whatsnew311-pep670>`
pt_pt: :pep:`670`: :ref:`Macros convertidas em funções estáticas em linha <whatsnew311-pep670>`

source: New Features
pt_pt: Novas Funcionalidades

source: PEP 657: Fine-grained error locations in tracebacks
pt_pt: PEP 657: Localização precisa de erros em tracebacks

source: When printing tracebacks, the interpreter will now point to the exact expression that caused the error, instead of just the line. For example:
pt_pt: Ao imprimir tracebacks, o interpretador irá agora apontar para a expressão exata que causou o erro, em vez de apenas indicar a linha. Por exemplo:

source: Previous versions of the interpreter would point to just the line, making it ambiguous which object was ``None``. These enhanced errors can also be helpful when dealing with deeply nested :class:`dict` objects and multiple function calls:
pt_pt: Versões anteriores do interpretador apenas indicavam a linha, tornando ambíguo qual objeto era ``None``. Estes erros melhorados também podem ser úteis ao lidar com objetos :class:`dict` profundamente aninhados e múltiplas chamadas de função:

source: As well as complex arithmetic expressions:
pt_pt: Bem como expressões aritméticas complexas:

source: Additionally, the information used by the enhanced traceback feature is made available via a general API, that can be used to correlate :term:`bytecode` :ref:`instructions <bytecodes>` with source code location. This information can be retrieved using:
pt_pt: Além disso, as informações utilizadas pela funcionalidade de rastreamento aprimorada são disponibilizadas por meio de uma API geral, que pode ser usada para correlacionar :term:`bytecode` :ref:`instruções <bytecodes>` com a localização do código-fonte. Essas informações podem ser recuperadas usando:

source: The :meth:`codeobject.co_positions` method in Python.
pt_pt: O método :meth:`codeobject.co_positions` no Python.

source: The :c:func:`PyCode_Addr2Location` function in the C API.
pt_pt: A função :c:func:`PyCode_Addr2Location` na API C.

source: See :pep:`657` for more details. (Contributed by Pablo Galindo, Batuhan Taskaya and Ammar Askar in :issue:`43950`.)
pt_pt: Veja :pep:`657` para mais detalhes. (Contribuição de Pablo Galindo, Batuhan Taskaya e Ammar Askar em :issue:`43950`.)

source: This feature requires storing column positions in :ref:`codeobjects`, which may result in a small increase in interpreter memory usage and disk usage for compiled Python files. To avoid storing the extra information and deactivate printing the extra traceback information, use the :option:`-X no_debug_ranges <-X>` command line option or the :envvar:`PYTHONNODEBUGRANGES` environment variable.
pt_pt: Esse recurso requer o armazenamento de posições de coluna em :ref:`codeobjects`, o que pode resultar em um pequeno aumento no uso de memória do interpretador e no uso de disco para ficheiros Python compilados. Para evitar armazenar as informações extras e desativar a exibição das informações extras de rastreamento, use a opção de linha de comando :option:`-X no_debug_ranges <-X>` ou a variável de ambiente :envvar:`PYTHONNODEBUGRANGES`.

source: PEP 654: Exception Groups and ``except*``
pt_pt: PEP 654: Grupos de exceções e ``except*``

source: :pep:`654` introduces language features that enable a program to raise and handle multiple unrelated exceptions simultaneously. The builtin types :exc:`ExceptionGroup` and :exc:`BaseExceptionGroup` make it possible to group exceptions and raise them together, and the new :keyword:`except* <except_star>` syntax generalizes :keyword:`except` to match subgroups of exception groups.
pt_pt: A :pep:`654` introduz funcionalidades de linguagem que permitem a um programa lançar e tratar múltiplas exceções não relacionadas simultaneamente. Os tipos integrados :exc:`ExceptionGroup` e :exc:`BaseExceptionGroup` permitem agrupar exceções e lançá-las em conjunto, e a nova sintaxe :keyword:`except* <except_star>` generaliza :keyword:`except` para corresponder a subgrupos de grupos de exceções.

source: See :pep:`654` for more details.
pt_pt: Veja :pep:`654` para mais detalhes.

source: (Contributed by Irit Katriel in :issue:`45292`. PEP written by Irit Katriel, Yury Selivanov and Guido van Rossum.)
pt_pt: (Contribuição de Irit Katriel em :issue:`45292`. PEP escrita por Irit Katriel, Yury Selivanov e Guido van Rossum.)

source: PEP 678: Exceptions can be enriched with notes
pt_pt: PEP 678: Exceções podem ser enriquecidas com notas

source: The :meth:`~BaseException.add_note` method is added to :exc:`BaseException`. It can be used to enrich exceptions with context information that is not available at the time when the exception is raised. The added notes appear in the default traceback.
pt_pt: O método :meth:`~BaseException.add_note` foi adicionado a :exc:`BaseException`. Pode ser usado para enriquecer exceções com informações de contexto que não estão disponíveis no momento em que a exceção é lançada. As notas adicionadas aparecem no traceback predefinido.

source: See :pep:`678` for more details.
pt_pt: Veja :pep:`678` para mais detalhes.

source: (Contributed by Irit Katriel in :issue:`45607`. PEP written by Zac Hatfield-Dodds.)
pt_pt: (Contribuição de Irit Katriel em :issue:`45607`. PEP escrita por Zac Hatfield-Dodds.)

source: Windows ``py.exe`` launcher improvements
pt_pt: Melhorias no inicializador ``py.exe`` do Windows

source: The copy of the :ref:`launcher` included with Python 3.11 has been significantly updated. It now supports company/tag syntax as defined in :pep:`514` using the :samp:`-V:{<company>}/{<tag>}` argument instead of the limited :samp:`-{<major>}.{<minor>}`. This allows launching distributions other than ``PythonCore``, the one hosted on `python.org <https://www.python.org>`_.
pt_pt: A cópia do :ref:`launcher` incluída no Python 3.11 foi significativamente atualizada. Ela agora oferece suporte à sintaxe de company/tag conforme definido em :pep:`514` usando o argumento :samp:`-V:{<company>}/{<tag>}` em vez do limitado :samp:`-{<major>}.{<minor>}`. Isso permite iniciar outras distribuições além de ``PythonCore``, aquela hospedada em `python.org <https://www.python.org>`_.

source: When using ``-V:`` selectors, either company or tag can be omitted, but all installs will be searched. For example, ``-V:OtherPython/`` will select the "best" tag registered for ``OtherPython``, while ``-V:3.11`` or ``-V:/3.11`` will select the "best" distribution with tag ``3.11``.
pt_pt: Ao usar seletores ``-V:``, a empresa ou a tag podem ser omitidas, mas todas as instalações serão pesquisadas. Por exemplo, ``-V:OtherPython/`` selecionará a «melhor» tag registada para ``OtherPython``, enquanto ``-V:3.11`` ou ``-V:/3.11`` selecionará a «melhor» distribuição com a tag ``3.11``.

source: When using the legacy :samp:`-{<major>}`, :samp:`-{<major>}.{<minor>}`, :samp:`-{<major>}-{<bitness>}` or :samp:`-{<major>}.{<minor>}-{<bitness>}` arguments, all existing behaviour should be preserved from past versions, and only releases from ``PythonCore`` will be selected. However, the ``-64`` suffix now implies "not 32-bit" (not necessarily x86-64), as there are multiple supported 64-bit platforms. 32-bit runtimes are detected by checking the runtime's tag for a ``-32`` suffix. All releases of Python since 3.5 have included this in their 32-bit builds.
pt_pt: Ao usar os argumentos legados :samp:`-{<major>}`, :samp:`-{<major>}.{<minor>}`, :samp:`-{<major>}-{<bitness>}` ou :samp:`-{<major>}.{<minor>}-{<bitness>}`, todo o comportamento existente deve ser preservado de versões anteriores e só lançamentos de ``PythonCore`` serão selecionados. No entanto, o sufixo ``-64`` agora implica "não 32 bits" (não necessariamente x86-64), pois existem várias plataformas de 64 bits suportadas. Tempos de execução de 32 bits são detectados verificando a tag do tempo de execução para um sufixo ``-32``. Todas as versões do Python desde 3.5 incluírão isso nas suas compilações de 32 bits.

source: New Features Related to Type Hints
pt_pt: Novas Funcionalidades Relacionadas com Dicas de Tipo

source: This section covers major changes affecting :pep:`484` type hints and the :mod:`typing` module.
pt_pt: Esta secção abrange as principais alterações que afetam as dicas de tipo :pep:`484` e o módulo :mod:`typing`.

source: PEP 646: Variadic generics
pt_pt: PEP 646: Genéricos variádicos

source: :pep:`484` previously introduced :data:`~typing.TypeVar`, enabling creation of generics parameterised with a single type. :pep:`646` adds :data:`~typing.TypeVarTuple`, enabling parameterisation with an *arbitrary* number of types. In other words, a :data:`~typing.TypeVarTuple` is a *variadic* type variable, enabling *variadic* generics.
pt_pt: A :pep:`484` introduziu anteriormente :data:`~typing.TypeVar`, permitindo a criação de genéricos parametrizados com um único tipo. A :pep:`646` adiciona :data:`~typing.TypeVarTuple`, permitindo a parametrização com um número *arbitrário* de tipos. Em outras palavras, uma :data:`~typing.TypeVarTuple` é uma variável de tipo *variádica*, permitindo genéricos *variádicos*.

source: This enables a wide variety of use cases. In particular, it allows the type of array-like structures in numerical computing libraries such as NumPy and TensorFlow to be parameterised with the array *shape*. Static type checkers will now be able to catch shape-related bugs in code that uses these libraries.
pt_pt: Isso permite uma ampla variedade de casos de uso. Em particular, ele permite que o tipo de estruturas do tipo array em bibliotecas de computação numérica, como NumPy e TensorFlow, sejam parametrizadas com o array *shape*. Os verificadores de tipo estáticos agora poderão capturar bugs relacionados a formas no código que usa essas bibliotecas.

source: See :pep:`646` for more details.
pt_pt: Veja :pep:`646` para mais detalhes.

source: (Contributed by Matthew Rahtz in :issue:`43224`, with contributions by Serhiy Storchaka and Jelle Zijlstra. PEP written by Mark Mendoza, Matthew Rahtz, Pradeep Kumar Srinivasan, and Vincent Siles.)
pt_pt: (Contribuição de Matthew Rahtz em :issue:`43224`, com contribuições de Serhiy Storchaka e Jelle Zijlstra. PEP escrita por Mark Mendoza, Matthew Rahtz, Pradeep Kumar Srinivasan e Vincent Siles.)

source: PEP 655: Marking individual ``TypedDict`` items as required or not-required
pt_pt: PEP 655: Marcação de itens ``TypedDict`` individuais como obrigatórios ou não obrigatórios

source: :data:`~typing.Required` and :data:`~typing.NotRequired` provide a straightforward way to mark whether individual items in a :class:`~typing.TypedDict` must be present. Previously, this was only possible using inheritance.
pt_pt: :data:`~typing.Required` e :data:`~typing.NotRequired` fornecem uma forma direta de indicar se itens individuais num :class:`~typing.TypedDict` devem estar presentes. Anteriormente, isto só era possível usando herança.

source: All fields are still required by default, unless the *total* parameter is set to ``False``, in which case all fields are still not-required by default. For example, the following specifies a :class:`!TypedDict` with one required and one not-required key::
pt_pt: Todos os campos ainda são obrigatórios por padrão, a menos que o parâmetro *total* seja definido como ``False``, caso em que todos os campos ainda não são obrigatórios por padrão. Por exemplo, o seguinte especifica um :class:`!TypedDict` com uma chave obrigatória e uma chave não obrigatória::

source: The following definition is equivalent::
pt_pt: A seguinte definição é equivalente::

source: See :pep:`655` for more details.
pt_pt: Veja :pep:`655` para mais detalhes.

source: (Contributed by David Foster and Jelle Zijlstra in :issue:`47087`. PEP written by David Foster.)
pt_pt: (Contribuição de David Foster e Jelle Zijlstra em :issue:`47087`. PEP escrita por David Foster.)

source: PEP 673: ``Self`` type
pt_pt: PEP 673: Tipo ``Self``

source: The new :data:`~typing.Self` annotation provides a simple and intuitive way to annotate methods that return an instance of their class. This behaves the same as the :class:`~typing.TypeVar`-based approach :pep:`specified in PEP 484 <484#annotating-instance-and-class-methods>`, but is more concise and easier to follow.
pt_pt: A nova anotação :data:`~typing.Self` fornece uma forma simples e intuitiva de anotar métodos que retornam uma instância da sua classe. Isto comporta-se da mesma forma que a abordagem baseada em :class:`~typing.TypeVar` :pep:`especificada na PEP 484 <484#annotating-instance-and-class-methods>`, mas é mais concisa e fácil de seguir.

source: Common use cases include alternative constructors provided as :func:`classmethod <classmethod>`\s, and :meth:`~object.__enter__` methods that return ``self``::
pt_pt: Casos de uso comuns incluem construtores alternativos fornecidos como :func:`classmethod <classmethod>`\s e métodos :meth:`~object.__enter__` que retornam ``self``::

source: :data:`~typing.Self` can also be used to annotate method parameters or attributes of the same type as their enclosing class.
pt_pt: :data:`~typing.Self` também pode ser usado para anotar parâmetros de métodos ou atributos do mesmo tipo que a sua classe de inclusão.

source: See :pep:`673` for more details.
pt_pt: Veja :pep:`673` para mais detalhes.

source: (Contributed by James Hilton-Balfe in :issue:`46534`. PEP written by Pradeep Kumar Srinivasan and James Hilton-Balfe.)
pt_pt: (Contribuição de James Hilton-Balfe em :issue:`46534`. PEP escrita por Pradeep Kumar Srinivasan e James Hilton-Balfe.)

source: PEP 675: Arbitrary literal string type
pt_pt: PEP 675: Tipo de cadeia de caracteres literal arbitrária

source: The new :data:`~typing.LiteralString` annotation may be used to indicate that a function parameter can be of any literal string type. This allows a function to accept arbitrary literal string types, as well as strings created from other literal strings. Type checkers can then enforce that sensitive functions, such as those that execute SQL statements or shell commands, are called only with static arguments, providing protection against injection attacks.
pt_pt: A nova anotação :data:`~typing.LiteralString` pode ser usada para indicar que um parâmetro de função pode ser de qualquer tipo de cadeia de caracteres literal. Isto permite que uma função aceite tipos de cadeias de caracteres literais arbitrários, bem como cadeias de caracteres criadas a partir de outras cadeias de caracteres literais. Os verificadores de tipo podem então garantir que funções sensíveis, como aquelas que executam instruções SQL ou comandos de shell, são chamadas apenas com argumentos estáticos, fornecendo proteção contra ataques de injeção.

source: For example, a SQL query function could be annotated as follows::
pt_pt: Por exemplo, uma função de consulta SQL pode ser anotada da seguinte forma::

source: See :pep:`675` for more details.
pt_pt: Veja :pep:`675` para mais detalhes.

source: (Contributed by Jelle Zijlstra in :issue:`47088`. PEP written by Pradeep Kumar Srinivasan and Graham Bleaney.)
pt_pt: (Contribuição de Jelle Zijlstra em :issue:`47088`. PEP escrita por Pradeep Kumar Srinivasan e Graham Bleaney.)

source: PEP 681: Data class transforms
pt_pt: PEP 681: Transformações de classes de dados

source: :data:`~typing.dataclass_transform` may be used to decorate a class, metaclass, or a function that is itself a decorator. The presence of ``@dataclass_transform()`` tells a static type checker that the decorated object performs runtime "magic" that transforms a class, giving it :func:`dataclass <dataclasses.dataclass>`-like behaviors.
pt_pt: :data:`~typing.dataclass_transform` pode ser usado para decorar uma classe, metaclasse, ou uma função que é ela própria um decorador. A presença de ``@dataclass_transform()`` indica a um verificador de tipo estático que o objeto decorado realiza "magia" em tempo de execução que transforma uma classe, conferindo-lhe comportamentos semelhantes a :func:`dataclass <dataclasses.dataclass>`.

source: For example::
pt_pt: Por exemplo::

source: # The create_model decorator is defined by a library. @typing.dataclass_transform() def create_model(cls: Type[T]) -> Type[T]: cls.__init__ = ... cls.__eq__ = ... cls.__ne__ = ... return cls # The create_model decorator can now be used to create new model classes: @create_model class CustomerModel: id: int name: str c = CustomerModel(id=327, name="Eric Idle")
pt_pt: # O decorador create_model é definido por uma biblioteca. @typing.dataclass_transform() def create_model(cls: Type[T]) -> Type[T]: cls.__init__ = ... cls.__eq__ = ... cls.__ne__ = ... return cls # O decorador create_model agora pode ser usado para criar novas classes de modelo: @create_model class CustomerModel: id: int name: str c = CustomerModel(id=327, name="Eric Idle")

source: See :pep:`681` for more details.
pt_pt: Veja :pep:`681` para mais detalhes.

source: (Contributed by Jelle Zijlstra in :gh:`91860`. PEP written by Erik De Bonte and Eric Traut.)
pt_pt: (Contribuição de Jelle Zijlstra em :gh:`91860`. PEP escrita por Erik De Bonte e Eric Traut.)

source: PEP 563 may not be the future
pt_pt: A PEP 563 pode não ser o futuro

source: :pep:`563` Postponed Evaluation of Annotations (the ``from __future__ import annotations`` :ref:`future statement <future>`) that was originally planned for release in Python 3.10 has been put on hold indefinitely. See `this message from the Steering Council <https://mail.python.org/archives/list/python-dev@python.org/message/VIZEBX5EYMSYIJNDBF6DMUMZOCWHARSO/>`__ for more information.
pt_pt: A avaliação adiada de anotações da :pep:`563` (a instrução ``from __future__ import annotations`` :ref:`future <future>`) que estava originalmente planeada para ser lançada no Python 3.10 foi suspensa indefinidamente. Consulte `esta mensagem do Steering Council <https://mail.python.org/archives/list/python-dev@python.org/message/VIZEBX5EYMSYIJNDBF6DMUMZOCWHARSO/>`__ para mais informações.

source: Other Language Changes
pt_pt: Outras alterações à linguagem

source: Starred unpacking expressions can now be used in :keyword:`for` statements. (See :issue:`46725` for more details.)
pt_pt: Expressões de desempacotamento com asterisco podem agora ser usadas em instruções :keyword:`for`. (Consulte :issue:`46725` para mais detalhes.)

source: Asynchronous :ref:`comprehensions <comprehensions>` are now allowed inside comprehensions in :ref:`asynchronous functions <async def>`. Outer comprehensions implicitly become asynchronous in this case. (Contributed by Serhiy Storchaka in :issue:`33346`.)
pt_pt: As :ref:`compreensões assíncronas <comprehensions>` são agora permitidas dentro de compreensões em :ref:`funções assíncronas <async def>`. As compreensões externas tornam-se implicitamente assíncronas neste caso. (Contribuído por Serhiy Storchaka em :issue:`33346`.)

source: A :exc:`TypeError` is now raised instead of an :exc:`AttributeError` in :keyword:`with` statements and :meth:`contextlib.ExitStack.enter_context` for objects that do not support the :term:`context manager` protocol, and in :keyword:`async with` statements and :meth:`contextlib.AsyncExitStack.enter_async_context` for objects not supporting the :term:`asynchronous context manager` protocol. (Contributed by Serhiy Storchaka in :issue:`12022` and :issue:`44471`.)
pt_pt: Agora é lançado um :exc:`TypeError` em vez de um :exc:`AttributeError` em instruções :keyword:`with` e :meth:`contextlib.ExitStack.enter_context` para objetos que não suportam o protocolo :term:`context manager`, e em instruções :keyword:`async with` e :meth:`contextlib.AsyncExitStack.enter_async_context` para objetos que não suportam o protocolo :term:`asynchronous context manager`. (Contribuído por Serhiy Storchaka em :issue:`12022` e :issue:`44471`.)
