Repository: NyaPuma/python-docs-pt-pt
Catalog: whatsnew/3.11.po
Languages: pt_pt

source: Freelists for object structs can now be disabled. A new :program:`configure` option ``--without-freelists`` can be used to disable all freelists except empty tuple singleton. (Contributed by Christian Heimes in :issue:`45522`.)
pt_pt: As freelists para estruturas de objetos podem agora ser desativadas. Uma nova opção :program:`configure` ``--without-freelists`` pode ser usada para desativar todas as freelists, exceto o singleton de tuplo vazio. (Contribuído por Christian Heimes em :issue:`45522`.)

source: ``Modules/Setup`` and ``Modules/makesetup`` have been improved and tied up. Extension modules can now be built through ``makesetup``. All except some test modules can be linked statically into a main binary or library. (Contributed by Brett Cannon and Christian Heimes in :issue:`45548`, :issue:`45570`, :issue:`45571`, and :issue:`43974`.)
pt_pt: ``Modules/Setup`` e ``Modules/makesetup`` foram melhorados e integrados. Os módulos de extensão podem agora ser compilados através de ``makesetup``. Todos, exceto alguns módulos de teste, podem ser ligados estaticamente a um binário ou biblioteca principal. (Contribuído por Brett Cannon e Christian Heimes em :issue:`45548`, :issue:`45570`, :issue:`45571` e :issue:`43974`.)

source: Use the environment variables :envvar:`!TCLTK_CFLAGS` and :envvar:`!TCLTK_LIBS` to manually specify the location of Tcl/Tk headers and libraries. The :program:`configure` options :option:`!--with-tcltk-includes` and :option:`!--with-tcltk-libs` have been removed.
pt_pt: Use as variáveis de ambiente :envvar:`!TCLTK_CFLAGS` e :envvar:`!TCLTK_LIBS` para especificar manualmente a localização dos cabeçalhos e bibliotecas do Tcl/Tk. As opções :program:`configure` :option:`!--with-tcltk-includes` e :option:`!--with-tcltk-libs` foram removidas.

source: On RHEL 7 and CentOS 7 the development packages do not provide ``tcl.pc`` and ``tk.pc``; use ``TCLTK_LIBS="-ltk8.5 -ltkstub8.5 -ltcl8.5"``. The directory ``Misc/rhel7`` contains ``.pc`` files and instructions on how to build Python with RHEL 7's and CentOS 7's Tcl/Tk and OpenSSL.
pt_pt: No RHEL 7 e CentOS 7, os pacotes de desenvolvimento não fornecem ``tcl.pc`` e ``tk.pc``; use ``TCLTK_LIBS="-ltk8.5 -ltkstub8.5 -ltcl8.5"``. O diretório ``Misc/rhel7`` contém ficheiros ``.pc`` e instruções sobre como compilar o Python com o Tcl/Tk e OpenSSL do RHEL 7 e CentOS 7.

source: CPython will now use 30-bit digits by default for the Python :class:`int` implementation. Previously, the default was to use 30-bit digits on platforms with ``SIZEOF_VOID_P >= 8``, and 15-bit digits otherwise. It's still possible to explicitly request use of 15-bit digits via either the :option:`--enable-big-digits` option to the configure script or (for Windows) the ``PYLONG_BITS_IN_DIGIT`` variable in ``PC/pyconfig.h``, but this option may be removed at some point in the future. (Contributed by Mark Dickinson in :issue:`45569`.)
pt_pt: O CPython agora usará dígitos de 30 bits por predefinição para a implementação do :class:`int` do Python. Anteriormente, o predefinido era usar dígitos de 30 bits em plataformas com ``SIZEOF_VOID_P >= 8``, e dígitos de 15 bits caso contrário. Ainda é possível solicitar explicitamente o uso de dígitos de 15 bits através da opção :option:`--enable-big-digits` para o script de configuração ou (para Windows) a variável ``PYLONG_BITS_IN_DIGIT`` em ``PC/pyconfig.h``, mas esta opção pode ser removida em algum momento no futuro. (Contribuído por Mark Dickinson em :issue:`45569`.)

source: C API Changes
pt_pt: Alterações na API C

source: Add a new :c:func:`PyType_GetName` function to get type's short name. (Contributed by Hai Shi in :issue:`42035`.)
pt_pt: Adicionada uma nova função :c:func:`PyType_GetName` para obter o nome curto do tipo. (Contribuído por Hai Shi em :issue:`42035`.)

source: Add a new :c:func:`PyType_GetQualName` function to get type's qualified name. (Contributed by Hai Shi in :issue:`42035`.)
pt_pt: Adicionada uma nova função :c:func:`PyType_GetQualName` para obter o nome qualificado do tipo. (Contribuído por Hai Shi em :issue:`42035`.)

source: Add new :c:func:`PyThreadState_EnterTracing` and :c:func:`PyThreadState_LeaveTracing` functions to the limited C API to suspend and resume tracing and profiling. (Contributed by Victor Stinner in :issue:`43760`.)
pt_pt: Adicionadas novas funções :c:func:`PyThreadState_EnterTracing` e :c:func:`PyThreadState_LeaveTracing` à API C limitada para suspender e retomar o rastreio e a perfilagem. (Contribuído por Victor Stinner em :issue:`43760`.)

source: Added the :c:data:`Py_Version` constant which bears the same value as :c:macro:`PY_VERSION_HEX`. (Contributed by Gabriele N. Tornetta in :issue:`43931`.)
pt_pt: Adicionada a constante :c:data:`Py_Version`, que tem o mesmo valor que :c:macro:`PY_VERSION_HEX`. (Contribuído por Gabriele N. Tornetta em :issue:`43931`.)

source: :c:type:`Py_buffer` and APIs are now part of the limited API and the stable ABI:
pt_pt: :c:type:`Py_buffer` e as APIs são agora parte da API limitada e da ABI estável:

source: :c:member:`~PyBufferProcs.bf_getbuffer` and :c:member:`~PyBufferProcs.bf_releasebuffer` type slots
pt_pt: :c:member:`~PyBufferProcs.bf_getbuffer` e :c:member:`~PyBufferProcs.bf_releasebuffer` slots de tipo

source: (Contributed by Christian Heimes in :issue:`45459`.)
pt_pt: (Contribuído por Christian Heimes em :issue:`45459`.)

source: Added the :c:func:`PyType_GetModuleByDef` function, used to get the module in which a method was defined, in cases where this information is not available directly (via :c:type:`PyCMethod`). (Contributed by Petr Viktorin in :issue:`46613`.)
pt_pt: Adicionada a função :c:func:`PyType_GetModuleByDef`, usada para obter o módulo no qual um método foi definido, em casos em que esta informação não está disponível diretamente (através de :c:type:`PyCMethod`). (Contribuído por Petr Viktorin em :issue:`46613`.)

source: Add new functions to pack and unpack C double (serialize and deserialize): :c:func:`PyFloat_Pack2`, :c:func:`PyFloat_Pack4`, :c:func:`PyFloat_Pack8`, :c:func:`PyFloat_Unpack2`, :c:func:`PyFloat_Unpack4` and :c:func:`PyFloat_Unpack8`. (Contributed by Victor Stinner in :issue:`46906`.)
pt_pt: Adicionadas novas funções para empacotar e desempacotar duplos C (serializar e desserializar): :c:func:`PyFloat_Pack2`, :c:func:`PyFloat_Pack4`, :c:func:`PyFloat_Pack8`, :c:func:`PyFloat_Unpack2`, :c:func:`PyFloat_Unpack4` e :c:func:`PyFloat_Unpack8`. (Contribuído por Victor Stinner em :issue:`46906`.)

source: Add new functions to get frame object attributes: :c:func:`PyFrame_GetBuiltins`, :c:func:`PyFrame_GetGenerator`, :c:func:`PyFrame_GetGlobals`, :c:func:`PyFrame_GetLasti`.
pt_pt: Adicionadas novas funções para obter atributos de objetos de frame: :c:func:`PyFrame_GetBuiltins`, :c:func:`PyFrame_GetGenerator`, :c:func:`PyFrame_GetGlobals`, :c:func:`PyFrame_GetLasti`.

source: Added two new functions to get and set the active exception instance: :c:func:`PyErr_GetHandledException` and :c:func:`PyErr_SetHandledException`. These are alternatives to :c:func:`PyErr_SetExcInfo()` and :c:func:`PyErr_GetExcInfo()` which work with the legacy 3-tuple representation of exceptions. (Contributed by Irit Katriel in :issue:`46343`.)
pt_pt: Adicionadas duas novas funções para obter e definir a instância de exceção ativa: :c:func:`PyErr_GetHandledException` e :c:func:`PyErr_SetHandledException`. Estas são alternativas a :c:func:`PyErr_SetExcInfo()` e :c:func:`PyErr_GetExcInfo()`, que funcionam com a representação legada de 3-tuplo de exceções. (Contribuído por Irit Katriel em :issue:`46343`.)

source: Added the :c:member:`PyConfig.safe_path` member. (Contributed by Victor Stinner in :gh:`57684`.)
pt_pt: Adicionado o membro :c:member:`PyConfig.safe_path`. (Contribuído por Victor Stinner em :gh:`57684`.)

source: Some macros have been converted to static inline functions to avoid `macro pitfalls <https://gcc.gnu.org/onlinedocs/cpp/Macro-Pitfalls.html>`_. The change should be mostly transparent to users, as the replacement functions will cast their arguments to the expected types to avoid compiler warnings due to static type checks. However, when the limited C API is set to >=3.11, these casts are not done, and callers will need to cast arguments to their expected types. See :pep:`670` for more details. (Contributed by Victor Stinner and Erlend E. Aasland in :gh:`89653`.)
pt_pt: Algumas macros foram convertidas em funções inline estáticas para evitar `armadilhas de macros <https://gcc.gnu.org/onlinedocs/cpp/Macro-Pitfalls.html>`_. A alteração deve ser maioritariamente transparente para os utilizadores, uma vez que as funções de substituição farão cast dos seus argumentos para os tipos esperados, evitando avisos do compilador devido a verificações de tipo estáticas. No entanto, quando a API C limitada é definida como >=3.11, estes casts não são feitos, e os chamadores terão de fazer cast dos argumentos para os seus tipos esperados. Consulte :pep:`670` para mais detalhes. (Contribuído por Victor Stinner e Erlend E. Aasland em :gh:`89653`.)

source: :c:func:`PyErr_SetExcInfo()` no longer uses the ``type`` and ``traceback`` arguments, the interpreter now derives those values from the exception instance (the ``value`` argument). The function still steals references of all three arguments. (Contributed by Irit Katriel in :issue:`45711`.)
pt_pt: :c:func:`PyErr_SetExcInfo()` já não usa os argumentos ``type`` e ``traceback``; o interpretador agora deriva esses valores da instância da exceção (o argumento ``value``). A função ainda rouba referências de todos os três argumentos. (Contribuído por Irit Katriel em :issue:`45711`.)

source: :c:func:`PyErr_GetExcInfo()` now derives the ``type`` and ``traceback`` fields of the result from the exception instance (the ``value`` field). (Contributed by Irit Katriel in :issue:`45711`.)
pt_pt: :c:func:`PyErr_GetExcInfo()` agora deriva os campos ``type`` e ``traceback`` do resultado a partir da instância da exceção (o campo ``value``). (Contribuído por Irit Katriel em :issue:`45711`.)

source: :c:struct:`_frozen` has a new ``is_package`` field to indicate whether or not the frozen module is a package. Previously, a negative value in the ``size`` field was the indicator. Now only non-negative values be used for ``size``. (Contributed by Kumar Aditya in :issue:`46608`.)
pt_pt: :c:struct:`_frozen` tem um novo campo ``is_package`` para indicar se o módulo congelado é ou não um pacote. Anteriormente, um valor negativo no campo ``size`` era o indicador. Agora, apenas valores não negativos podem ser usados para ``size``. (Contribuído por Kumar Aditya em :issue:`46608`.)

source: :c:func:`_PyFrameEvalFunction` now takes ``_PyInterpreterFrame*`` as its second parameter, instead of ``PyFrameObject*``. See :pep:`523` for more details of how to use this function pointer type.
pt_pt: :c:func:`_PyFrameEvalFunction` agora recebe ``_PyInterpreterFrame*`` como seu segundo parâmetro, em vez de ``PyFrameObject*``. Consulte :pep:`523` para mais detalhes sobre como usar este tipo de ponteiro de função.

source: :c:func:`!PyCode_New` and :c:func:`!PyCode_NewWithPosOnlyArgs` now take an additional ``exception_table`` argument. Using these functions should be avoided, if at all possible. To get a custom code object: create a code object using the compiler, then get a modified version with the ``replace`` method.
pt_pt: :c:func:`!PyCode_New` e :c:func:`!PyCode_NewWithPosOnlyArgs` agora recebem um argumento adicional ``exception_table``. O uso destas funções deve ser evitado, se possível. Para obter um objeto de código personalizado: crie um objeto de código usando o compilador e, em seguida, obtenha uma versão modificada com o método ``replace``.

source: :c:type:`PyCodeObject` no longer has the ``co_code``, ``co_varnames``, ``co_cellvars`` and ``co_freevars`` fields. Instead, use :c:func:`PyCode_GetCode`, :c:func:`PyCode_GetVarnames`, :c:func:`PyCode_GetCellvars` and :c:func:`PyCode_GetFreevars` respectively to access them via the C API. (Contributed by Brandt Bucher in :issue:`46841` and Ken Jin in :gh:`92154` and :gh:`94936`.)
pt_pt: :c:type:`PyCodeObject` já não tem os campos ``co_code``, ``co_varnames``, ``co_cellvars`` e ``co_freevars``. Em vez disso, use :c:func:`PyCode_GetCode`, :c:func:`PyCode_GetVarnames`, :c:func:`PyCode_GetCellvars` e :c:func:`PyCode_GetFreevars`, respetivamente, para aceder a eles através da API C. (Contribuído por Brandt Bucher em :issue:`46841` e Ken Jin em :gh:`92154` e :gh:`94936`.)

source: The old trashcan macros (``Py_TRASHCAN_SAFE_BEGIN``/``Py_TRASHCAN_SAFE_END``) are now deprecated. They should be replaced by the new macros ``Py_TRASHCAN_BEGIN`` and ``Py_TRASHCAN_END``.
pt_pt: As macros antigas de lixeira (``Py_TRASHCAN_SAFE_BEGIN``/``Py_TRASHCAN_SAFE_END``) estão agora obsoletas. Devem ser substituídas pelas novas macros ``Py_TRASHCAN_BEGIN`` e ``Py_TRASHCAN_END``.

source: A tp_dealloc function that has the old macros, such as::
pt_pt: Uma função tp_dealloc que tem as macros antigas, como::

source: should migrate to the new macros as follows::
pt_pt: deve migrar para as novas macros da seguinte forma::

source: Note that ``Py_TRASHCAN_BEGIN`` has a second argument which should be the deallocation function it is in.
pt_pt: Note que ``Py_TRASHCAN_BEGIN`` tem um segundo argumento que deve ser a função de desalocação em que está.

source: To support older Python versions in the same codebase, you can define the following macros and use them throughout the code (credit: these were copied from the ``mypy`` codebase)::
pt_pt: Para suportar versões mais antigas do Python na mesma base de código, pode definir as seguintes macros e usá-las em todo o código (crédito: estas foram copiadas da base de código ``mypy``)::

source: The :c:func:`PyType_Ready` function now raises an error if a type is defined with the :c:macro:`Py_TPFLAGS_HAVE_GC` flag set but has no traverse function (:c:member:`PyTypeObject.tp_traverse`). (Contributed by Victor Stinner in :issue:`44263`.)
pt_pt: A função :c:func:`PyType_Ready` agora lança um erro se um tipo for definido com a flag :c:macro:`Py_TPFLAGS_HAVE_GC` definida, mas não tiver uma função de travessia (:c:member:`PyTypeObject.tp_traverse`). (Contribuído por Victor Stinner em :issue:`44263`.)

source: Heap types with the :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` flag can now inherit the :pep:`590` vectorcall protocol. Previously, this was only possible for :ref:`static types <static-types>`. (Contributed by Erlend E. Aasland in :issue:`43908`)
pt_pt: Tipos de heap com a flag :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` podem agora herdar o protocolo vectorcall da :pep:`590`. Anteriormente, isto só era possível para :ref:`tipos estáticos <static-types>`. (Contribuído por Erlend E. Aasland em :issue:`43908`)

source: Since :c:func:`Py_TYPE()` is changed to a inline static function, ``Py_TYPE(obj) = new_type`` must be replaced with ``Py_SET_TYPE(obj, new_type)``: see the :c:func:`Py_SET_TYPE()` function (available since Python 3.9). For backward compatibility, this macro can be used::
pt_pt: Uma vez que :c:func:`Py_TYPE()` foi alterada para uma função estática inline, ``Py_TYPE(obj) = new_type`` deve ser substituído por ``Py_SET_TYPE(obj, new_type)``: consulte a função :c:func:`Py_SET_TYPE()` (disponível desde o Python 3.9). Para compatibilidade retroativa, esta macro pode ser usada::

source: (Contributed by Victor Stinner in :issue:`39573`.)
pt_pt: (Contribuído por Victor Stinner em :issue:`39573`.)

source: Since :c:func:`Py_SIZE()` is changed to a inline static function, ``Py_SIZE(obj) = new_size`` must be replaced with ``Py_SET_SIZE(obj, new_size)``: see the :c:func:`Py_SET_SIZE()` function (available since Python 3.9). For backward compatibility, this macro can be used::
pt_pt: Uma vez que :c:func:`Py_SIZE()` foi alterada para uma função estática inline, ``Py_SIZE(obj) = new_size`` deve ser substituído por ``Py_SET_SIZE(obj, new_size)``: consulte a função :c:func:`Py_SET_SIZE()` (disponível desde o Python 3.9). Para compatibilidade retroativa, esta macro pode ser usada::

source: ``<Python.h>`` no longer includes the header files ``<stdlib.h>``, ``<stdio.h>``, ``<errno.h>`` and ``<string.h>`` when the ``Py_LIMITED_API`` macro is set to ``0x030b0000`` (Python 3.11) or higher. C extensions should explicitly include the header files after ``#include <Python.h>``. (Contributed by Victor Stinner in :issue:`45434`.)
pt_pt: ``<Python.h>`` já não inclui os ficheiros de cabeçalho ``<stdlib.h>``, ``<stdio.h>``, ``<errno.h>`` e ``<string.h>`` quando a macro ``Py_LIMITED_API`` está definida para ``0x030b0000`` (Python 3.11) ou superior. As extensões C devem incluir explicitamente os ficheiros de cabeçalho após ``#include <Python.h>``. (Contribuído por Victor Stinner em :issue:`45434`.)

source: The non-limited API files ``cellobject.h``, ``classobject.h``, ``code.h``, ``context.h``, ``funcobject.h``, ``genobject.h`` and ``longintrepr.h`` have been moved to the ``Include/cpython`` directory. Moreover, the ``eval.h`` header file was removed. These files must not be included directly, as they are already included in ``Python.h``: :ref:`Include Files <api-includes>`. If they have been included directly, consider including ``Python.h`` instead. (Contributed by Victor Stinner in :issue:`35134`.)
pt_pt: Os ficheiros de API não limitada ``cellobject.h``, ``classobject.h``, ``code.h``, ``context.h``, ``funcobject.h``, ``genobject.h`` e ``longintrepr.h`` foram movidos para o diretório ``Include/cpython``. Além disso, o ficheiro de cabeçalho ``eval.h`` foi removido. Estes ficheiros não devem ser incluídos diretamente, uma vez que já estão incluídos em ``Python.h``: :ref:`Ficheiros de Inclusão <api-includes>`. Se tiverem sido incluídos diretamente, considere incluir ``Python.h`` em vez disso. (Contribuído por Victor Stinner em :issue:`35134`.)

source: The :c:func:`!PyUnicode_CHECK_INTERNED` macro has been excluded from the limited C API. It was never usable there, because it used internal structures which are not available in the limited C API. (Contributed by Victor Stinner in :issue:`46007`.)
pt_pt: A macro :c:func:`!PyUnicode_CHECK_INTERNED` foi excluída da API C limitada. Nunca foi utilizável lá, porque usava estruturas internas que não estão disponíveis na API C limitada. (Contribuído por Victor Stinner em :issue:`46007`.)

source: The following frame functions and type are now directly available with ``#include <Python.h>``, it's no longer needed to add ``#include <frameobject.h>``:
pt_pt: As seguintes funções e tipo de frame estão agora diretamente disponíveis com ``#include <Python.h>``; já não é necessário adicionar ``#include <frameobject.h>``:

source: (Contributed by Victor Stinner in :gh:`93937`.)
pt_pt: (Contribuído por Victor Stinner em :gh:`93937`.)

source: The :c:type:`PyFrameObject` structure members have been removed from the public C API.
pt_pt: Os membros da estrutura :c:type:`PyFrameObject` foram removidos da API C pública.

source: While the documentation notes that the :c:type:`PyFrameObject` fields are subject to change at any time, they have been stable for a long time and were used in several popular extensions.
pt_pt: Embora a documentação indique que os campos :c:type:`PyFrameObject` estão sujeitos a alterações a qualquer momento, eles têm sido estáveis durante muito tempo e foram usados em várias extensões populares.

source: In Python 3.11, the frame struct was reorganized to allow performance optimizations. Some fields were removed entirely, as they were details of the old implementation.
pt_pt: No Python 3.11, a estrutura de frame foi reorganizada para permitir otimizações de desempenho. Alguns campos foram removidos por completo, uma vez que eram detalhes da implementação antiga.

source: :c:type:`PyFrameObject` fields:
pt_pt: Campos :c:type:`PyFrameObject`:

source: ``f_blockstack``: removed.
pt_pt: ``f_blockstack``: removido.

source: ``f_iblock``: removed.
pt_pt: ``f_iblock``: removido.

source: ``f_lasti``: use :c:func:`PyFrame_GetLasti`. Code using ``f_lasti`` with ``PyCode_Addr2Line()`` should use :c:func:`PyFrame_GetLineNumber` instead; it may be faster.
pt_pt: ``f_lasti``: use :c:func:`PyFrame_GetLasti`. Código que usa ``f_lasti`` com ``PyCode_Addr2Line()`` deve usar :c:func:`PyFrame_GetLineNumber` em vez disso; pode ser mais rápido.

source: ``f_stackdepth``: removed.
pt_pt: ``f_stackdepth``: removido.

source: ``f_state``: no public API (renamed to ``f_frame.f_state``).
pt_pt: ``f_state``: sem API pública (renomeado para ``f_frame.f_state``).

source: ``f_trace``: no public API.
pt_pt: ``f_trace``: sem API pública.

source: ``f_localsplus``: no public API (renamed to ``f_frame.localsplus``).
pt_pt: ``f_localsplus``: sem API pública (renomeado para ``f_frame.localsplus``).

source: ``f_valuestack``: removed.
pt_pt: ``f_valuestack``: removido.

source: The Python frame object is now created lazily. A side effect is that the :attr:`~frame.f_back` member must not be accessed directly, since its value is now also computed lazily. The :c:func:`PyFrame_GetBack` function must be called instead.
pt_pt: O objeto de frame do Python é agora criado de forma preguiçosa. Um efeito colateral é que o membro :attr:`~frame.f_back` não deve ser acedido diretamente, uma vez que o seu valor é agora também calculado de forma preguiçosa. A função :c:func:`PyFrame_GetBack` deve ser chamada em vez disso.

source: Debuggers that accessed the :attr:`~frame.f_locals` directly *must* call :c:func:`PyFrame_GetLocals` instead. They no longer need to call :c:func:`!PyFrame_FastToLocalsWithError` or :c:func:`!PyFrame_LocalsToFast`, in fact they should not call those functions. The necessary updating of the frame is now managed by the virtual machine.
pt_pt: Depuradores que acediam diretamente a :attr:`~frame.f_locals` *devem* chamar :c:func:`PyFrame_GetLocals` em vez disso. Já não precisam de chamar :c:func:`!PyFrame_FastToLocalsWithError` ou :c:func:`!PyFrame_LocalsToFast`; na verdade, não devem chamar essas funções. A atualização necessária do frame é agora gerida pela máquina virtual.

source: Code defining ``PyFrame_GetCode()`` on Python 3.8 and older::
pt_pt: Código que define ``PyFrame_GetCode()`` no Python 3.8 e anteriores::

source: Code defining ``PyFrame_GetBack()`` on Python 3.8 and older::
pt_pt: Código que define ``PyFrame_GetBack()`` no Python 3.8 e anteriores::

source: Or use the `pythoncapi_compat project <https://github.com/python/pythoncapi-compat>`__ to get these two functions on older Python versions.
pt_pt: Ou use o `projeto pythoncapi_compat <https://github.com/python/pythoncapi-compat>`__ para obter estas duas funções em versões mais antigas do Python.

source: Changes of the :c:type:`PyThreadState` structure members:
pt_pt: Alterações nos membros da estrutura :c:type:`PyThreadState`:

source: ``frame``: removed, use :c:func:`PyThreadState_GetFrame` (function added to Python 3.9 by :issue:`40429`). Warning: the function returns a :term:`strong reference`, need to call :c:func:`Py_XDECREF`.
pt_pt: ``frame``: removido, use :c:func:`PyThreadState_GetFrame` (função adicionada ao Python 3.9 por :issue:`40429`). Aviso: a função retorna uma :term:`referência forte`, é necessário chamar :c:func:`Py_XDECREF`.

source: ``tracing``: changed, use :c:func:`PyThreadState_EnterTracing` and :c:func:`PyThreadState_LeaveTracing` (functions added to Python 3.11 by :issue:`43760`).
pt_pt: ``tracing``: alterado, use :c:func:`PyThreadState_EnterTracing` e :c:func:`PyThreadState_LeaveTracing` (funções adicionadas ao Python 3.11 por :issue:`43760`).

source: ``recursion_depth``: removed, use ``(tstate->recursion_limit - tstate->recursion_remaining)`` instead.
pt_pt: ``recursion_depth``: removido, use ``(tstate->recursion_limit - tstate->recursion_remaining)`` em vez disso.
