Repository: NyaPuma/python-docs-pt-pt
Catalog: whatsnew/3.11.po
Languages: pt_pt

source: Binary add, multiply and subtract for common types such as :class:`int`, :class:`float` and :class:`str` take custom fast paths for their underlying types.
pt_pt: Adição, multiplicação e subtração binárias para tipos comuns como :class:`int`, :class:`float` e :class:`str` usam caminhos rápidos personalizados para os seus tipos subjacentes.

source: Subscript
pt_pt: Subscrito

source: Subscripting container types such as :class:`list`, :class:`tuple` and :class:`dict` directly index the underlying data structures.
pt_pt: O subscrito de tipos de contentores como :class:`list`, :class:`tuple` e :class:`dict` acede diretamente aos índices das estruturas de dados subjacentes.

source: Subscripting custom :meth:`~object.__getitem__` is also inlined similar to :ref:`inline-calls`.
pt_pt: O subscrito de :meth:`~object.__getitem__` personalizado também é em linha, semelhante a :ref:`inline-calls`.

source: Store subscript
pt_pt: Armazenar subscrito

source: Similar to subscripting specialization above.
pt_pt: Semelhante à especialização de subscrito acima.

source: Calls
pt_pt: Chamadas

source: Calls to common builtin (C) functions and types such as :func:`len` and :class:`str` directly call their underlying C version. This avoids going through the internal calling convention.
pt_pt: Chamadas a funções e tipos integrados comuns (C), como :func:`len` e :class:`str`, chamam diretamente as suas versões C subjacentes. Isto evita passar pela convenção de chamada interna.

source: Load global variable
pt_pt: Carregar variável global

source: The object's index in the globals/builtins namespace is cached. Loading globals and builtins require zero namespace lookups.
pt_pt: O índice do objeto no espaço de nomes globals/builtins é guardado em cache. Carregar globals e builtins não requer pesquisas no espaço de nomes.

source: Load attribute
pt_pt: Carregar atributo

source: Similar to loading global variables. The attribute's index inside the class/object's namespace is cached. In most cases, attribute loading will require zero namespace lookups.
pt_pt: Semelhante ao carregamento de variáveis globais. O índice do atributo dentro do espaço de nomes da classe/objeto é guardado em cache. Na maioria dos casos, o carregamento de atributos não requererá pesquisas no espaço de nomes.

source: Load methods for call
pt_pt: Carregar métodos para chamada

source: The actual address of the method is cached. Method loading now has no namespace lookups -- even for classes with long inheritance chains.
pt_pt: O endereço real do método é guardado em cache. O carregamento de métodos agora não tem pesquisas no espaço de nomes — mesmo para classes com longas cadeias de herança.

source: Store attribute
pt_pt: Armazenar atributo

source: Similar to load attribute optimization.
pt_pt: Semelhante à otimização de carregamento de atributo.

source: 2% in pyperformance
pt_pt: 2% no pyperformance

source: Unpack Sequence
pt_pt: Desempacotar sequência

source: Specialized for common containers such as :class:`list` and :class:`tuple`. Avoids internal calling convention.
pt_pt: Especializado para contentores comuns como :class:`list` e :class:`tuple`. Evita a convenção de chamada interna.

source: A similar optimization already existed since Python 3.8. 3.11 specializes for more forms and reduces some overhead.
pt_pt: Uma otimização semelhante já existia desde o Python 3.8. O Python 3.11 especializa para mais formas e reduz alguma sobrecarga.

source: A similar optimization already existed since Python 3.10. 3.11 specializes for more forms. Furthermore, all attribute loads should be sped up by :issue:`45947`.
pt_pt: Uma otimização semelhante já existia desde o Python 3.10. O Python 3.11 especializa para mais formas. Além disso, todos os carregamentos de atributos devem ser acelerados por :issue:`45947`.

source: Misc
pt_pt: Diversos

source: Objects now require less memory due to lazily created object namespaces. Their namespace dictionaries now also share keys more freely. (Contributed Mark Shannon in :issue:`45340` and :issue:`40116`.)
pt_pt: Os objetos agora requerem menos memória devido à criação preguiçosa de espaços de nomes de objetos. Os seus dicionários de espaço de nomes agora também partilham chaves mais livremente. (Contribuído por Mark Shannon em :issue:`45340` e :issue:`40116`.)

source: "Zero-cost" exceptions are implemented, eliminating the cost of :keyword:`try` statements when no exception is raised. (Contributed by Mark Shannon in :issue:`40222`.)
pt_pt: Exceções de "custo zero" são implementadas, eliminando o custo das instruções :keyword:`try` quando nenhuma exceção é lançada. (Contribuído por Mark Shannon em :issue:`40222`.)

source: A more concise representation of exceptions in the interpreter reduced the time required for catching an exception by about 10%. (Contributed by Irit Katriel in :issue:`45711`.)
pt_pt: Uma representação mais concisa de exceções no interpretador reduziu o tempo necessário para capturar uma exceção em cerca de 10%. (Contribuído por Irit Katriel em :issue:`45711`.)

source: :mod:`re`'s regular expression matching engine has been partially refactored, and now uses computed gotos (or "threaded code") on supported platforms. As a result, Python 3.11 executes the `pyperformance regular expression benchmarks <https://pyperformance.readthedocs.io/benchmarks.html#regex-dna>`_ up to 10% faster than Python 3.10. (Contributed by Brandt Bucher in :gh:`91404`.)
pt_pt: O motor de correspondência de expressões regulares de :mod:`re` foi parcialmente refatorado e agora usa gotos computados (ou "código encadeado") em plataformas suportadas. Como resultado, o Python 3.11 executa os benchmarks de expressões regulares do `pyperformance <https://pyperformance.readthedocs.io/benchmarks.html#regex-dna>`_ até 10% mais rápido do que o Python 3.10. (Contribuído por Brandt Bucher em :gh:`91404`.)

source: FAQ
pt_pt: Perguntas frequentes

source: How should I write my code to utilize these speedups?
pt_pt: Como devo escrever o meu código para utilizar estas acelerações?

source: Write Pythonic code that follows common best practices; you don't have to change your code. The Faster CPython project optimizes for common code patterns we observe.
pt_pt: Escreva código Pythonico que siga as melhores práticas comuns; não precisa de alterar o seu código. O projeto Faster CPython otimiza para padrões de código comuns que observamos.

source: Will CPython 3.11 use more memory?
pt_pt: O CPython 3.11 usará mais memória?

source: Maybe not; we don't expect memory use to exceed 20% higher than 3.10. This is offset by memory optimizations for frame objects and object dictionaries as mentioned above.
pt_pt: Talvez não; não esperamos que o uso de memória exceda 20% em relação ao 3.10. Isto é compensado pelas otimizações de memória para objetos de frame e dicionários de objetos, como mencionado acima.

source: I don't see any speedups in my workload. Why?
pt_pt: Não vejo nenhuma aceleração na minha carga de trabalho. Porquê?

source: Certain code won't have noticeable benefits. If your code spends most of its time on I/O operations, or already does most of its computation in a C extension library like NumPy, there won't be significant speedups. This project currently benefits pure-Python workloads the most.
pt_pt: Certos códigos não terão benefícios notáveis. Se o seu código passar a maior parte do tempo em operações de I/O, ou já realizar a maior parte dos seus cálculos numa biblioteca de extensão C, como NumPy, não haverá acelerações significativas. Este projeto beneficia atualmente mais as cargas de trabalho em Python puro.

source: Furthermore, the pyperformance figures are a geometric mean. Even within the pyperformance benchmarks, certain benchmarks have slowed down slightly, while others have sped up by nearly 2x!
pt_pt: Além disso, os números do pyperformance são uma média geométrica. Mesmo dentro dos benchmarks do pyperformance, alguns benchmarks abrandaram ligeiramente, enquanto outros aceleraram quase 2x!

source: Is there a JIT compiler?
pt_pt: Existe um compilador JIT?

source: No. We're still exploring other optimizations.
pt_pt: Não. Ainda estamos a explorar outras otimizações.

source: About
pt_pt: Sobre

source: Faster CPython explores optimizations for :term:`CPython`. The main team is funded by Microsoft to work on this full-time. Pablo Galindo Salgado is also funded by Bloomberg LP to work on the project part-time. Finally, many contributors are volunteers from the community.
pt_pt: O Faster CPython explora otimizações para o :term:`CPython`. A equipa principal é financiada pela Microsoft para trabalhar neste projeto a tempo inteiro. Pablo Galindo Salgado também é financiado pela Bloomberg LP para trabalhar no projeto a tempo parcial. Finalmente, muitos contribuidores são voluntários da comunidade.

source: CPython bytecode changes
pt_pt: Alterações no bytecode do CPython

source: The bytecode now contains inline cache entries, which take the form of the newly-added :opcode:`CACHE` instructions. Many opcodes expect to be followed by an exact number of caches, and instruct the interpreter to skip over them at runtime. Populated caches can look like arbitrary instructions, so great care should be taken when reading or modifying raw, adaptive bytecode containing quickened data.
pt_pt: O bytecode agora contém entradas de cache em linha, que assumem a forma das instruções :opcode:`CACHE` recentemente adicionadas. Muitos opcodes esperam ser seguidos por um número exato de caches e instruem o interpretador a ignorá-los em tempo de execução. Caches preenchidos podem parecer instruções arbitrárias, por isso deve-se ter grande cuidado ao ler ou modificar bytecode bruto e adaptativo que contém dados acelerados.

source: New opcodes
pt_pt: Novos opcodes

source: :opcode:`!ASYNC_GEN_WRAP`, :opcode:`RETURN_GENERATOR` and :opcode:`SEND`, used in generators and co-routines.
pt_pt: :opcode:`!ASYNC_GEN_WRAP`, :opcode:`RETURN_GENERATOR` e :opcode:`SEND`, usados em geradores e co-rotinas.

source: :opcode:`COPY_FREE_VARS`, which avoids needing special caller-side code for closures.
pt_pt: :opcode:`COPY_FREE_VARS`, que evita a necessidade de código especial do lado do chamador para fechos.

source: :opcode:`JUMP_BACKWARD_NO_INTERRUPT`, for use in certain loops where handling interrupts is undesirable.
pt_pt: :opcode:`JUMP_BACKWARD_NO_INTERRUPT`, para uso em certos ciclos onde o tratamento de interrupções é indesejável.

source: :opcode:`MAKE_CELL`, to create :ref:`cell-objects`.
pt_pt: :opcode:`MAKE_CELL`, para criar :ref:`cell-objects`

source: :opcode:`CHECK_EG_MATCH` and :opcode:`!PREP_RERAISE_STAR`, to handle the :ref:`new exception groups and except* <whatsnew311-pep654>` added in :pep:`654`.
pt_pt: :opcode:`CHECK_EG_MATCH` e :opcode:`!PREP_RERAISE_STAR`, para tratar os :ref:`novos grupos de exceções e except* <whatsnew311-pep654>` adicionados na :pep:`654`.

source: :opcode:`PUSH_EXC_INFO`, for use in exception handlers.
pt_pt: :opcode:`PUSH_EXC_INFO`, para uso em tratadores de exceções.

source: :opcode:`RESUME`, a no-op, for internal tracing, debugging and optimization checks.
pt_pt: :opcode:`RESUME`, uma operação nula, para rastreio interno, depuração e verificações de otimização.

source: Replaced opcodes
pt_pt: Opcodes substituídos

source: Replaced Opcode(s)
pt_pt: Opcode(s) substituído(s)

source: New Opcode(s)
pt_pt: Novo(s) Opcode(s)

source: Notes
pt_pt: Notas

source: Replaced all numeric binary/in-place opcodes with a single opcode
pt_pt: Substituídos todos os opcodes binários/in-place numéricos por um único opcode

source: Decouples argument shifting for methods from handling of keyword arguments; allows better specialization of calls
pt_pt: Desacopla o deslocamento de argumentos para métodos do tratamento de argumentos nomeados; permite uma melhor especialização de chamadas

source: Stack manipulation instructions
pt_pt: Instruções de manipulação de pilha

source: Now performs check but doesn't jump
pt_pt: Agora realiza a verificação, mas não salta

source: See [#bytecode-jump]_; ``TRUE``, ``FALSE``, ``NONE`` and ``NOT_NONE`` variants for each direction
pt_pt: Consulte [#bytecode-jump]_; variantes ``TRUE``, ``FALSE``, ``NONE`` e ``NOT_NONE`` para cada direção

source: :keyword:`with` block setup
pt_pt: Configuração do bloco :keyword:`with`

source: All jump opcodes are now relative, including the existing :opcode:`!JUMP_IF_TRUE_OR_POP` and :opcode:`!JUMP_IF_FALSE_OR_POP`. The argument is now an offset from the current instruction rather than an absolute location.
pt_pt: Todos os opcodes de salto são agora relativos, incluindo os existentes :opcode:`!JUMP_IF_TRUE_OR_POP` e :opcode:`!JUMP_IF_FALSE_OR_POP`. O argumento é agora um deslocamento a partir da instrução atual, em vez de uma localização absoluta.

source: Changed/removed opcodes
pt_pt: Opcodes alterados/removidos

source: Changed :opcode:`MATCH_CLASS` and :opcode:`MATCH_KEYS` to no longer push an additional boolean value to indicate success/failure. Instead, ``None`` is pushed on failure in place of the tuple of extracted values.
pt_pt: Alterados :opcode:`MATCH_CLASS` e :opcode:`MATCH_KEYS` para que já não empurrem um valor booleano adicional para indicar sucesso/falha. Em vez disso, ``None`` é empurrado em caso de falha, no lugar do tuplo de valores extraídos.

source: Changed opcodes that work with exceptions to reflect them now being represented as one item on the stack instead of three (see :gh:`89874`).
pt_pt: Alterados os opcodes que trabalham com exceções para refletir que estas são agora representadas como um item na pilha, em vez de três (consulte :gh:`89874`).

source: Removed :opcode:`!COPY_DICT_WITHOUT_KEYS`, :opcode:`!GEN_START`, :opcode:`!POP_BLOCK`, :opcode:`!SETUP_FINALLY` and :opcode:`!YIELD_FROM`.
pt_pt: Removidos :opcode:`!COPY_DICT_WITHOUT_KEYS`, :opcode:`!GEN_START`, :opcode:`!POP_BLOCK`, :opcode:`!SETUP_FINALLY` e :opcode:`!YIELD_FROM`.

source: Deprecated
pt_pt: Obsoleto

source: This section lists Python APIs that have been deprecated in Python 3.11.
pt_pt: Esta secção lista as APIs do Python que foram obsoletas no Python 3.11.

source: Deprecated C APIs are :ref:`listed separately <whatsnew311-c-api-deprecated>`.
pt_pt: As APIs C obsoletas estão :ref:`listadas separadamente <whatsnew311-c-api-deprecated>`.

source: Language/Builtins
pt_pt: Linguagem/Integrados

source: Chaining :class:`classmethod` descriptors (introduced in :issue:`19072`) is now deprecated. It can no longer be used to wrap other descriptors such as :class:`property`. The core design of this feature was flawed and caused a number of downstream problems. To "pass-through" a :class:`classmethod`, consider using the :attr:`!__wrapped__` attribute that was added in Python 3.10. (Contributed by Raymond Hettinger in :gh:`89519`.)
pt_pt: O encadeamento de descritores :class:`classmethod` (introduzido em :issue:`19072`) está agora obsoleto. Já não pode ser usado para envolver outros descritores, como :class:`property`. O desenho principal desta funcionalidade era defeituoso e causou vários problemas a jusante. Para "passar" um :class:`classmethod`, considere usar o atributo :attr:`!__wrapped__` que foi adicionado no Python 3.10. (Contribuído por Raymond Hettinger em :gh:`89519`.)

source: Octal escapes in string and bytes literals with values larger than ``0o377`` (255 in decimal) now produce a :exc:`DeprecationWarning`. In a future Python version, they will raise a :exc:`SyntaxWarning` and eventually a :exc:`SyntaxError`. (Contributed by Serhiy Storchaka in :gh:`81548`.)
pt_pt: Escapes octais em literais de cadeias de caracteres e bytes com valores maiores que ``0o377`` (255 em decimal) agora produzem um :exc:`DeprecationWarning`. Numa futura versão do Python, lançarão um :exc:`SyntaxWarning` e, eventualmente, um :exc:`SyntaxError`. (Contribuído por Serhiy Storchaka em :gh:`81548`.)

source: The delegation of :func:`int` to :meth:`~object.__trunc__` is now deprecated. Calling ``int(a)`` when ``type(a)`` implements :meth:`!__trunc__` but not :meth:`~object.__int__` or :meth:`~object.__index__` now raises a :exc:`DeprecationWarning`. (Contributed by Zackery Spytz in :issue:`44977`.)
pt_pt: A delegação de :func:`int` para :meth:`~object.__trunc__` está agora obsoleta. Chamar ``int(a)`` quando ``type(a)`` implementa :meth:`!__trunc__`, mas não :meth:`~object.__int__` ou :meth:`~object.__index__`, agora lança um :exc:`DeprecationWarning`. (Contribuído por Zackery Spytz em :issue:`44977`.)

source: Modules
pt_pt: Módulos

source: :pep:`594` led to the deprecations of the following modules slated for removal in Python 3.13:
pt_pt: A :pep:`594` levou à obsolescência dos seguintes módulos, programados para remoção no Python 3.13:

source: (Contributed by Brett Cannon in :issue:`47061` and Victor Stinner in :gh:`68966`.)
pt_pt: (Contribuído por Brett Cannon em :issue:`47061` e Victor Stinner em :gh:`68966`.)

source: The :mod:`!asynchat`, :mod:`!asyncore` and :mod:`!smtpd` modules have been deprecated since at least Python 3.6. Their documentation and deprecation warnings have now been updated to note they will be removed in Python 3.12. (Contributed by Hugo van Kemenade in :issue:`47022`.)
pt_pt: Os módulos :mod:`!asynchat`, :mod:`!asyncore` e :mod:`!smtpd` estão obsoletos desde pelo menos o Python 3.6. A sua documentação e avisos de obsolescência foram agora atualizados para indicar que serão removidos no Python 3.12. (Contribuído por Hugo van Kemenade em :issue:`47022`.)

source: The :mod:`!lib2to3` package and ``2to3`` tool are now deprecated and may not be able to parse Python 3.10 or newer. See :pep:`617`, introducing the new PEG parser, for details. (Contributed by Victor Stinner in :issue:`40360`.)
pt_pt: O pacote :mod:`!lib2to3` e a ferramenta ``2to3`` estão agora obsoletos e podem não ser capazes de analisar Python 3.10 ou versões mais recentes. Consulte :pep:`617`, que introduz o novo analisador PEG, para mais detalhes. (Contribuído por Victor Stinner em :issue:`40360`.)

source: Undocumented modules :mod:`!sre_compile`, :mod:`!sre_constants` and :mod:`!sre_parse` are now deprecated. (Contributed by Serhiy Storchaka in :issue:`47152`.)
pt_pt: Módulos não documentados :mod:`!sre_compile`, :mod:`!sre_constants` e :mod:`!sre_parse` estão agora obsoletos. (Contribuído por Serhiy Storchaka em :issue:`47152`.)

source: Standard Library
pt_pt: Biblioteca Padrão

source: The following have been deprecated in :mod:`configparser` since Python 3.2. Their deprecation warnings have now been updated to note they will be removed in Python 3.12:
pt_pt: Os seguintes elementos estão obsoletos em :mod:`configparser` desde o Python 3.2. Os seus avisos de obsolescência foram agora atualizados para indicar que serão removidos no Python 3.12:

source: the :class:`!configparser.SafeConfigParser` class
pt_pt: a classe :class:`!configparser.SafeConfigParser`

source: the :attr:`!configparser.ParsingError.filename` property
pt_pt: a propriedade :attr:`!configparser.ParsingError.filename`

source: the :meth:`!configparser.RawConfigParser.readfp` method
pt_pt: o método :meth:`!configparser.RawConfigParser.readfp`

source: (Contributed by Hugo van Kemenade in :issue:`45173`.)
pt_pt: (Contribuído por Hugo van Kemenade em :issue:`45173`.)

source: :class:`!configparser.LegacyInterpolation` has been deprecated in the docstring since Python 3.2, and is not listed in the :mod:`configparser` documentation. It now emits a :exc:`DeprecationWarning` and will be removed in Python 3.13. Use :class:`configparser.BasicInterpolation` or :class:`configparser.ExtendedInterpolation` instead. (Contributed by Hugo van Kemenade in :issue:`46607`.)
pt_pt: :class:`!configparser.LegacyInterpolation` está obsoleto na docstring desde o Python 3.2 e não está listado na documentação do :mod:`configparser`. Agora emite um :exc:`DeprecationWarning` e será removido no Python 3.13. Use :class:`configparser.BasicInterpolation` ou :class:`configparser.ExtendedInterpolation` em vez disso. (Contribuído por Hugo van Kemenade em :issue:`46607`.)

source: The older set of :mod:`importlib.resources` functions were deprecated in favor of the replacements added in Python 3.9 and will be removed in a future Python version, due to not supporting resources located within package subdirectories:
pt_pt: O conjunto mais antigo de funções :mod:`importlib.resources` foi obsoleto em favor das substituições adicionadas no Python 3.9 e será removido numa futura versão do Python, devido a não suportar recursos localizados em subdiretórios de pacotes:

source: The :func:`locale.getdefaultlocale` function is deprecated and will be removed in Python 3.15. Use :func:`locale.setlocale`, :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` and :func:`locale.getlocale` functions instead. (Contributed by Victor Stinner in :gh:`90817`.)
pt_pt: A função :func:`locale.getdefaultlocale` está obsoleta e será removida no Python 3.15. Use as funções :func:`locale.setlocale`, :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` e :func:`locale.getlocale` em vez disso. (Contribuído por Victor Stinner em :gh:`90817`.)

source: The :func:`!locale.resetlocale` function is deprecated and will be removed in Python 3.13. Use ``locale.setlocale(locale.LC_ALL, "")`` instead. (Contributed by Victor Stinner in :gh:`90817`.)
pt_pt: A função :func:`!locale.resetlocale` está obsoleta e será removida no Python 3.13. Use ``locale.setlocale(locale.LC_ALL, "")`` em vez disso. (Contribuído por Victor Stinner em :gh:`90817`.)

source: Stricter rules will now be applied for numerical group references and group names in :ref:`regular expressions <re-syntax>`. Only sequences of ASCII digits will now be accepted as a numerical reference, and the group name in :class:`bytes` patterns and replacement strings can only contain ASCII letters, digits and underscores. For now, a deprecation warning is raised for syntax violating these rules. (Contributed by Serhiy Storchaka in :gh:`91760`.)
pt_pt: Regras mais rigorosas serão agora aplicadas a referências de grupos numéricos e nomes de grupos em :ref:`expressões regulares <re-syntax>`. Apenas sequências de dígitos ASCII serão agora aceites como uma referência numérica, e o nome do grupo em padrões :class:`bytes` e cadeias de substituição só pode conter letras ASCII, dígitos e sublinhados. Por enquanto, é emitido um aviso de obsolescência para sintaxe que viole estas regras. (Contribuído por Serhiy Storchaka em :gh:`91760`.)

source: In the :mod:`re` module, the :func:`!re.template` function and the corresponding :const:`!re.TEMPLATE` and :const:`!re.T` flags are deprecated, as they were undocumented and lacked an obvious purpose. They will be removed in Python 3.13. (Contributed by Serhiy Storchaka and Miro Hrončok in :gh:`92728`.)
pt_pt: No módulo :mod:`re`, a função :func:`!re.template` e as flags correspondentes :const:`!re.TEMPLATE` e :const:`!re.T` estão obsoletas, uma vez que não estavam documentadas e não tinham um propósito óbvio. Serão removidas no Python 3.13. (Contribuído por Serhiy Storchaka e Miro Hrončok em :gh:`92728`.)

source: :func:`!turtle.settiltangle` has been deprecated since Python 3.1; it now emits a deprecation warning and will be removed in Python 3.13. Use :func:`turtle.tiltangle` instead (it was earlier incorrectly marked as deprecated, and its docstring is now corrected). (Contributed by Hugo van Kemenade in :issue:`45837`.)
pt_pt: :func:`!turtle.settiltangle` está obsoleto desde o Python 3.1; agora emite um aviso de obsolescência e será removido no Python 3.13. Use :func:`turtle.tiltangle` em vez disso (foi anteriormente incorretamente marcado como obsoleto, e a sua docstring está agora corrigida). (Contribuído por Hugo van Kemenade em :issue:`45837`.)
