Repository: NyaPuma/python-docs-pt-pt
Catalog: library/asyncio-api-index.po
Languages: pt_pt

source: High-level API Index
pt_pt: Índice de API de alto nível

source: This page lists all high-level async/await enabled asyncio APIs.
pt_pt: Esta página lista todas as APIs *async/await* de alto nível do *asyncio*.

source: Tasks
pt_pt: Tarefas

source: Utilities to run asyncio programs, create Tasks, and await on multiple things with timeouts.
pt_pt: Utilitários para executar programas *asyncio*, criar tarefas e aguardar múltiplos objetos com *timeouts*.

source: Create event loop, run a coroutine, close the loop.
pt_pt: Cria um ciclo de eventos, executa uma corrotina e fecha o ciclo.

source: A context manager that simplifies multiple async function calls.
pt_pt: Um gestor de contexto que simplifica múltiplas chamadas a funções assíncronas.

source: Task object.
pt_pt: Objeto de tarefa.

source: A context manager that holds a group of tasks. Provides a convenient and reliable way to wait for all tasks in the group to finish.
pt_pt: Um gestor de contexto que agrupa tarefas. Fornece uma forma conveniente e fiável para aguardar que todas as tarefas do grupo terminem.

source: Start an asyncio Task, then returns it.
pt_pt: Inicia uma tarefa *asyncio* e devolve-a.

source: Return the current Task.
pt_pt: Devolve a tarefa atual.

source: Return all tasks that are not yet finished for an event loop.
pt_pt: Devolve todas as tarefas ainda não concluídas de um ciclo de eventos.

source: Sleep for a number of seconds.
pt_pt: Aguarda durante um número de segundos.

source: Schedule and wait for things concurrently.
pt_pt: Agenda e aguarda objetos de forma concorrente.

source: Run with a timeout.
pt_pt: Executa com um *timeout*.

source: Shield from cancellation.
pt_pt: Protege contra cancelamento.

source: Monitor for completion.
pt_pt: Monitoriza a conclusão.

source: Run with a timeout. Useful in cases when ``wait_for`` is not suitable.
pt_pt: Executa com um *timeout*. Útil em casos em que ``wait_for`` não é adequado.

source: Asynchronously run a function in a separate OS thread.
pt_pt: Executa uma função de forma assíncrona numa *thread* do sistema operativo separada.

source: Schedule a coroutine from another OS thread.
pt_pt: Agenda uma corrotina a partir de outra *thread* do sistema operativo.

source: Monitor for completion with a ``for`` loop.
pt_pt: Monitoriza a conclusão com um ciclo ``for``.

source: Examples
pt_pt: Exemplos

source: :ref:`Using asyncio.gather() to run things in parallel <asyncio_example_gather>`.
pt_pt: :ref:`Usar asyncio.gather() para executar objetos em paralelo <asyncio_example_gather>`.

source: :ref:`Using asyncio.wait_for() to enforce a timeout <asyncio_example_waitfor>`.
pt_pt: :ref:`Usar asyncio.wait_for() para impor um timeout <asyncio_example_waitfor>`.

source: :ref:`Cancellation <asyncio_example_task_cancel>`.
pt_pt: :ref:`Cancelamento <asyncio_example_task_cancel>`.

source: :ref:`Using asyncio.sleep() <asyncio_example_sleep>`.
pt_pt: :ref:`Usar asyncio.sleep() <asyncio_example_sleep>`.

source: See also the main :ref:`Tasks documentation page <coroutine>`.
pt_pt: Consulte também a página principal da :ref:`documentação de tarefas <coroutine>`.

source: Queues
pt_pt: Filas

source: Queues should be used to distribute work amongst multiple asyncio Tasks, implement connection pools, and pub/sub patterns.
pt_pt: As filas devem ser usadas para distribuir trabalho entre múltiplas tarefas *asyncio*, implementar *pools* de ligações e padrões *pub/sub*.

source: A FIFO queue.
pt_pt: Uma fila FIFO.

source: A priority queue.
pt_pt: Uma fila de prioridades.

source: A LIFO queue.
pt_pt: Uma fila LIFO.

source: :ref:`Using asyncio.Queue to distribute workload between several Tasks <asyncio_example_queue_dist>`.
pt_pt: :ref:`Usar asyncio.Queue para distribuir carga de trabalho entre várias tarefas <asyncio_example_queue_dist>`.

source: See also the :ref:`Queues documentation page <asyncio-queues>`.
pt_pt: Consulte também a :ref:`página de documentação de filas <asyncio-queues>`.

source: Subprocesses
pt_pt: Subprocessos

source: Utilities to spawn subprocesses and run shell commands.
pt_pt: Utilitários para criar subprocessos e executar comandos de *shell*.

source: Create a subprocess.
pt_pt: Cria um subprocesso.

source: Run a shell command.
pt_pt: Executa um comando de *shell*.

source: :ref:`Executing a shell command <asyncio_example_subprocess_shell>`.
pt_pt: :ref:`Executar um comando de shell <asyncio_example_subprocess_shell>`.

source: See also the :ref:`subprocess APIs <asyncio-subprocess>` documentation.
pt_pt: Consulte também a :ref:`documentação das APIs de subprocessos <asyncio-subprocess>`.

source: High-level APIs to work with network IO.
pt_pt: APIs de alto nível para trabalhar com E/S de rede.

source: Establish a TCP connection.
pt_pt: Estabelece uma ligação TCP.

source: Establish a Unix socket connection.
pt_pt: Estabelece uma ligação de *socket* Unix.

source: Start a TCP server.
pt_pt: Inicia um servidor TCP.

source: Start a Unix socket server.
pt_pt: Inicia um servidor de *socket* Unix.

source: High-level async/await object to receive network data.
pt_pt: Objeto *async/await* de alto nível para receber dados de rede.

source: High-level async/await object to send network data.
pt_pt: Objeto *async/await* de alto nível para enviar dados de rede.

source: :ref:`Example TCP client <asyncio_example_stream>`.
pt_pt: :ref:`Exemplo de cliente TCP <asyncio_example_stream>`.

source: See also the :ref:`streams APIs <asyncio-streams>` documentation.
pt_pt: Consulte também a :ref:`documentação das APIs de *streams* <asyncio-streams>`.

source: Synchronization
pt_pt: Sincronização

source: Threading-like synchronization primitives that can be used in Tasks.
pt_pt: Primitivas de sincronização semelhantes a *threads* que podem ser usadas em tarefas.

source: A mutex lock.
pt_pt: Um bloqueio *mutex*.

source: An event object.
pt_pt: Um objeto de evento.

source: A condition object.
pt_pt: Um objeto de condição.

source: A semaphore.
pt_pt: Um semáforo.

source: A bounded semaphore.
pt_pt: Um semáforo limitado.

source: A barrier object.
pt_pt: Um objeto de barreira.

source: :ref:`Using asyncio.Event <asyncio_example_sync_event>`.
pt_pt: :ref:`Usar asyncio.Event <asyncio_example_sync_event>`.

source: :ref:`Using asyncio.Barrier <asyncio_example_barrier>`.
pt_pt: :ref:`Usar asyncio.Barrier <asyncio_example_barrier>`.

source: See also the documentation of asyncio :ref:`synchronization primitives <asyncio-sync>`.
pt_pt: Consulte também a documentação das :ref:`primitivas de sincronização do asyncio <asyncio-sync>`.

source: Exceptions
pt_pt: Exceções

source: Raised when a Task is cancelled. See also :meth:`Task.cancel`.
pt_pt: Gerada quando uma tarefa é cancelada. Consulte também :meth:`Task.cancel`.

source: Raised when a Barrier is broken. See also :meth:`Barrier.wait`.
pt_pt: Gerada quando uma barreira é quebrada. Consulte também :meth:`Barrier.wait`.

source: :ref:`Handling CancelledError to run code on cancellation request <asyncio_example_task_cancel>`.
pt_pt: :ref:`Tratar CancelledError para executar código em caso de pedido de cancelamento <asyncio_example_task_cancel>`.

source: See also the full list of :ref:`asyncio-specific exceptions <asyncio-exceptions>`.
pt_pt: Veja também a lista completa de :ref:`exceções específicas do asyncio <asyncio-exceptions>`.
