Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/allocation.po
Languages: pt_pt

source: Allocating Objects on the Heap
pt_pt: Alocação de objetos na heap

source: Initialize a newly allocated object *op* with its type and initial reference. Returns the initialized object. Other fields of the object are not initialized. Despite its name, this function is unrelated to the object's :meth:`~object.__init__` method (:c:member:`~PyTypeObject.tp_init` slot). Specifically, this function does **not** call the object's :meth:`!__init__` method.
pt_pt: Inicializa um objeto *op* recém-alocado com o seu tipo e referência inicial. Retorna o objeto inicializado. Outros campos do objeto não são inicializados. Apesar do nome, esta função não está relacionada com o método (:c:member:`~PyTypeObject.tp_init` slot) do objeto:meth:`~object.__init__`. Especificamente, esta função **não** chama o método do objeto :meth:`!__init__`.

source: In general, consider this function to be a low-level routine. Use :c:member:`~PyTypeObject.tp_alloc` where possible. For implementing :c:member:`!tp_alloc` for your type, prefer :c:func:`PyType_GenericAlloc` or :c:func:`PyObject_New`.
pt_pt: Em geral, considere esta função como uma rotina de baixo nível. Use :c:member:`~PyTypeObject.tp_alloc` sempre que possível. Para implementar :c:member:`!tp_alloc` para o seu tipo, prefira :c:func:`PyType_GenericAlloc` ou :c:func:`PyObject_New`.

source: This function only initializes the object's memory corresponding to the initial :c:type:`PyObject` structure. It does not zero the rest.
pt_pt: Esta função apenas inicializa a memória do objeto correspondente à estrutura inicial :c:type:`PyObject`. Não zera o restante.

source: This does everything :c:func:`PyObject_Init` does, and also initializes the length information for a variable-size object.
pt_pt: Isto faz tudo que o :c:func:`PyObject_Init` faz e também inicializa a informação de comprimento para um objeto de tamanho variável.

source: This function only initializes some of the object's memory. It does not zero the rest.
pt_pt: Esta função inicializa apenas parte da memória do objeto. Não zera o restante.

source: Allocates a new Python object using the C structure type *TYPE* and the Python type object *typeobj* (``PyTypeObject*``) by calling :c:func:`PyObject_Malloc` to allocate memory and initializing it like :c:func:`PyObject_Init`. The caller will own the only reference to the object (i.e. its reference count will be one).
pt_pt: Aloca um novo objeto Python usando o tipo de estrutura C *TYPE* e o objeto de tipo Python *typeobj* (``PyTypeObject*``) chamando :c:func:`PyObject_Malloc` para alocar memória e inicializando-o como :c:func:`PyObject_Init`. O chamador possuirá a única referência ao objeto (ou seja, a sua contagem de referências será um).

source: Avoid calling this directly to allocate memory for an object; call the type's :c:member:`~PyTypeObject.tp_alloc` slot instead.
pt_pt: Evite chamar isto diretamente para alocar memória para um objeto; em vez disso, chame o slot :c:member:`~PyTypeObject.tp_alloc` do tipo.

source: When populating a type's :c:member:`~PyTypeObject.tp_alloc` slot, :c:func:`PyType_GenericAlloc` is preferred over a custom function that simply calls this macro.
pt_pt: Ao preencher o slot :c:member:`~PyTypeObject.tp_alloc` de um tipo, :c:func:`PyType_GenericAlloc` é preferível a uma função personalizada que simplesmente chama esta macro.

source: This macro does not call :c:member:`~PyTypeObject.tp_alloc`, :c:member:`~PyTypeObject.tp_new` (:meth:`~object.__new__`), or :c:member:`~PyTypeObject.tp_init` (:meth:`~object.__init__`).
pt_pt: Esta macro não chama :c:member:`~PyTypeObject.tp_alloc`, :c:member:`~PyTypeObject.tp_new` (:meth:`~object.__new__`) ou :c:member:`~PyTypeObject.tp_init` (:meth:`~object.__init__`).

source: This cannot be used for objects with :c:macro:`Py_TPFLAGS_HAVE_GC` set in :c:member:`~PyTypeObject.tp_flags`; use :c:macro:`PyObject_GC_New` instead.
pt_pt: Isto não pode ser usado para objetos com :c:macro:`Py_TPFLAGS_HAVE_GC` definido em :c:member:`~PyTypeObject.tp_flags`; use :c:macro:`PyObject_GC_New` em vez disso.

source: Memory allocated by this macro must be freed with :c:func:`PyObject_Free` (usually called via the object's :c:member:`~PyTypeObject.tp_free` slot).
pt_pt: A memória alocada por esta macro deve ser liberada com :c:func:`PyObject_Free` (geralmente chamado por meio do slot :c:member:`~PyTypeObject.tp_free` do objeto).

source: The returned memory is not guaranteed to have been completely zeroed before it was initialized.
pt_pt: Não é garantido que a memória devolvida tenha sido inicializada a zero antes de ser utilizada.

source: This macro does not construct a fully initialized object of the given type; it merely allocates memory and prepares it for further initialization by :c:member:`~PyTypeObject.tp_init`. To construct a fully initialized object, call *typeobj* instead. For example::
pt_pt: Esta macro não constrói um objeto totalmente inicializado do tipo fornecido; ela apenas aloca memória e a prepara para inicialização posterior por :c:member:`~PyTypeObject.tp_init`. Para construir um objeto totalmente inicializado, chame *typeobj*. Por exemplo:

source: Like :c:macro:`PyObject_New` except:
pt_pt: Como :c:macro:`PyObject_New`, exceto que:

source: It allocates enough memory for the *TYPE* structure plus *size* (``Py_ssize_t``) fields of the size given by the :c:member:`~PyTypeObject.tp_itemsize` field of *typeobj*.
pt_pt: Ela aloca memória suficiente para a estrutura *TYPE* mais os *size* (``Py_ssize_t``) campos do tamanho fornecido pelo campo :c:member:`~PyTypeObject.tp_itemsize` de *typeobj*.

source: The memory is initialized like :c:func:`PyObject_InitVar`.
pt_pt: A memória é inicializada como :c:func:`PyObject_InitVar`.

source: This is useful for implementing objects like tuples, which are able to determine their size at construction time. Embedding the array of fields into the same allocation decreases the number of allocations, improving the memory management efficiency.
pt_pt: Isto é útil para implementar objetos como tuplos, que são capazes de determinar o seu tamanho no momento da construção. Incorporar o array de campos na mesma alocação diminui o número de alocações, melhorando a eficiência da gestão de memória.

source: This cannot be used for objects with :c:macro:`Py_TPFLAGS_HAVE_GC` set in :c:member:`~PyTypeObject.tp_flags`; use :c:macro:`PyObject_GC_NewVar` instead.
pt_pt: Isto não pode ser usado para objetos com :c:macro:`Py_TPFLAGS_HAVE_GC` definido em :c:member:`~PyTypeObject.tp_flags`; use :c:macro:`PyObject_GC_NewVar` em vez disso.

source: Memory allocated by this function must be freed with :c:func:`PyObject_Free` (usually called via the object's :c:member:`~PyTypeObject.tp_free` slot).
pt_pt: A memória alocada por esta função deve ser liberada com :c:func:`PyObject_Free` (geralmente chamado por meio do slot :c:member:`~PyTypeObject.tp_free` do objeto).

source: Object which is visible in Python as ``None``. This should only be accessed using the :c:macro:`Py_None` macro, which evaluates to a pointer to this object.
pt_pt: Objeto visível em Python como ``None``. Este só deve ser acedido utilizando a macro :c:macro:`Py_None`, que avalia um ponteiro para este objeto.

source: To allocate and create extension modules.
pt_pt: Para alocar e criar módulos de extensão.

source: Deprecated aliases
pt_pt: Alias obsoleto

source: Deprecated alias
pt_pt: Alias obsoleto

source: Function
pt_pt: Função
