Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/bytearray.po
Languages: pt_pt

source: Byte Array Objects
pt_pt: Objetos byte array

source: This subtype of :c:type:`PyObject` represents a Python bytearray object.
pt_pt: Esse subtipo de :c:type:`PyObject` representa um objeto Python bytearray.

source: This instance of :c:type:`PyTypeObject` represents the Python bytearray type; it is the same object as :class:`bytearray` in the Python layer.
pt_pt: Essa instância de :c:type:`PyTypeObject` representa um tipo Python bytearray; é o mesmo objeto que o :class:`bytearray` na camada Python.

source: Type check macros
pt_pt: Macros para verificação de tipo

source: Return true if the object *o* is a bytearray object or an instance of a subtype of the bytearray type. This function always succeeds.
pt_pt: Retorna verdadeiro se o objeto *o* for um objeto bytearray ou se for uma instância de um subtipo do tipo bytearray. Esta função é sempre bem-sucedida.

source: Return true if the object *o* is a bytearray object, but not an instance of a subtype of the bytearray type. This function always succeeds.
pt_pt: Retorna verdadeiro se o objeto *o* for um objeto bytearray, mas não uma instância de um subtipo do tipo bytearray. Esta função é sempre bem-sucedida.

source: Direct API functions
pt_pt: Funções diretas da API

source: Return a new bytearray object from any object, *o*, that implements the :ref:`buffer protocol <bufferobjects>`.
pt_pt: Retorna um novo objeto bytearray a partir de qualquer objeto, *o*, que implemente o :ref:`protocolo buffer <bufferobjects>`.

source: On failure, return ``NULL`` with an exception set.
pt_pt: Em caso de falha, retorna ``NULL`` com uma exceção definida.

source: Create a new bytearray object from *string* and its length, *len*.
pt_pt: Cria um novo objeto bytearray a partir de *string* e seu comprimento, *len*.

source: Concat bytearrays *a* and *b* and return a new bytearray with the result.
pt_pt: Concatena os bytearrays *a* e *b* e retorna um novo bytearray com o resultado.

source: Return the size of *bytearray* after checking for a ``NULL`` pointer.
pt_pt: Retorna o tamanho de *bytearray* após verificar se há um ponteiro ``NULL``.

source: Return the contents of *bytearray* as a char array after checking for a ``NULL`` pointer. The returned array always has an extra null byte appended.
pt_pt: Retorna o conteúdo de *bytearray* como uma array de caracteres após verificar um ponteiro ``NULL``. O array retornado sempre tem um byte nulo extra acrescentado.

source: Resize the internal buffer of *bytearray* to *len*. Failure is a ``-1`` return with an exception set.
pt_pt: Redimensiona o buffer interno de *bytearray* para o tamanho *len*. Falha é um retorno ``-1`` com um conjunto de exceções.

source: A negative *len* will now result in an exception being set and -1 returned.
pt_pt: Um *len* negativo agora resultará na definição de uma exceção e no retorno de -1.

source: These macros trade safety for speed and they don't check pointers.
pt_pt: Estas macros trocam segurança por velocidade e não verificam os ponteiros.

source: Similar to :c:func:`PyByteArray_AsString`, but without error checking.
pt_pt: Similar a :c:func:`PyByteArray_AsString`, mas sem verificação de erro.

source: Similar to :c:func:`PyByteArray_Size`, but without error checking.
pt_pt: Similar a :c:func:`PyByteArray_Size`, mas sem verificação de erro.

source: object
pt_pt: objeto
