Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/concrete.po
Languages: pt_pt

source: Concrete Objects Layer
pt_pt: Camada de Objetos Concretos

source: The functions in this chapter are specific to certain Python object types. Passing them an object of the wrong type is not a good idea; if you receive an object from a Python program and you are not sure that it has the right type, you must perform a type check first; for example, to check that an object is a dictionary, use :c:func:`PyDict_Check`. The chapter is structured like the "family tree" of Python object types.
pt_pt: As funções neste capítulo são específicas para certos tipos de objetos Python. Passar para eles um objeto do tipo errado não é uma boa ideia; se você receber um objeto de um programa Python e não tiver certeza de que ele tem o tipo certo, primeiro execute uma verificação de tipo; por exemplo, para verificar se um objeto é um dicionário, use :c:func:`PyDict_Check`. O capítulo está estruturado como a "árvore genealógica" dos tipos de objetos Python.

source: While the functions described in this chapter carefully check the type of the objects which are passed in, many of them do not check for ``NULL`` being passed instead of a valid object. Allowing ``NULL`` to be passed in can cause memory access violations and immediate termination of the interpreter.
pt_pt: Enquanto as funções descritas neste capítulo verificam cuidadosamente o tipo de objetos passados, muitos deles não verificam a passagem de ``NULL`` em vez de um objeto válido. Permitir a passagem de ``NULL`` pode causar violações ao acesso à memória e encerramento imediato do interpretador.

source: Fundamental Objects
pt_pt: Objetos Fundamentais

source: This section describes Python type objects and the singleton object ``None``.
pt_pt: Esta seção descreve os objetos de tipo Python e o objeto singleton ``None``.

source: Numeric Objects
pt_pt: Objetos Numéricos

source: Sequence Objects
pt_pt: Objetos Sequência

source: Generic operations on sequence objects were discussed in the previous chapter; this section deals with the specific kinds of sequence objects that are intrinsic to the Python language.
pt_pt: Operações genéricas em objetos de sequência foram discutidas no capítulo anterior; Esta secção lida com os tipos específicos de objetos sequência que são intrínsecos à linguagem Python.

source: Container Objects
pt_pt: Objetos Contentores

source: Function Objects
pt_pt: Objetos Função

source: Other Objects
pt_pt: Outros Objetos

source: object
pt_pt: objeto

source: numeric
pt_pt: numérico

source: sequence
pt_pt: sequência

source: mapping
pt_pt: mapeamento
