Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/contextvars.po
Languages: pt_pt

source: Context Variables Objects
pt_pt: Objetos de variáveis de contexto

source: In Python 3.7.1 the signatures of all context variables C APIs were **changed** to use :c:type:`PyObject` pointers instead of :c:type:`PyContext`, :c:type:`PyContextVar`, and :c:type:`PyContextToken`, e.g.::
pt_pt: No Python 3.7.1, as assinaturas de todas as APIs C de variáveis de contexto foram **alteradas** para usar ponteiros :c:type:`PyObject` em vez de :c:type:`PyContext`, :c:type:`PyContextVar` e :c:type:`PyContextToken`. Por exemplo::

source: // in 3.7.0: PyContext *PyContext_New(void); // in 3.7.1+: PyObject *PyContext_New(void);
pt_pt: // no 3.7.0: PyContext *PyContext_New(void); // no 3.7.1+: PyObject *PyContext_New(void);

source: See :issue:`34762` for more details.
pt_pt: Veja :issue:`34762` para mais detalhes.

source: This section details the public C API for the :mod:`contextvars` module.
pt_pt: Esta secção detalha a C-API pública para o módulo :mod:`contextvars`.

source: The C structure used to represent a :class:`contextvars.Context` object.
pt_pt: A estrutura C usada para representar um objeto :class:`contextvars.Context`.

source: The C structure used to represent a :class:`contextvars.ContextVar` object.
pt_pt: A estrutura C usada para representar um objeto :class:`contextvars.ContextVar`.

source: The C structure used to represent a :class:`contextvars.Token` object.
pt_pt: A estrutura C usada para representar um objeto :class:`contextvars.Token`

source: The type object representing the *context* type.
pt_pt: O objeto de tipo que representa o tipo de *contexto*.

source: The type object representing the *context variable* type.
pt_pt: O objeto de tipo que representa o tipo de *variável de contexto*.

source: The type object representing the *context variable token* type.
pt_pt: O objeto de tipo que representa o tipo de *token de variável de contexto*.

source: Type-check macros:
pt_pt: Macros de verificação de tipo:

source: Return true if *o* is of type :c:data:`PyContext_Type`. *o* must not be ``NULL``. This function always succeeds.
pt_pt: Retorna verdadeiro se *o* for do tipo :c:data:`PyContext_Type`. *o* não deve ser ``NULL``. Esta função é sempre bem-sucedida.

source: Return true if *o* is of type :c:data:`PyContextVar_Type`. *o* must not be ``NULL``. This function always succeeds.
pt_pt: Retorna verdadeiro se *o* for do tipo :c:data:`PyContextVar_Type`. *o* não deve ser ``NULL``. Esta função é sempre bem-sucedida.

source: Return true if *o* is of type :c:data:`PyContextToken_Type`. *o* must not be ``NULL``. This function always succeeds.
pt_pt: Retorna verdadeiro se *o* for do tipo :c:data:`PyContextToken_Type`. *o* não deve ser ``NULL``. Esta função é sempre bem-sucedida.

source: Context object management functions:
pt_pt: Funções de gestão de objetos de contexto:

source: Create a new empty context object. Returns ``NULL`` if an error has occurred.
pt_pt: Cria um novo objeto de contexto vazio. Retorna ``NULL`` se um erro ocorreu.

source: Create a shallow copy of the passed *ctx* context object. Returns ``NULL`` if an error has occurred.
pt_pt: Cria uma cópia rasa do objeto de contexto *ctx* passado. Retorna ``NULL`` se ocorreu um erro.

source: Create a shallow copy of the current thread context. Returns ``NULL`` if an error has occurred.
pt_pt: Cria uma cópia rasa do contexto da thread atual. Retorna ``NULL`` se ocorreu um erro.

source: Set *ctx* as the current context for the current thread. Returns ``0`` on success, and ``-1`` on error.
pt_pt: Defina *ctx* como o contexto atual para o thread atual. Retorna ``0`` em caso de sucesso e ``-1`` em caso de erro.

source: Deactivate the *ctx* context and restore the previous context as the current context for the current thread. Returns ``0`` on success, and ``-1`` on error.
pt_pt: Desativa o contexto *ctx* e restaura o contexto anterior como o contexto atual para a thread atual. Retorna ``0`` em caso de sucesso e ``-1`` em caso de erro.

source: Register *callback* as a context object watcher for the current interpreter. Return an ID which may be passed to :c:func:`PyContext_ClearWatcher`. In case of error (e.g. no more watcher IDs available), return ``-1`` and set an exception.
pt_pt: Registra *callback* como um observador do objeto contexto para o interpretador atual. Devolve um ID que pode ser passado para :c:func:`PyContext_ClearWatcher`. Em caso de erro (por exemplo, não há IDs de observadores disponíveis), devolve ``-1`` e define uma exceção.

source: Clear watcher identified by *watcher_id* previously returned from :c:func:`PyContext_AddWatcher` for the current interpreter. Return ``0`` on success, or ``-1`` and set an exception on error (e.g. if the given *watcher_id* was never registered.)
pt_pt: Libera o observador identificado por *watcher_id* anteriormente retornado por :c:func:`PyContext_AddWatcher` para o interpretador atual. Retorna ``0`` em caso de sucesso ou ``-1`` em caso de erro e levanta uma exceção (ex., se o *watcher_id* dado não foi registrado.)

source: Enumeration of possible context object watcher events:
pt_pt: Enumeração de possíveis eventos do observador de objeto contexto:

source: ``Py_CONTEXT_SWITCHED``: The :term:`current context` has switched to a different context. The object passed to the watch callback is the now-current :class:`contextvars.Context` object, or None if no context is current.
pt_pt: ``Py_CONTEXT_SWITCHED``: O :term:`contexto atual` foi alternado para um contexto diferente. O objeto passado para o retorno de chamada de observação é o objeto :class:`contextvars.Context`, que está atualmente em uso, ou None se não houver contexto atual.

source: Context object watcher callback function. The object passed to the callback is event-specific; see :c:type:`PyContextEvent` for details.
pt_pt: Função de retorno de chamada do observador de objetos contexto. O objeto passado para o retorno de chamada é específico do evento; consulte :c:type:`PyContextEvent` para obter detalhes.

source: If the callback returns with an exception set, it must return ``-1``; this exception will be printed as an unraisable exception using :c:func:`PyErr_FormatUnraisable`. Otherwise it should return ``0``.
pt_pt: Se o retorno de chamada retornar com uma exceção definida, ele deverá retornar ``-1``; essa exceção será impressa como uma exceção não levantável usando :c:func:`PyErr_FormatUnraisable`. Caso contrário, deverá retornar ``0``.

source: There may already be a pending exception set on entry to the callback. In this case, the callback should return ``0`` with the same exception still set. This means the callback may not call any other API that can set an exception unless it saves and clears the exception state first, and restores it before returning.
pt_pt: É possível que já exista uma exceção pendente definida na entrada da função de retorno de chamada. Nesse caso, a função de retorno de chamada deve retornar ``0`` com a mesma exceção ainda definida. Isso significa que a função de retorno de chamada não pode chamar nenhuma outra API que possa definir uma exceção, a menos que salve e limpe o estado da exceção primeiro e restaure a exceção antes de retornar.

source: Context variable functions:
pt_pt: Funções de variável de contexto:

source: Create a new ``ContextVar`` object. The *name* parameter is used for introspection and debug purposes. The *def* parameter specifies a default value for the context variable, or ``NULL`` for no default. If an error has occurred, this function returns ``NULL``.
pt_pt: Cria um novo objeto ``ContextVar``. O parâmetro *name* é usado para fins de introspecção e depuração. O parâmetro *def* especifica um valor padrão para a variável de contexto, ou ``NULL`` para nenhum padrão. Se ocorrer um erro, esta função retorna ``NULL``.

source: Get the value of a context variable. Returns ``-1`` if an error has occurred during lookup, and ``0`` if no error occurred, whether or not a value was found.
pt_pt: Obtém o valor de uma variável de contexto. Retorna ``-1`` se um erro ocorreu durante a pesquisa, e ``0`` se nenhum erro ocorreu, independentemente de ter sido encontrado um valor ou não.

source: If the context variable was found, *value* will be a pointer to it. If the context variable was *not* found, *value* will point to:
pt_pt: Se a variável de contexto foi encontrada, *value* será um ponteiro para ela. Se a variável de contexto *não* foi encontrada, *value* apontará para:

source: *default_value*, if not ``NULL``;
pt_pt: *default_value*, se não for ``NULL``;

source: the default value of *var*, if not ``NULL``;
pt_pt: o valor padrão de *var*, se não for ``NULL``;

source: Except for ``NULL``, the function returns a new reference.
pt_pt: Exceto para ``NULL``, a função retorna uma nova referência.

source: Set the value of *var* to *value* in the current context. Returns a new token object for this change, or ``NULL`` if an error has occurred.
pt_pt: Define o valor de *var* como *value* no contexto atual. Retorna um novo objeto token para esta alteração, ou ``NULL`` se um erro ocorreu.

source: Reset the state of the *var* context variable to that it was in before :c:func:`PyContextVar_Set` that returned the *token* was called. This function returns ``0`` on success and ``-1`` on error.
pt_pt: Redefine o estado da variável de contexto *var* para o estado em que se encontrava antes de que o *token* :c:func:`PyContextVar_Set` fosse chamado. Esta função retorna ``0`` em caso de sucesso e ``-1`` em caso de erro.
