Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/exceptions.po
Languages: pt_pt

source: Exception Handling
pt_pt: Manipulando Exceções

source: The functions described in this chapter will let you handle and raise Python exceptions. It is important to understand some of the basics of Python exception handling. It works somewhat like the POSIX :c:data:`errno` variable: there is a global indicator (per thread) of the last error that occurred. Most C API functions don't clear this on success, but will set it to indicate the cause of the error on failure. Most C API functions also return an error indicator, usually ``NULL`` if they are supposed to return a pointer, or ``-1`` if they return an integer (exception: the ``PyArg_*`` functions return ``1`` for success and ``0`` for failure).
pt_pt: As funções descritas nesse capítulo permitem você tratar e gerar exceções em Python. É importante entender alguns princípios básicos no tratamento de exceções no Python. Funciona de forma parecida com a variável POSIX :c:data:`errno`: existe um indicador global (por thread) do último erro ocorrido. A maioria das funções da API C não limpa isso com êxito, mas indica a causa do erro na falha. A maioria das funções da API C retorna um indicador de erro, geralmente, ``NULL`` se eles devem retornar um ponteiro, ou ``-1`` se retornarem um inteiro (exceção: as funções ``PyArg_*`` retornam ``1`` para sucesso e ``0`` para falha).

source: Concretely, the error indicator consists of three object pointers: the exception's type, the exception's value, and the traceback object. Any of those pointers can be ``NULL`` if non-set (although some combinations are forbidden, for example you can't have a non-``NULL`` traceback if the exception type is ``NULL``).
pt_pt: Concretamente, o indicador de erro consiste em três ponteiros de objeto: o tipo da exceção, o valor da exceção e o objeto de traceback. Qualquer um desses ponteiros pode ser ``NULL`` se não definido (embora algumas combinações sejam proibidas, por exemplo, você não pode ter um traceback não ``NULL`` se o tipo de exceção for ``NULL``).

source: When a function must fail because some function it called failed, it generally doesn't set the error indicator; the function it called already set it. It is responsible for either handling the error and clearing the exception or returning after cleaning up any resources it holds (such as object references or memory allocations); it should *not* continue normally if it is not prepared to handle the error. If returning due to an error, it is important to indicate to the caller that an error has been set. If the error is not handled or carefully propagated, additional calls into the Python/C API may not behave as intended and may fail in mysterious ways.
pt_pt: Quando uma função deve falhar porque devido à falha de alguma função que ela chamou, ela geralmente não define o indicador de erro; a função que ela chamou já o definiu. Ela é responsável por manipular o erro e limpar a exceção ou retornar após limpar todos os recursos que possui (como referências a objetos ou alocações de memória); ela *não* deve continuar normalmente se não estiver preparada para lidar com o erro. Se estiver retornando devido a um erro, é importante indicar ao chamador que um erro foi definido. Se o erro não for manipulado ou propagado com cuidado, chamadas adicionais para a API C/Python podem não se comportar conforme o esperado e podem falhar de maneiras misteriosas.

source: The error indicator is **not** the result of :func:`sys.exc_info`. The former corresponds to an exception that is not yet caught (and is therefore still propagating), while the latter returns an exception after it is caught (and has therefore stopped propagating).
pt_pt: O indicador de erro **não** é resultado de :func:`sys.exc_info`. O primeiro corresponde a uma exceção que ainda não foi capturada (e, portanto, ainda está se propagando), enquanto o segundo retorna uma exceção após ser capturada (e, portanto, parou de se propagar).

source: Printing and clearing
pt_pt: Impressão e limpeza

source: Clear the error indicator. If the error indicator is not set, there is no effect.
pt_pt: Limpe o indicador de erro. Se o indicador de erro não estiver definido, não haverá efeito.

source: Print a standard traceback to ``sys.stderr`` and clear the error indicator. **Unless** the error is a ``SystemExit``, in that case no traceback is printed and the Python process will exit with the error code specified by the ``SystemExit`` instance.
pt_pt: Exibe um traceback padrão para ``sys.stderr`` e limpa o indicador de erro. **A menos que** o erro seja um ``SystemExit``, nesse caso, nenhum traceback será impresso e o processo Python será encerrado com o código de erro especificado pela instância ``SystemExit``.

source: Call this function **only** when the error indicator is set. Otherwise it will cause a fatal error!
pt_pt: Chame esta função **apenas** quando o indicador de erro estiver definido. Caso contrário, causará um erro fatal!

source: If *set_sys_last_vars* is nonzero, the variable :data:`sys.last_exc` is set to the printed exception. For backwards compatibility, the deprecated variables :data:`sys.last_type`, :data:`sys.last_value` and :data:`sys.last_traceback` are also set to the type, value and traceback of this exception, respectively.
pt_pt: Se *set_sys_last_vars* for diferente de zero, a variável :data:`sys.last_exc` é definida para a exceção impressa. Para compatibilidade com versões anteriores, as variáveis obsoletas :data:`sys.last_type`, :data:`sys.last_value` e :data:`sys.last_traceback` também são definidas para o tipo, valor e traceback dessa exceção, respectivamente.

source: The setting of :data:`sys.last_exc` was added.
pt_pt: A configuração de :data:`sys.last_exc` foi adicionada.

source: Alias for ``PyErr_PrintEx(1)``.
pt_pt: Alias para ``PyErr_PrintEx(1)``.

source: Call :func:`sys.unraisablehook` using the current exception and *obj* argument.
pt_pt: Chama :func:`sys.unraisablehook` usando a exceção atual e o argumento *obj*.

source: This utility function prints a warning message to ``sys.stderr`` when an exception has been set but it is impossible for the interpreter to actually raise the exception. It is used, for example, when an exception occurs in an :meth:`~object.__del__` method.
pt_pt: Esta função utilitária imprime uma mensagem de aviso para ``sys.stderr`` quando uma exceção foi definida, mas é impossível para o interpretador realmente levantar a exceção. É usada, por exemplo, quando ocorre uma exceção em um método :meth:`~object.__del__`.

source: The function is called with a single argument *obj* that identifies the context in which the unraisable exception occurred. If possible, the repr of *obj* will be printed in the warning message. If *obj* is ``NULL``, only the traceback is printed.
pt_pt: A função é chamada com um único argumento *obj* que identifica o contexto em que ocorreu a exceção não levantável. Se possível, o repr de *obj* será impresso na mensagem de aviso. Se *obj* for ``NULL``, apenas o traceback será impresso.

source: An exception must be set when calling this function.
pt_pt: Uma exceção deve ser definida ao chamar essa função.

source: Print a traceback. Print only traceback if *obj* is ``NULL``.
pt_pt: Exibe o traceback. Exibe apenas o traceback se *obj* for ``NULL``.

source: Use :func:`sys.unraisablehook`.
pt_pt: Utiliza :func:`sys.unraisablehook`.

source: Similar to :c:func:`PyErr_WriteUnraisable`, but the *format* and subsequent parameters help format the warning message; they have the same meaning and values as in :c:func:`PyUnicode_FromFormat`. ``PyErr_WriteUnraisable(obj)`` is roughly equivalent to ``PyErr_FormatUnraisable("Exception ignored in: %R", obj)``. If *format* is ``NULL``, only the traceback is printed.
pt_pt: Semelhante a :c:func:`PyErr_WriteUnraisable`, mas o *formato* e os parâmetros subsequentes ajudam a formatar a mensagem de aviso; eles têm o mesmo significado e valores que em :c:func:`PyUnicode_FromFormat`. ``PyErr_WriteUnraisable(obj)`` é aproximadamente equivalente a ``PyErr_FormatUnraisable("Exception ignored in: %R", obj)``. Se *formato* for ``NULL``, apenas o traceback será impresso.

source: Print the standard traceback display of ``exc`` to ``sys.stderr``, including chained exceptions and notes.
pt_pt: Imprima a exibição padrão do traceback de ``exc`` para ``sys.stderr``, incluindo exceções encadeadas e notas.

source: Raising exceptions
pt_pt: Levantando exceções

source: These functions help you set the current thread's error indicator. For convenience, some of these functions will always return a ``NULL`` pointer for use in a ``return`` statement.
pt_pt: Essas funções ajudam a definir o indicador de erro do thread. Por conveniência, algumas dessas funções sempre retornam um ponteiro ``NULL`` ao usar instrução com ``return``.

source: This is the most common way to set the error indicator. The first argument specifies the exception type; it is normally one of the standard exceptions, e.g. :c:data:`PyExc_RuntimeError`. You need not create a new :term:`strong reference` to it (e.g. with :c:func:`Py_INCREF`). The second argument is an error message; it is decoded from ``'utf-8'``.
pt_pt: Esta é a forma mais comum de definir o indicador de erro. O primeiro argumento especifica o tipo de exceção; normalmente é uma das exceções padrão, por exemplo, :c:data:`PyExc_RuntimeError`. Não é necessário criar uma nova :term:`referência forte` para ela (por exemplo, com :c:func:`Py_INCREF`). O segundo argumento é uma mensagem de erro; ela é descodificada a partir de ``'utf-8'``.

source: This function is similar to :c:func:`PyErr_SetString` but lets you specify an arbitrary Python object for the "value" of the exception.
pt_pt: Essa função é semelhante à :c:func:`PyErr_SetString` mas permite especificar um objeto Python arbitrário para o valor da exceção.

source: This function sets the error indicator and returns ``NULL``. *exception* should be a Python exception class. The *format* and subsequent parameters help format the error message; they have the same meaning and values as in :c:func:`PyUnicode_FromFormat`. *format* is an ASCII-encoded string.
pt_pt: Esta função define o indicador de erro e retorna ``NULL``. *exception* deve ser uma classe de exceção Python. O *format* e os parâmetros subsequentes ajudam a formatar a mensagem de erro; eles têm o mesmo significado e valores que em :c:func:`PyUnicode_FromFormat`. *format* é uma string codificada em ASCII.

source: Same as :c:func:`PyErr_Format`, but taking a :c:type:`va_list` argument rather than a variable number of arguments.
pt_pt: Igual a :c:func:`PyErr_Format`, mas usando o argumento :c:type:`va_list` em vez de um número variável de argumentos.

source: This is a shorthand for ``PyErr_SetObject(type, Py_None)``.
pt_pt: Isso é uma abreviação para ``PyErr_SetObject(type, Py_None)``.

source: This is a shorthand for ``PyErr_SetString(PyExc_TypeError, message)``, where *message* indicates that a built-in operation was invoked with an illegal argument. It is mostly for internal use.
pt_pt: Esta é uma abreviação para ``PyErr_SetString(PyExc_TypeError, message)``, onde *mensagem* indica que uma operação embutida foi invocada com um argumento ilegal. É principalmente para uso interno.

source: This is a shorthand for ``PyErr_SetNone(PyExc_MemoryError)``; it returns ``NULL`` so an object allocation function can write ``return PyErr_NoMemory();`` when it runs out of memory.
pt_pt: Essa é uma abreviação para ``PyErr_SetNone(PyExc_MemoryError)``; que retorna ``NULL`` para que uma função de alocação de objeto possa escrever ``return PyErr_NoMemory();`` quando ficar sem memória.

source: This is a convenience function to raise an exception when a C library function has returned an error and set the C variable :c:data:`errno`. It constructs a tuple object whose first item is the integer :c:data:`errno` value and whose second item is the corresponding error message (gotten from :c:func:`!strerror`), and then calls ``PyErr_SetObject(type, object)``. On Unix, when the :c:data:`errno` value is :c:macro:`!EINTR`, indicating an interrupted system call, this calls :c:func:`PyErr_CheckSignals`, and if that set the error indicator, leaves it set to that. The function always returns ``NULL``, so a wrapper function around a system call can write ``return PyErr_SetFromErrno(type);`` when the system call returns an error.
pt_pt: Esta é uma função conveniente para levantar uma exceção quando uma função da biblioteca C retornou um erro e definir a variável C :c:data:`errno`. Ela constrói um objeto tupla cujo primeiro item é o valor inteiro :c:data:`errno` e cujo segundo item é a mensagem de erro correspondente (obtida de :c:func:`!strerror`), e então chama ``PyErr_SetObject(type, object)``. No Unix, quando o valor :c:data:`errno` é :c:macro:`!EINTR`, indicando uma chamada de sistema interrompida, isso chama :c:func:`PyErr_CheckSignals`, e se isso definir o indicador de erro, deixa-o definido como tal. A função retorna sempre ``NULL``, pelo que uma função wrapper em torno de uma chamada do sistema pode escrever ``return PyErr_SetFromErrno(type);`` quando a chamada do sistema retorna um erro.

source: Similar to :c:func:`PyErr_SetFromErrno`, with the additional behavior that if *filenameObject* is not ``NULL``, it is passed to the constructor of *type* as a third parameter. In the case of :exc:`OSError` exception, this is used to define the :attr:`!filename` attribute of the exception instance.
pt_pt: Semelhante a :c:func:`PyErr_SetFromErrno`, com o comportamento adicional de que, se *filenameObject* não for ``NULL``, ele é passado para o construtor de *type* como um terceiro parâmetro. No caso de exceção :exc:`OSError`, isso é usado para definir o atributo :attr:`!filename` da instância da exceção.

source: Similar to :c:func:`PyErr_SetFromErrnoWithFilenameObject`, but takes a second filename object, for raising errors when a function that takes two filenames fails.
pt_pt: Semelhante a :c:func:`PyErr_SetFromErrnoWithFilenameObject`, mas aceita um segundo objeto filename, para gerar erros quando uma função que aceita dois nomes de ficheiros falha.

source: Similar to :c:func:`PyErr_SetFromErrnoWithFilenameObject`, but the filename is given as a C string. *filename* is decoded from the :term:`filesystem encoding and error handler`.
pt_pt: Semelhante a :c:func:`PyErr_SetFromErrnoWithFilenameObject`, mas o nome do ficheiro é fornecido como uma string C. *filename* é descodificado a partir do :term:`codificação do sistema de ficheiros e tratador de erros`.

source: This is a convenience function to raise :exc:`OSError`. If called with *ierr* of ``0``, the error code returned by a call to :c:func:`!GetLastError` is used instead. It calls the Win32 function :c:func:`!FormatMessage` to retrieve the Windows description of error code given by *ierr* or :c:func:`!GetLastError`, then it constructs a :exc:`OSError` object with the :attr:`~OSError.winerror` attribute set to the error code, the :attr:`~OSError.strerror` attribute set to the corresponding error message (gotten from :c:func:`!FormatMessage`), and then calls ``PyErr_SetObject(PyExc_OSError, object)``. This function always returns ``NULL``.
pt_pt: Esta é uma função conveniente para levantar :exc:`OSError`. Se chamada com *ierr* de ``0``, o código de erro retornado por uma chamada para :c:func:`!GetLastError` é usado em vez disso. Ela chama a função Win32 :c:func:`!FormatMessage` para recuperar a descrição do Windows do código de erro fornecido por *ierr* ou :c:func:`!GetLastError`, depois constrói um objeto :exc:`OSError` com o atributo :attr:`~OSError.winerror` definido para o código de erro, o atributo :attr:`~OSError.strerror` definido para a mensagem de erro correspondente (obtida de :c:func:`!FormatMessage`) e, em seguida, chama ``PyErr_SetObject(PyExc_OSError, object)``. Esta função sempre retorna ``NULL``.

source: Availability
pt_pt: Disponibilidade

source: Similar to :c:func:`PyErr_SetFromWindowsErr`, with an additional parameter specifying the exception type to be raised.
pt_pt: Semelhante a :c:func:`PyErr_SetFromWindowsErr`, com um parâmetro adicional que especifica o tipo de exceção a ser levantada.

source: Similar to :c:func:`PyErr_SetFromWindowsErr`, with the additional behavior that if *filename* is not ``NULL``, it is decoded from the filesystem encoding (:func:`os.fsdecode`) and passed to the constructor of :exc:`OSError` as a third parameter to be used to define the :attr:`!filename` attribute of the exception instance.
pt_pt: Semelhante a :c:func:`PyErr_SetFromWindowsErr`, com o comportamento adicional de que, se *filename* não for ``NULL``, ele é descodificado a partir da codificação do sistema de ficheiros (:func:`os.fsdecode`) e passado para o construtor de :exc:`OSError` como um terceiro parâmetro a ser usado para definir o atributo :attr:`!filename` da instância da exceção.

source: Similar to :c:func:`PyErr_SetExcFromWindowsErr`, with the additional behavior that if *filename* is not ``NULL``, it is passed to the constructor of :exc:`OSError` as a third parameter to be used to define the :attr:`!filename` attribute of the exception instance.
pt_pt: Semelhante a :c:func:`PyErr_SetExcFromWindowsErr`, com o comportamento adicional de que, se *filename* não for ``NULL``, ele é passado para o construtor de :exc:`OSError` como um terceiro parâmetro a ser usado para definir o atributo :attr:`!filename` da instância da exceção.

source: Similar to :c:func:`PyErr_SetExcFromWindowsErrWithFilenameObject`, but accepts a second filename object.
pt_pt: Semelhante a :c:func:`PyErr_SetExcFromWindowsErrWithFilenameObject`, mas aceita um segundo objeto de nome de ficheiro.

source: Similar to :c:func:`PyErr_SetFromWindowsErrWithFilename`, with an additional parameter specifying the exception type to be raised.
pt_pt: Similar à :c:func:`PyErr_SetFromWindowsErrWithFilename`, com um parâmetro adicional especificando o tipo de exceção a ser levantado.

source: This is a convenience function to raise :exc:`ImportError`. *msg* will be set as the exception's message string. *name* and *path*, both of which can be ``NULL``, will be set as the :exc:`ImportError`'s respective ``name`` and ``path`` attributes.
pt_pt: Esta é uma função conveniente para levantar :exc:`ImportError`. *msg* será definido como a string de mensagem da exceção. *name* e *path*, ambos os quais podem ser ``NULL``, serão definidos como os respectivos atributos ``name`` e ``path`` do :exc:`ImportError`.

source: Much like :c:func:`PyErr_SetImportError` but this function allows for specifying a subclass of :exc:`ImportError` to raise.
pt_pt: Muito parecido com :c:func:`PyErr_SetImportError` mas a função permite especificar uma subclasse de :exc:`ImportError` para levantar uma exceção.

source: Set file, line, and offset information for the current exception. If the current exception is not a :exc:`SyntaxError`, then it sets additional attributes, which make the exception printing subsystem think the exception is a :exc:`SyntaxError`.
pt_pt: Define informações de ficheiro, linha e deslocamento para a exceção atual. Se a exceção atual não for um :exc:`SyntaxError`, então define atributos adicionais, que fazem com que o subsistema de impressão de exceções pense que a exceção é um :exc:`SyntaxError`.

source: Like :c:func:`PyErr_SyntaxLocationObject`, but *filename* is a byte string decoded from the :term:`filesystem encoding and error handler`.
pt_pt: Como :c:func:`PyErr_SyntaxLocationObject`, mas *filename* é uma bytestring descodificada a partir do :term:`codificação do sistema de ficheiros e tratador de erros`.

source: Like :c:func:`PyErr_SyntaxLocationEx`, but the *col_offset* parameter is omitted.
pt_pt: Como :c:func:`PyErr_SyntaxLocationEx`, mas o parâmetro *col_offset* é omitido.

source: This is a shorthand for ``PyErr_SetString(PyExc_SystemError, message)``, where *message* indicates that an internal operation (e.g. a Python/C API function) was invoked with an illegal argument. It is mostly for internal use.
pt_pt: Esta é uma abreviação para ``PyErr_SetString(PyExc_SystemError, message)``, onde *mensagem* indica que uma operação interna (por exemplo, uma função API C/Python) foi invocada com um argumento ilegal. É principalmente para uso interno.

source: Issuing warnings
pt_pt: Emitir avisos

source: Use these functions to issue warnings from C code. They mirror similar functions exported by the Python :mod:`warnings` module. They normally print a warning message to *sys.stderr*; however, it is also possible that the user has specified that warnings are to be turned into errors, and in that case they will raise an exception. It is also possible that the functions raise an exception because of a problem with the warning machinery. The return value is ``0`` if no exception is raised, or ``-1`` if an exception is raised. (It is not possible to determine whether a warning message is actually printed, nor what the reason is for the exception; this is intentional.) If an exception is raised, the caller should do its normal exception handling (for example, :c:func:`Py_DECREF` owned references and return an error value).
pt_pt: Use estas funções para emitir avisos a partir do código C. Elas refletem funções semelhantes exportadas pelo módulo Python :mod:`warnings`. Normalmente, elas imprimem uma mensagem de aviso em *sys.stderr*; no entanto, também é possível que o utilizador tenha especificado que os avisos devem ser transformados em erros e, nesse caso, elas irão levantar uma exceção. Também é possível que as funções levantem uma exceção devido a um problema com o mecanismo de aviso. O valor de retorno é ``0`` se nenhuma exceção for levantada, ou ``-1`` se uma exceção for levantada. (Não é possível determinar se uma mensagem de aviso é realmente impressa, nem qual é a razão para a exceção; isso é intencional.) Se uma exceção for levantada, o chamador deve fazer o seu tratamento normal de exceções (por exemplo, referências próprias de :c:func:`Py_DECREF` e retornar um valor de erro).

source: Issue a warning message. The *category* argument is a warning category (see below) or ``NULL``; the *message* argument is a UTF-8 encoded string. *stack_level* is a positive number giving a number of stack frames; the warning will be issued from the currently executing line of code in that stack frame. A *stack_level* of 1 is the function calling :c:func:`PyErr_WarnEx`, 2 is the function above that, and so forth.
pt_pt: Emite uma mensagem de aviso. O argumento *category* é uma categoria de aviso (ver abaixo) ou ``NULL``; o argumento *message* é uma string codificada em UTF-8. *stack_level* é um número positivo que indica o número de frames da pilha; o aviso será emitido a partir da linha de código atualmente em execução nesse frame da pilha. Um *stack_level* de 1 é a função de chamada :c:func:`PyErr_WarnEx`, 2 é a função acima dessa e assim por diante.

source: Warning categories must be subclasses of :c:data:`PyExc_Warning`; :c:data:`PyExc_Warning` is a subclass of :c:data:`PyExc_Exception`; the default warning category is :c:data:`PyExc_RuntimeWarning`. The standard Python warning categories are available as global variables whose names are enumerated at :ref:`standardwarningcategories`.
pt_pt: As categorias de aviso devem ser subclasses de :c:data:`PyExc_Warning`; :c:data:`PyExc_Warning` é uma subclasse de :c:data:`PyExc_Exception`; a categoria de aviso padrão é :c:data:`PyExc_RuntimeWarning`. As categorias de aviso padrão do Python estão disponíveis como variáveis globais cujos nomes estão enumerados em :ref:`standardwarningcategories`.
