Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/exceptions.po
Languages: pt_pt

source: Return non-zero if *ob* is an exception class, zero otherwise. This function always succeeds.
pt_pt: Retorna um valor diferente de zero se *ob* for uma classe de exceção, zero caso contrário. Esta função é sempre bem-sucedida.

source: Return :c:member:`~PyTypeObject.tp_name` of the exception class *ob*.
pt_pt: Retornar :c:member:`~PyTypeObject.tp_name` da classe de exceção *ob*.

source: Exception Objects
pt_pt: Objetos de exceção

source: Return the traceback associated with the exception as a new reference, as accessible from Python through the :attr:`~BaseException.__traceback__` attribute. If there is no traceback associated, this returns ``NULL``.
pt_pt: Retorna o traceback associado à exceção como uma nova referência, acessível a partir do Python através do atributo :attr:`~BaseException.__traceback__`. Se não houver nenhum traceback associado, isso retorna ``NULL``.

source: Set the traceback associated with the exception to *tb*. Use ``Py_None`` to clear it.
pt_pt: Defina o traceback associado à exceção como *tb*. Use ``Py_None`` para limpá-lo.

source: Return the context (another exception instance during whose handling *ex* was raised) associated with the exception as a new reference, as accessible from Python through the :attr:`~BaseException.__context__` attribute. If there is no context associated, this returns ``NULL``.
pt_pt: Retorna o contexto (outra instância de exceção durante cujo tratamento *ex* foi levantada) associado à exceção como uma nova referência, acessível a partir do Python através do atributo :attr:`~BaseException.__context__`. Se não houver nenhum contexto associado, isto retorna ``NULL``.

source: Set the context associated with the exception to *ctx*. Use ``NULL`` to clear it. There is no type check to make sure that *ctx* is an exception instance. This steals a reference to *ctx*.
pt_pt: Defina o contexto associado à exceção para *ctx*. Use ``NULL`` para limpá-lo. Não há verificação de tipo para garantir que *ctx* seja uma instância de exceção. Isso rouba uma referência para *ctx*.

source: Return the cause (either an exception instance, or ``None``, set by ``raise ... from ...``) associated with the exception as a new reference, as accessible from Python through the :attr:`~BaseException.__cause__` attribute.
pt_pt: Retorna a causa (uma instância de exceção ou ``None``, definida por ``raise ... from ...``) associada à exceção como uma nova referência, acessível a partir do Python através do atributo :attr:`~BaseException.__cause__`.

source: Set the cause associated with the exception to *cause*. Use ``NULL`` to clear it. There is no type check to make sure that *cause* is either an exception instance or ``None``. This steals a reference to *cause*.
pt_pt: Defina a causa associada à exceção como *cause*. Use ``NULL`` para limpá-la. Não há verificação de tipo para garantir que *cause* seja uma instância de exceção ou ``None``. Isso rouba uma referência para *cause*.

source: The :attr:`~BaseException.__suppress_context__` attribute is implicitly set to ``True`` by this function.
pt_pt: O atributo :attr:`~BaseException.__suppress_context__` é implicitamente definido como ``True`` por esta função.

source: Return :attr:`~BaseException.args` of exception *ex*.
pt_pt: Retornar :attr:`~BaseException.args` da exceção *ex*.

source: Set :attr:`~BaseException.args` of exception *ex* to *args*.
pt_pt: Defina :attr:`~BaseException.args` da exceção *ex* para *args*.

source: Implement part of the interpreter's implementation of :keyword:`!except*`. *orig* is the original exception that was caught, and *excs* is the list of the exceptions that need to be raised. This list contains the unhandled part of *orig*, if any, as well as the exceptions that were raised from the :keyword:`!except*` clauses (so they have a different traceback from *orig*) and those that were reraised (and have the same traceback as *orig*). Return the :exc:`ExceptionGroup` that needs to be reraised in the end, or ``None`` if there is nothing to reraise.
pt_pt: Implementar parte da implementação do interpretador de :keyword:`!except*`. *orig* é a exceção original que foi capturada e *excs* é a lista das exceções que precisam ser levantadas. Esta lista contém a parte não tratada de *orig*, se houver, bem como as exceções que foram levantadas a partir das cláusulas :keyword:`!except*` (por isso têm um traceback diferente de *orig*) e aquelas que foram levantadas novamente (e têm o mesmo traceback que *orig*). Retorne o :exc:`ExceptionGroup` que precisa ser levantado novamente no final, ou ``None`` se não houver nada para levantar novamente.

source: Unicode Exception Objects
pt_pt: Objetos de exceção Unicode

source: The following functions are used to create and modify Unicode exceptions from C.
pt_pt: As seguintes funções são usadas para criar e modificar exceções Unicode de C.

source: Create a :class:`UnicodeDecodeError` object with the attributes *encoding*, *object*, *length*, *start*, *end* and *reason*. *encoding* and *reason* are UTF-8 encoded strings.
pt_pt: Crie um objeto :class:`UnicodeDecodeError` com os atributos *encoding*, *object*, *length*, *start*, *end* e *reason*. *encoding* e *reason* são strings codificadas em UTF-8.

source: Return the *encoding* attribute of the given exception object.
pt_pt: Retorna o atributo * encoding* dado no objeto da exceção.

source: Return the *object* attribute of the given exception object.
pt_pt: Retorna o atributo *object* dado no objeto da exceção.

source: Get the *start* attribute of the given exception object and place it into *\*start*. *start* must not be ``NULL``. Return ``0`` on success, ``-1`` on failure.
pt_pt: Obtém o atributo *start* do objeto da exceção coloca-o em *\*start*. *start* não deve ser ``NULL``. Retorna ``0`` se não der erro, ``-1`` caso dê erro.

source: If the :attr:`UnicodeError.object` is an empty sequence, the resulting *start* is ``0``. Otherwise, it is clipped to ``[0, len(object) - 1]``.
pt_pt: Se o :attr:`UnicodeError.object` for uma sequência vazia, o *start* resultante será ``0``. Caso contrário, será recortado para ``[0, len(object) - 1]``.

source: Set the *start* attribute of the given exception object to *start*. Return ``0`` on success, ``-1`` on failure.
pt_pt: Defina o atributo *start* do objeto de exceção fornecido como *start*. Retorne ``0`` em caso de sucesso e ``-1`` em caso de falha.

source: While passing a negative *start* does not raise an exception, the corresponding getters will not consider it as a relative offset.
pt_pt: Embora passar um *start* negativo não levanta uma exceção, os getters correspondentes não o considerarão como um deslocamento relativo.

source: Get the *end* attribute of the given exception object and place it into *\*end*. *end* must not be ``NULL``. Return ``0`` on success, ``-1`` on failure.
pt_pt: Obtenha o atributo *end* dado no objeto de exceção e coloque *\*end*. O *end* não deve ser ``NULL``. Em caso de sucesso, retorna ``0``, em caso de falha, retorna ``-1``.

source: If the :attr:`UnicodeError.object` is an empty sequence, the resulting *end* is ``0``. Otherwise, it is clipped to ``[1, len(object)]``.
pt_pt: Se o :attr:`UnicodeError.object` for uma sequência vazia, o *resultado final* será ``0``. Caso contrário, será cortado para ``[1, len(object)]``.

source: Set the *end* attribute of the given exception object to *end*. Return ``0`` on success, ``-1`` on failure.
pt_pt: Defina o atributo *end* do objeto de exceção fornecido como *end*. Retorne ``0`` em caso de sucesso e ``-1`` em caso de falha.

source: Return the *reason* attribute of the given exception object.
pt_pt: Retorna o atributo *reason* dado no objeto da exceção.

source: Set the *reason* attribute of the given exception object to *reason*. Return ``0`` on success, ``-1`` on failure.
pt_pt: Defina o atributo *reason* do objeto de exceção fornecido como *reason*. Retorne ``0`` em caso de sucesso e ``-1`` em caso de falha.

source: Recursion Control
pt_pt: Controlo de recursão

source: These two functions provide a way to perform safe recursive calls at the C level, both in the core and in extension modules. They are needed if the recursive code does not necessarily invoke Python code (which tracks its recursion depth automatically). They are also not needed for *tp_call* implementations because the :ref:`call protocol <call>` takes care of recursion handling.
pt_pt: Essas duas funções fornecem uma maneira de realizar chamadas recursivas seguras no nível C, tanto no núcleo quanto nos módulos de extensão. Elas são necessárias se o código recursivo não invocar necessariamente o código Python (que rastreia sua profundidade de recursão automaticamente). Elas também não são necessárias para implementações *tp_call*, porque o :ref:`protocolo de chamada <call>` cuida do tratamento da recursão.

source: Marks a point where a recursive C-level call is about to be performed.
pt_pt: Marca um ponto em que a chamada recursiva em nível C está prestes a ser executada.

source: The function then checks if the stack limit is reached. If this is the case, a :exc:`RecursionError` is set and a nonzero value is returned. Otherwise, zero is returned.
pt_pt: A função verifica então se o limite da pilha foi atingido. Se for esse o caso, um :exc:`RecursionError` é definido e um valor diferente de zero é retornado. Caso contrário, zero é retornado.

source: *where* should be a UTF-8 encoded string such as ``" in instance check"`` to be concatenated to the :exc:`RecursionError` message caused by the recursion depth limit.
pt_pt: *onde* deve ser uma string codificada em UTF-8, como ``" in instance check"``, a ser concatenada à mensagem :exc:`RecursionError` causada pelo limite de profundidade de recursão.

source: This function is now also available in the :ref:`limited API <limited-c-api>`.
pt_pt: Esta função agora também está disponível na :ref:`API limitada <limited-c-api>`.

source: Ends a :c:func:`Py_EnterRecursiveCall`. Must be called once for each *successful* invocation of :c:func:`Py_EnterRecursiveCall`.
pt_pt: Encerra uma :c:func:`Py_EnterRecursiveCall`. Deve ser chamada uma vez para cada invocação *bem-sucedida* de :c:func:`Py_EnterRecursiveCall`.

source: Properly implementing :c:member:`~PyTypeObject.tp_repr` for container types requires special recursion handling. In addition to protecting the stack, :c:member:`~PyTypeObject.tp_repr` also needs to track objects to prevent cycles. The following two functions facilitate this functionality. Effectively, these are the C equivalent to :func:`reprlib.recursive_repr`.
pt_pt: A implementação adequada de :c:member:`~PyTypeObject.tp_repr` para tipos de contentores requer um tratamento especial de recursão. Além de proteger a pilha, :c:member:`~PyTypeObject.tp_repr` também precisa rastrear objetos para evitar ciclos. As duas funções a seguir facilitam essa funcionalidade. Efetivamente, elas são o equivalente em C para :func:`reprlib.recursive_repr`.

source: Called at the beginning of the :c:member:`~PyTypeObject.tp_repr` implementation to detect cycles.
pt_pt: Chamado no início da implementação :c:member:`~PyTypeObject.tp_repr` para detectar ciclos.

source: If the object has already been processed, the function returns a positive integer. In that case the :c:member:`~PyTypeObject.tp_repr` implementation should return a string object indicating a cycle. As examples, :class:`dict` objects return ``{...}`` and :class:`list` objects return ``[...]``.
pt_pt: Se o objeto já tiver sido processado, a função retorna um inteiro positivo. Nesse caso, a implementação :c:member:`~PyTypeObject.tp_repr` deve retornar um objeto string indicando um ciclo. Como exemplos, objetos :class:`dict` retornam ``{...}`` e objetos :class:`list` retornam ``[...]``.

source: The function will return a negative integer if the recursion limit is reached. In that case the :c:member:`~PyTypeObject.tp_repr` implementation should typically return ``NULL``.
pt_pt: A função retornará um inteiro negativo se o limite da recursão for atingido. Nesse caso a implementação :c:member:`~PyTypeObject.tp_repr` deverá, normalmente,. retornar ``NULL``.

source: Otherwise, the function returns zero and the :c:member:`~PyTypeObject.tp_repr` implementation can continue normally.
pt_pt: Caso contrário, a função retorna zero e a implementação :c:member:`~PyTypeObject.tp_repr` poderá continuar normalmente.

source: Ends a :c:func:`Py_ReprEnter`. Must be called once for each invocation of :c:func:`Py_ReprEnter` that returns zero.
pt_pt: Termina a :c:func:`Py_ReprEnter`. Deve ser chamado uma vez para cada chamada de :c:func:`Py_ReprEnter` que retorna zero.

source: Exception and warning types
pt_pt: Tipos de exceção e aviso

source: All standard Python exceptions and warning categories are available as global variables whose names are ``PyExc_`` followed by the Python exception name. These have the type :c:expr:`PyObject*`; they are all class objects.
pt_pt: Todas as exceções padrão do Python e categorias de aviso estão disponíveis como variáveis globais cujos nomes são ``PyExc_`` seguidos pelo nome da exceção do Python. Estas têm o tipo :c:expr:`PyObject*`; são todas objetos de classe.

source: For completeness, here are all the variables:
pt_pt: Para completar, aqui estão todas as variáveis:

source: Exception types
pt_pt: Tipos de exceção

source: C name
pt_pt: Nome C

source: Python name
pt_pt: Nome Python

source: :c:data:`PyExc_BlockingIOError`, :c:data:`PyExc_BrokenPipeError`, :c:data:`PyExc_ChildProcessError`, :c:data:`PyExc_ConnectionError`, :c:data:`PyExc_ConnectionAbortedError`, :c:data:`PyExc_ConnectionRefusedError`, :c:data:`PyExc_ConnectionResetError`, :c:data:`PyExc_FileExistsError`, :c:data:`PyExc_FileNotFoundError`, :c:data:`PyExc_InterruptedError`, :c:data:`PyExc_IsADirectoryError`, :c:data:`PyExc_NotADirectoryError`, :c:data:`PyExc_PermissionError`, :c:data:`PyExc_ProcessLookupError` and :c:data:`PyExc_TimeoutError` were introduced following :pep:`3151`.
pt_pt: :c:data:`PyExc_BlockingIOError`, :c:data:`PyExc_BrokenPipeError`, :c:data:`PyExc_ChildProcessError`, :c:data:`PyExc_ConnectionError`, :c:data:`PyExc_ConnectionAbortedError`, :c:data:`PyExc_ConnectionRefusedError`, :c:data:`PyExc_ConnectionResetError`, :c:data:`PyExc_FileExistsError`, :c:data:`PyExc_FileNotFoundError`, :c:data:`PyExc_InterruptedError`, :c:data:`PyExc_IsADirectoryError`, :c:data:`PyExc_NotADirectoryError`, :c:data:`PyExc_PermissionError`, :c:data:`PyExc_ProcessLookupError` e :c:data:`PyExc_TimeoutError` foram introduzidos após :pep:`3151`.

source: :c:data:`PyExc_StopAsyncIteration` and :c:data:`PyExc_RecursionError`.
pt_pt: :c:data:`PyExc_StopAsyncIteration` e :c:data:`PyExc_RecursionError`.

source: OSError aliases
pt_pt: Aliases OSError

source: The following are a compatibility aliases to :c:data:`PyExc_OSError`.
pt_pt: A seguir estão os aliases de compatibilidade para :c:data:`PyExc_OSError`.

source: These aliases used to be separate exception types.
pt_pt: Esses aliases costumavam ser tipos de exceção separados.

source: Notes
pt_pt: Notas

source: Notes:
pt_pt: Notas:

source: :c:var:`!PyExc_WindowsError` is only defined on Windows; protect code that uses this by testing that the preprocessor macro ``MS_WINDOWS`` is defined.
pt_pt: :c:var:`!PyExc_WindowsError` só está definido no Windows; proteja o código que usa isso testando se a macro do pré-processador ``MS_WINDOWS`` está definida.

source: Warning types
pt_pt: Tipos de aviso

source: strerror (C function)
pt_pt: strerror (função C)

source: module
pt_pt: módulo

source: signal
pt_pt: sinal

source: SIGINT (C macro)
pt_pt: SIGINT (macro C)

source: KeyboardInterrupt (built-in exception)
pt_pt: KeyboardInterrupt (exceção embutida)
