Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/exceptions.po
Languages: pt_pt

source: For information about warning control, see the documentation for the :mod:`warnings` module and the :option:`-W` option in the command line documentation. There is no C API for warning control.
pt_pt: Para obter informações sobre o controlo de avisos, consulte a documentação do módulo :mod:`warnings` e a opção :option:`-W` na documentação da linha de comando. Não existe uma API C para o controlo de avisos.

source: Issue a warning message with explicit control over all warning attributes. This is a straightforward wrapper around the Python function :func:`warnings.warn_explicit`; see there for more information. The *module* and *registry* arguments may be set to ``NULL`` to get the default effect described there.
pt_pt: Emite uma mensagem de aviso com controlo explícito sobre todos os atributos de aviso. Trata-se de um invólucro simples em torno da função Python :func:`warnings.warn_explicit`; consulte-a para obter mais informações. Os argumentos *module* e *registry* podem ser definidos como ``NULL`` para obter o efeito padrão descrito nessa função.

source: Similar to :c:func:`PyErr_WarnExplicitObject` except that *message* and *module* are UTF-8 encoded strings, and *filename* is decoded from the :term:`filesystem encoding and error handler`.
pt_pt: Semelhante a :c:func:`PyErr_WarnExplicitObject` exceto que *message* e *module* são strings codificadas em UTF-8 e *filename* é descodificado a partir do :term:`codificação do sistema de ficheiros e tratador de erros`.

source: Function similar to :c:func:`PyErr_WarnEx`, but use :c:func:`PyUnicode_FromFormat` to format the warning message. *format* is an ASCII-encoded string.
pt_pt: Função semelhante a :c:func:`PyErr_WarnEx`, mas usa :c:func:`PyUnicode_FromFormat` para formatar a mensagem de aviso. *format* é uma string codificada em ASCII.

source: Function similar to :c:func:`PyErr_WarnFormat`, but *category* is :exc:`ResourceWarning` and it passes *source* to :class:`!warnings.WarningMessage`.
pt_pt: Função semelhante a :c:func:`PyErr_WarnFormat`, mas *categoria* é :exc:`ResourceWarning` e passa *fonte* para :class:`!warnings.WarningMessage`.

source: Querying the error indicator
pt_pt: Consultando o indicador de erro

source: Test whether the error indicator is set. If set, return the exception *type* (the first argument to the last call to one of the ``PyErr_Set*`` functions or to :c:func:`PyErr_Restore`). If not set, return ``NULL``. You do not own a reference to the return value, so you do not need to :c:func:`Py_DECREF` it.
pt_pt: Teste se o indicador de erro está definido. Se estiver, retorne o *tipo* de exceção (o primeiro argumento da última chamada para uma das funções ``PyErr_Set*`` ou para :c:func:`PyErr_Restore`). Se não estiver definido, retorna ``NULL`` . Você não possui uma referência ao valor de retorno, portanto, não precisa de o :c:func:`Py_DECREF`.

source: The caller must have an :term:`attached thread state`.
pt_pt: O chamador deve ter um :term:`estado de thread anexado`.

source: Do not compare the return value to a specific exception; use :c:func:`PyErr_ExceptionMatches` instead, shown below. (The comparison could easily fail since the exception may be an instance instead of a class, in the case of a class exception, or it may be a subclass of the expected exception.)
pt_pt: Não compare o valor de retorno com uma exceção específica; use, em vez disso, :c:func:`PyErr_ExceptionMatches` mostrado abaixo. (A comparação pode falhar facilmente, pois a exceção pode ser uma instância em vez de uma classe, no caso de uma exceção de classe, ou pode ser uma subclasse da exceção esperada.)

source: Equivalent to ``PyErr_GivenExceptionMatches(PyErr_Occurred(), exc)``. This should only be called when an exception is actually set; a memory access violation will occur if no exception has been raised.
pt_pt: Equivalente a ``PyErr_GivenExceptionMatches(PyErr_Occurred(), exc)``. Isto só deve ser chamado quando uma exceção for realmente definida; ocorrerá uma violação de acesso à memória se nenhuma exceção tiver sido levantada.

source: Return true if the *given* exception matches the exception type in *exc*. If *exc* is a class object, this also returns true when *given* is an instance of a subclass. If *exc* is a tuple, all exception types in the tuple (and recursively in subtuples) are searched for a match.
pt_pt: Retorna verdadeiro se a exceção *given* corresponder ao tipo de exceção em *exc*. Se *exc* for um objeto de classe, isso também retornará verdadeiro quando *given* for uma instância de uma subclasse. Se *exc* for uma tupla, todos os tipos de exceção na tupla (e recursivamente nas subtupas) serão pesquisados para encontrar uma correspondência.

source: Return the exception currently being raised, clearing the error indicator at the same time. Return ``NULL`` if the error indicator is not set.
pt_pt: Retorne a exceção que está a ser levantada, limpando o indicador de erro ao mesmo tempo. Retorne ``NULL`` se o indicador de erro não estiver definido.

source: This function is used by code that needs to catch exceptions, or code that needs to save and restore the error indicator temporarily.
pt_pt: Esta função é utilizada por código que precisa capturar exceções ou código que precisa guardar e restaurar temporariamente o indicador de erro.

source: For example::
pt_pt: Por exemplo::

source: { PyObject *exc = PyErr_GetRaisedException(); /* ... code that might produce other errors ... */ PyErr_SetRaisedException(exc); }
pt_pt: { PyObject *exc = PyErr_GetRaisedException(); /* ... código que pode produzir outros erros... */ PyErr_SetRaisedException(exc); }

source: :c:func:`PyErr_GetHandledException`, to save the exception currently being handled.
pt_pt: :c:func:`PyErr_GetHandledException`, para guardar a exceção que está a ser tratada no momento.

source: Set *exc* as the exception currently being raised, clearing the existing exception if one is set.
pt_pt: Defina *exc* como a exceção atualmente levantada, limpando a exceção existente, se houver alguma definida.

source: This call steals a reference to *exc*, which must be a valid exception.
pt_pt: Esta chamada rouba uma referência a *exc*, que deve ser uma exceção válida.

source: Use :c:func:`PyErr_GetRaisedException` instead.
pt_pt: Use :c:func:`PyErr_GetRaisedException` em vez disso.

source: Retrieve the error indicator into three variables whose addresses are passed. If the error indicator is not set, set all three variables to ``NULL``. If it is set, it will be cleared and you own a reference to each object retrieved. The value and traceback object may be ``NULL`` even when the type object is not.
pt_pt: Recupere o indicador de erro em três variáveis cujos endereços são passados. Se o indicador de erro não estiver definido, defina todas as três variáveis como ``NULL``. Se estiver definido, ele será limpo e você terá uma referência para cada objeto recuperado. O valor e o objeto de traceback podem ser ``NULL`` mesmo quando o objeto de tipo não é.

source: This function is normally only used by legacy code that needs to catch exceptions or save and restore the error indicator temporarily.
pt_pt: Esta função é normalmente utilizada apenas por código legado que precisa capturar exceções ou salvar e restaurar temporariamente o indicador de erro.

source: { PyObject *type, *value, *traceback; PyErr_Fetch(&type, &value, &traceback); /* ... code that might produce other errors ... */ PyErr_Restore(type, value, traceback); }
pt_pt: { PyObject *type, *value, *traceback; PyErr_Fetch(&type, &value, &traceback); /* ... código que pode produzir outros erros ... */ PyErr_Restore(type, value, traceback); }

source: Use :c:func:`PyErr_SetRaisedException` instead.
pt_pt: Use :c:func:`PyErr_SetRaisedException` em vez disso.

source: Set the error indicator from the three objects, *type*, *value*, and *traceback*, clearing the existing exception if one is set. If the objects are ``NULL``, the error indicator is cleared. Do not pass a ``NULL`` type and non-``NULL`` value or traceback. The exception type should be a class. Do not pass an invalid exception type or value. (Violating these rules will cause subtle problems later.) This call takes away a reference to each object: you must own a reference to each object before the call and after the call you no longer own these references. (If you don't understand this, don't use this function. I warned you.)
pt_pt: Defina o indicador de erro a partir dos três objetos, *type*, *value* e *traceback*, limpando a exceção existente, se houver. Se os objetos forem ``NULL``, o indicador de erro é limpo. Não passe um type ``NULL`` e um valor não ``NULL`` ou traceback. O tipo de exceção deve ser uma classe. Não passe um tipo ou valor de exceção inválido. (Violar essas regras causará problemas sutis mais tarde.) Esta chamada retira uma referência a cada objeto: deve possuir uma referência a cada objeto antes da chamada e, após a chamada, já não possui essas referências. (Se não compreender isto, não utilize esta função. Eu avisei-o.)

source: This function is normally only used by legacy code that needs to save and restore the error indicator temporarily. Use :c:func:`PyErr_Fetch` to save the current error indicator.
pt_pt: Esta função é normalmente utilizada apenas por código legado que precisa de guardar e restaurar temporariamente o indicador de erro. Utilize :c:func:`PyErr_Fetch` para guardar o indicador de erro atual.

source: Use :c:func:`PyErr_GetRaisedException` instead, to avoid any possible de-normalization.
pt_pt: Use :c:func:`PyErr_GetRaisedException` em vez disso, para evitar qualquer possível desnormalização.

source: Under certain circumstances, the values returned by :c:func:`PyErr_Fetch` below can be "unnormalized", meaning that ``*exc`` is a class object but ``*val`` is not an instance of the same class. This function can be used to instantiate the class in that case. If the values are already normalized, nothing happens. The delayed normalization is implemented to improve performance.
pt_pt: Em determinadas circunstâncias, os valores retornados por :c:func:`PyErr_Fetch` abaixo podem ser «não normalizados», o que significa que ``*exc`` é um objeto de classe, mas ``*val`` não é uma instância da mesma classe. Esta função pode ser usada para instanciar a classe nesse caso. Se os valores já estiverem normalizados, nada acontece. A normalização atrasada é implementada para melhorar o desempenho.

source: This function *does not* implicitly set the :attr:`~BaseException.__traceback__` attribute on the exception value. If setting the traceback appropriately is desired, the following additional snippet is needed::
pt_pt: Esta função *não* define implicitamente o atributo :attr:`~BaseException.__traceback__` no valor da exceção. Se desejar definir o traceback adequadamente, é necessário o seguinte trecho adicional:

source: Retrieve the active exception instance, as would be returned by :func:`sys.exception`. This refers to an exception that was *already caught*, not to an exception that was freshly raised. Returns a new reference to the exception or ``NULL``. Does not modify the interpreter's exception state.
pt_pt: Recupera a instância de exceção ativa, tal como seria devolvida por :func:`sys.exception`. Isto refere-se a uma exceção que já foi capturada, não a uma exceção que foi levantada recentemente. Devolve uma nova referência à exceção ou ``NULL``. Não modifica o estado de exceção do interpretador.

source: This function is not normally used by code that wants to handle exceptions. Rather, it can be used when code needs to save and restore the exception state temporarily. Use :c:func:`PyErr_SetHandledException` to restore or clear the exception state.
pt_pt: Esta função não é normalmente utilizada por código que pretende tratar exceções. Em vez disso, pode ser utilizada quando o código precisa de guardar e restaurar temporariamente o estado da exceção. Utilize :c:func:`PyErr_SetHandledException` para restaurar ou limpar o estado da exceção.

source: Set the active exception, as known from ``sys.exception()``. This refers to an exception that was *already caught*, not to an exception that was freshly raised. To clear the exception state, pass ``NULL``.
pt_pt: Defina a exceção ativa, conforme conhecido em ``sys.exception()``. Isso se refere a uma exceção que já foi capturada, não a uma exceção que foi levantada recentemente. Para limpar o estado da exceção, passe ``NULL``.

source: This function is not normally used by code that wants to handle exceptions. Rather, it can be used when code needs to save and restore the exception state temporarily. Use :c:func:`PyErr_GetHandledException` to get the exception state.
pt_pt: Esta função não é normalmente utilizada por código que pretende tratar exceções. Em vez disso, pode ser utilizada quando o código precisa de guardar e restaurar temporariamente o estado da exceção. Utilize :c:func:`PyErr_GetHandledException` para obter o estado da exceção.

source: Retrieve the old-style representation of the exception info, as known from :func:`sys.exc_info`. This refers to an exception that was *already caught*, not to an exception that was freshly raised. Returns new references for the three objects, any of which may be ``NULL``. Does not modify the exception info state. This function is kept for backwards compatibility. Prefer using :c:func:`PyErr_GetHandledException`.
pt_pt: Recupera a representação antiga das informações da exceção, conforme conhecido em :func:`sys.exc_info`. Isso se refere a uma exceção que já foi capturada, não a uma exceção que foi levantada recentemente. Retorna novas referências para os três objetos, qualquer um dos quais pode ser ``NULL``. Não modifica o estado das informações da exceção. Esta função é mantida para compatibilidade com versões anteriores. Prefira usar :c:func:`PyErr_GetHandledException`.

source: This function is not normally used by code that wants to handle exceptions. Rather, it can be used when code needs to save and restore the exception state temporarily. Use :c:func:`PyErr_SetExcInfo` to restore or clear the exception state.
pt_pt: Esta função não é normalmente utilizada por código que pretende tratar exceções. Em vez disso, pode ser utilizada quando o código precisa de guardar e restaurar temporariamente o estado da exceção. Utilize :c:func:`PyErr_SetExcInfo` para restaurar ou limpar o estado da exceção.

source: Set the exception info, as known from ``sys.exc_info()``. This refers to an exception that was *already caught*, not to an exception that was freshly raised. This function steals the references of the arguments. To clear the exception state, pass ``NULL`` for all three arguments. This function is kept for backwards compatibility. Prefer using :c:func:`PyErr_SetHandledException`.
pt_pt: Defina as informações da exceção, conforme conhecido em ``sys.exc_info()``. Isso se refere a uma exceção que já foi capturada, não a uma exceção que foi levantada recentemente. Esta função rouba as referências dos argumentos. Para limpar o estado da exceção, passe ``NULL`` para todos os três argumentos. Esta função é mantida para compatibilidade com versões anteriores. Prefira usar :c:func:`PyErr_SetHandledException`.

source: This function is not normally used by code that wants to handle exceptions. Rather, it can be used when code needs to save and restore the exception state temporarily. Use :c:func:`PyErr_GetExcInfo` to read the exception state.
pt_pt: Esta função não é normalmente utilizada por código que pretende tratar exceções. Em vez disso, pode ser utilizada quando o código precisa de guardar e restaurar temporariamente o estado da exceção. Utilize :c:func:`PyErr_GetExcInfo` para ler o estado da exceção.

source: The ``type`` and ``traceback`` arguments are no longer used and can be NULL. The interpreter now derives them from the exception instance (the ``value`` argument). The function still steals references of all three arguments.
pt_pt: Os argumentos ``type`` e ``traceback`` não são mais usados e podem ser NULL. O interpretador agora os deriva da instância da exceção (o argumento ``value``). A função ainda rouba referências de todos os três argumentos.

source: Signal Handling
pt_pt: Tratamento de sinal

source: This function interacts with Python's signal handling.
pt_pt: Essa função interage com o manipulador de sinais do Python.

source: If the function is called from the main thread and under the main Python interpreter, it checks whether a signal has been sent to the processes and if so, invokes the corresponding signal handler. If the :mod:`signal` module is supported, this can invoke a signal handler written in Python.
pt_pt: Se a função for chamada a partir do thread principal e sob o interpretador Python principal, ela verifica se um sinal foi enviado aos processos e, em caso afirmativo, invoca o manipulador de sinal correspondente. Se o módulo :mod:`signal` for suportado, isso pode invocar um manipulador de sinal escrito em Python.

source: The function attempts to handle all pending signals, and then returns ``0``. However, if a Python signal handler raises an exception, the error indicator is set and the function returns ``-1`` immediately (such that other pending signals may not have been handled yet: they will be on the next :c:func:`PyErr_CheckSignals()` invocation).
pt_pt: A função tenta lidar com todos os sinais pendentes e, em seguida, retorna ``0``. No entanto, se um manipulador de sinais Python levantar uma exceção, o indicador de erro é definido e a função retorna ``-1`` imediatamente (de modo que outros sinais pendentes podem ainda não ter sido tratados: eles serão tratados na próxima invocação de :c:func:`PyErr_CheckSignals()`).

source: If the function is called from a non-main thread, or under a non-main Python interpreter, it does nothing and returns ``0``.
pt_pt: Se a função for chamada a partir de um thread não principal ou sob um interpretador Python não principal, ela não fará nada e retornará ``0``.

source: This function can be called by long-running C code that wants to be interruptible by user requests (such as by pressing Ctrl-C).
pt_pt: Esta função pode ser chamada por código C de longa execução que deseja ser interrompido por solicitações do utilizador (como ao pressionar Ctrl-C).

source: The default Python signal handler for :c:macro:`!SIGINT` raises the :exc:`KeyboardInterrupt` exception.
pt_pt: O manipulador de sinal padrão do Python para :c:macro:`!SIGINT` levanta a exceção :exc:`KeyboardInterrupt`.

source: Simulate the effect of a :c:macro:`!SIGINT` signal arriving. This is equivalent to ``PyErr_SetInterruptEx(SIGINT)``.
pt_pt: Simule o efeito de um sinal :c:macro:`!SIGINT` a chegar. Isto é equivalente a ``PyErr_SetInterruptEx(SIGINT)``.

source: This function is async-signal-safe. It can be called without an :term:`attached thread state` and from a C signal handler.
pt_pt: Esta função é segura para sinais assíncronos. Pode ser chamada sem um :term:`estado de thread anexado` e a partir de um manipulador de sinais C.

source: Simulate the effect of a signal arriving. The next time :c:func:`PyErr_CheckSignals` is called, the Python signal handler for the given signal number will be called.
pt_pt: Simule o efeito da chegada de um sinal. Na próxima vez que :c:func:`PyErr_CheckSignals` for chamado, o manipulador de sinais Python para o número de sinal fornecido será chamado.

source: This function can be called by C code that sets up its own signal handling and wants Python signal handlers to be invoked as expected when an interruption is requested (for example when the user presses Ctrl-C to interrupt an operation).
pt_pt: Esta função pode ser chamada por código C que configura o seu próprio tratamento de sinais e deseja que os tratadores de sinais Python sejam invocados conforme o esperado quando uma interrupção é solicitada (por exemplo, quando o utilizador pressiona Ctrl-C para interromper uma operação).

source: If the given signal isn't handled by Python (it was set to :py:const:`signal.SIG_DFL` or :py:const:`signal.SIG_IGN`), it will be ignored.
pt_pt: Se o sinal fornecido não for tratado pelo Python (foi definido como :py:const:`signal.SIG_DFL` ou :py:const:`signal.SIG_IGN`), ele será ignorado.

source: If *signum* is outside of the allowed range of signal numbers, ``-1`` is returned. Otherwise, ``0`` is returned. The error indicator is never changed by this function.
pt_pt: Se *signum* estiver fora do intervalo permitido de números de sinal, ``-1`` é retornado. Caso contrário, ``0`` é retornado. O indicador de erro nunca é alterado por esta função.

source: This utility function specifies a file descriptor to which the signal number is written as a single byte whenever a signal is received. *fd* must be non-blocking. It returns the previous such file descriptor.
pt_pt: Esta função utilitária especifica um descritor de ficheiro no qual o número do sinal é gravado como um único byte sempre que um sinal é recebido. *fd* deve ser não bloqueante. Ela retorna o descritor de ficheiro anterior.

source: The value ``-1`` disables the feature; this is the initial state. This is equivalent to :func:`signal.set_wakeup_fd` in Python, but without any error checking. *fd* should be a valid file descriptor. The function should only be called from the main thread.
pt_pt: O valor ``-1`` desabilita o recurso; este é o estado inicial. Isso é equivalente à :func:`signal.set_wakeup_fd` em Python, mas sem nenhuma verificação de erro. *fd* deve ser um descritor de ficheiro válido. A função só deve ser chamada a partir da thread principal.

source: On Windows, the function now also supports socket handles.
pt_pt: No Windows, a função agora também suporta manipuladores de socket.

source: Exception Classes
pt_pt: Classes de exceção

source: This utility function creates and returns a new exception class. The *name* argument must be the name of the new exception, a C string of the form ``module.classname``. The *base* and *dict* arguments are normally ``NULL``. This creates a class object derived from :exc:`Exception` (accessible in C as :c:data:`PyExc_Exception`).
pt_pt: Esta função utilitária cria e retorna uma nova classe de exceção. O argumento *name* deve ser o nome da nova exceção, uma string C no formato ``module.classname``. Os argumentos *base* e *dict* são normalmente ``NULL``. Isso cria um objeto de classe derivado de :exc:`Exception`(acessível em C como :c:data:`PyExc_Exception`).

source: The :attr:`~type.__module__` attribute of the new class is set to the first part (up to the last dot) of the *name* argument, and the class name is set to the last part (after the last dot). The *base* argument can be used to specify alternate base classes; it can either be only one class or a tuple of classes. The *dict* argument can be used to specify a dictionary of class variables and methods.
pt_pt: O atributo :attr:`~type.__module__` da nova classe é definido como a primeira parte (até o último ponto) do argumento *name*, e o nome da classe é definido como a última parte (após o último ponto). O argumento *base* pode ser usado para especificar classes base alternativas; pode ser apenas uma classe ou uma tupla de classes. O argumento *dict* pode ser usado para especificar um dicionário de variáveis e métodos da classe.

source: Same as :c:func:`PyErr_NewException`, except that the new exception class can easily be given a docstring: If *doc* is non-``NULL``, it will be used as the docstring for the exception class.
pt_pt: O mesmo que :c:func:`PyErr_NewException`, exceto que a nova classe exceção pode facilmente receber um docstring: Se *doc* não for ``NULL``, será utilizado como docstring para a classe exceção.
