Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/init_config.po
Languages: pt_pt

source: Python Initialization Configuration
pt_pt: Configuração de inicialização do Python

source: PyInitConfig C API
pt_pt: PyInitConfig API C

source: Python can be initialized with :c:func:`Py_InitializeFromInitConfig`.
pt_pt: O Python pode ser inicializado com :c:func:`Py_InitializeFromInitConfig`.

source: The :c:func:`Py_RunMain` function can be used to write a customized Python program.
pt_pt: A função :c:func:`Py_RunMain` pode ser usada para escrever um programa Python personalizado.

source: See also :ref:`Initialization, Finalization, and Threads <initialization>`.
pt_pt: Veja também: ref:`Inicialização, Finalização e Threads <initialization>`.

source: :pep:`741` "Python Configuration C API".
pt_pt: :pep:`741` «API C de configuração Python».

source: Example
pt_pt: Exemplo

source: Example of customized Python always running with the :ref:`Python Development Mode <devmode>` enabled; return ``-1`` on error:
pt_pt: Exemplo de Python personalizado sempre em execução com o :ref:`Modo de Desenvolvimento Python <devmode>` ativado; retorna ``-1`` em caso de erro:

source: int init_python(void) { PyInitConfig *config = PyInitConfig_Create(); if (config == NULL) { printf("PYTHON INIT ERROR: memory allocation failed\n"); return -1; } // Enable the Python Development Mode if (PyInitConfig_SetInt(config, "dev_mode", 1) < 0) { goto error; } // Initialize Python with the configuration if (Py_InitializeFromInitConfig(config) < 0) { goto error; } PyInitConfig_Free(config); return 0; error: { // Display the error message. // // This uncommon braces style is used, because you cannot make // goto targets point to variable declarations. const char *err_msg; (void)PyInitConfig_GetError(config, &err_msg); printf("PYTHON INIT ERROR: %s\n", err_msg); PyInitConfig_Free(config); return -1; } }
pt_pt: int init_python(void) { PyInitConfig *config = PyInitConfig_Create(); if (config == NULL) { printf("ERRO DE INICIALIZAÇÃO DO PYTHON: falha na alocação de memória\n"); return -1; } // Ativar o modo de desenvolvimento Python if (PyInitConfig_SetInt(config, "dev_mode", 1) < 0) { goto error; } // Inicialize o Python com a configuração if (Py_InitializeFromInitConfig(config) < 0) { goto error; } PyInitConfig_Free(config); return 0; error: { // Exibir a mensagem de erro. // // Este estilo incomum de chavetas é usado porque não é possível fazer // Os destinos goto apontam para declarações de variáveis. const char *err_msg; (void)PyInitConfig_GetError(config, &err_msg); printf("PYTHON INIT ERROR: %s\n", err_msg); PyInitConfig_Free(config); return -1; } }

source: Create Config
pt_pt: Criar Config

source: Opaque structure to configure the Python initialization.
pt_pt: Estrutura opaca para configurar a inicialização do Python.

source: Create a new initialization configuration using :ref:`Isolated Configuration <init-isolated-conf>` default values.
pt_pt: Crie uma nova configuração de inicialização usando os valores padrão da :ref:`Configuração Isolada <init-isolated-conf>`.

source: It must be freed by :c:func:`PyInitConfig_Free`.
pt_pt: Deve ser libertado por :c:func:`PyInitConfig_Free`.

source: Return ``NULL`` on memory allocation failure.
pt_pt: Retorne ``NULL`` em caso de falha na alocação de memória.

source: Free memory of the initialization configuration *config*.
pt_pt: Memória livre da configuração de inicialização *config*.

source: If *config* is ``NULL``, no operation is performed.
pt_pt: Se *config* for ``NULL``, nenhuma operação será realizada.

source: Error Handling
pt_pt: Tratamento de erros

source: Get the *config* error message.
pt_pt: Recebe a mensagem de erro *config*.

source: Set *\*err_msg* and return ``1`` if an error is set.
pt_pt: Defina *\*err_msg* e retorne ``1`` se um erro for definido.

source: Set *\*err_msg* to ``NULL`` and return ``0`` otherwise.
pt_pt: Defina *\*err_msg* como ``NULL`` e retorne ``0`` caso contrário.

source: If *config* has an exit code, format the exit code as an error message.
pt_pt: Se *config* tiver um código de saída, formate o código de saída como uma mensagem de erro.

source: The error message remains valid until another ``PyInitConfig`` function is called with *config*. The caller doesn't have to free the error message.
pt_pt: A mensagem de erro permanece válida até que outra função ``PyInitConfig`` seja chamada com *config*. O chamador não precisa liberar a mensagem de erro.

source: Get the *config* exit code.
pt_pt: Obter o código de saída *config*.

source: Set *\*exitcode* and return ``1`` if *config* has an exit code set.
pt_pt: Defina *\*exitcode* e retorne ``1`` se *config* tiver um código de saída definido.

source: Return ``0`` if *config* has no exit code set.
pt_pt: Retorne ``0`` se *config* não tiver nenhum código de saída definido.

source: Only the ``Py_InitializeFromInitConfig()`` function can set an exit code if the ``parse_argv`` option is non-zero.
pt_pt: Apenas a função ``Py_InitializeFromInitConfig()`` pode definir um código de saída se a opção ``parse_argv`` for diferente de zero.

source: An exit code can be set when parsing the command line failed (exit code ``2``) or when a command line option asks to display the command line help (exit code ``0``).
pt_pt: Um código de saída pode ser definido quando a análise da linha de comando falhar (código de saída ``2``) ou quando uma opção da linha de comando solicitar a exibição da ajuda da linha de comando (código de saída ``0``).

source: Get Options
pt_pt: Obter opções

source: The configuration option *name* parameter must be a non-NULL null-terminated UTF-8 encoded string. See :ref:`Configuration Options <pyinitconfig-opts>`.
pt_pt: A opção de configuração parâmetro *name* deve ser uma string codificada em UTF-8, terminada em NULL e diferente de NULL. Consulte :ref:`Opções de configuração <pyinitconfig-opts>`.

source: Test if the configuration has an option called *name*.
pt_pt: Teste se a configuração tem uma opção chamada *name*.

source: Return ``1`` if the option exists, or return ``0`` otherwise.
pt_pt: Retorne ``1`` se a opção existir, ou retorne ``0`` caso contrário.

source: Get an integer configuration option.
pt_pt: Obter uma opção de configuração inteira.

source: Set *\*value*, and return ``0`` on success.
pt_pt: Defina *\*valor* e retorne ``0`` em caso de sucesso.

source: Set an error in *config* and return ``-1`` on error.
pt_pt: Defina um erro em *config* e retorne ``-1`` em caso de erro.

source: Get a string configuration option as a null-terminated UTF-8 encoded string.
pt_pt: Obtenha uma opção de configuração de string como uma string codificada em UTF-8 terminada em nulo.

source: *\*value* can be set to ``NULL`` if the option is an optional string and the option is unset.
pt_pt: *\*valor* pode ser definido como ``NULL`` se a opção for uma string opcional e a opção não estiver definida.

source: On success, the string must be released with ``free(value)`` if it's not ``NULL``.
pt_pt: Em caso de sucesso, a string deve ser libertada com ``free(value)`` se não for ``NULL``.

source: Get a string list configuration option as an array of null-terminated UTF-8 encoded strings.
pt_pt: Obtenha uma opção de configuração de lista de cadeias como uma matriz de cadeias codificadas em UTF-8 terminadas em null.

source: Set *\*length* and *\*value*, and return ``0`` on success.
pt_pt: Defina *\*length* e *\*value* e retorne ``0`` em caso de sucesso.

source: On success, the string list must be released with ``PyInitConfig_FreeStrList(length, items)``.
pt_pt: Em caso de sucesso, a lista de cadeias deve ser libertada com ``PyInitConfig_FreeStrList(length, items)``.

source: Free memory of a string list created by ``PyInitConfig_GetStrList()``.
pt_pt: Liberar memória de uma lista de strings criada por ``PyInitConfig_GetStrList()``.

source: Set Options
pt_pt: Definir opções

source: Some configuration options have side effects on other options. This logic is only implemented when ``Py_InitializeFromInitConfig()`` is called, not by the "Set" functions below. For example, setting ``dev_mode`` to ``1`` does not set ``faulthandler`` to ``1``.
pt_pt: Algumas opções de configuração têm efeitos colaterais em outras opções. Essa lógica só é implementada quando ``Py_InitializeFromInitConfig()`` é chamado, não pelas funções "Set" abaixo. Por exemplo, definir ``dev_mode`` como ``1`` não define ``faulthandler`` como ``1``.

source: Set an integer configuration option.
pt_pt: Defina uma opção de configuração inteira.

source: Return ``0`` on success.
pt_pt: Retorne ``0`` em caso de sucesso.

source: Set a string configuration option from a null-terminated UTF-8 encoded string. The string is copied.
pt_pt: Defina uma opção de configuração de cadeia a partir de uma cadeia codificada em UTF-8 terminada em nulo. A cadeia é copiada.

source: Set a string list configuration option from an array of null-terminated UTF-8 encoded strings. The string list is copied.
pt_pt: Defina uma opção de configuração da lista de cadeias a partir de uma matriz de cadeias codificadas em UTF-8 terminadas em nulo. A lista de cadeias é copiada.

source: Module
pt_pt: Módulo

source: Add a built-in extension module to the table of built-in modules.
pt_pt: Adicione um módulo de extensão integrado à tabela de módulos integrados.

source: The new module can be imported by the name *name*, and uses the function *initfunc* as the initialization function called on the first attempted import.
pt_pt: O novo módulo pode ser importado pelo nome *name* e usa a função *initfunc* como a função de inicialização chamada na primeira tentativa de importação.

source: If Python is initialized multiple times, ``PyInitConfig_AddModule()`` must be called at each Python initialization.
pt_pt: Se o Python for inicializado várias vezes, ``PyInitConfig_AddModule()`` deve ser chamado em cada inicialização do Python.

source: Similar to the :c:func:`PyImport_AppendInittab` function.
pt_pt: Semelhante à função :c:func:`PyImport_AppendInittab`.

source: Initialize Python
pt_pt: Inicializar Python

source: Initialize Python from the initialization configuration.
pt_pt: Inicialize o Python a partir da configuração de inicialização.

source: Set an exit code in *config* and return ``-1`` if Python wants to exit.
pt_pt: Defina um código de saída em *config* e retorne ``-1`` se o Python quiser sair.

source: See ``PyInitConfig_GetExitcode()`` for the exit code case.
pt_pt: Consulte ``PyInitConfig_GetExitcode()`` para o caso do código de saída.

source: Configuration Options
pt_pt: Opções de configuração

source: Option
pt_pt: Opção

source: PyConfig/PyPreConfig member
pt_pt: Membro PyConfig/PyPreConfig

source: Type
pt_pt: Tipo

source: Visibility
pt_pt: Visibilidade

source: :c:member:`allocator <PyPreConfig.allocator>`
pt_pt: :c:membro:`alocador <PyPreConfig.allocator>`

source: Read-only
pt_pt: Somente leitura

source: Public
pt_pt: Público

source: Visibility:
pt_pt: Visibilidade:

source: Public: Can by get by :c:func:`PyConfig_Get` and set by :c:func:`PyConfig_Set`.
pt_pt: Público: Pode ser obtido por :c:func:`PyConfig_Get` e definido por :c:func:`PyConfig_Set`.

source: Read-only: Can by get by :c:func:`PyConfig_Get`, but cannot be set by :c:func:`PyConfig_Set`.
pt_pt: Somente leitura: Pode ser obtido por :c:func:`PyConfig_Get`, mas não pode ser definido por :c:func:`PyConfig_Set`.

source: Runtime Python configuration API
pt_pt: API de configuração Python em tempo de execução

source: At runtime, it's possible to get and set configuration options using :c:func:`PyConfig_Get` and :c:func:`PyConfig_Set` functions.
pt_pt: Em tempo de execução, é possível obter e definir opções de configuração usando as funções :c:func:`PyConfig_Get` e :c:func:`PyConfig_Set`.

source: Some options are read from the :mod:`sys` attributes. For example, the option ``"argv"`` is read from :data:`sys.argv`.
pt_pt: Algumas opções são lidas a partir dos atributos :mod:`sys`. Por exemplo, a opção ``"argv"`` é lida a partir de :data:`sys.argv`.

source: Get the current runtime value of a configuration option as a Python object.
pt_pt: Obter o valor de tempo de execução atual de uma opção de configuração como um objeto Python.

source: Return a new reference on success.
pt_pt: Retorna uma nova referência em caso de sucesso.

source: Set an exception and return ``NULL`` on error.
pt_pt: Define uma exceção e retorna ``NULL`` em caso de erro.

source: The object type depends on the configuration option. It can be:
pt_pt: O tipo de objeto depende da opção de configuração. Pode ser:

source: The caller must have an :term:`attached thread state`. The function cannot be called before Python initialization nor after Python finalization.
pt_pt: O chamador deve ter um :term:`estado de thread anexado`. A função não pode ser chamada antes da inicialização do Python nem após a finalização do Python.

source: Similar to :c:func:`PyConfig_Get`, but get the value as a C int.
pt_pt: Semelhante a :c:func:`PyConfig_Get`, mas obtém o valor como um inteiro C.

source: Set an exception and return ``-1`` on error.
pt_pt: Defina uma exceção e retorne ``-1`` em caso de erro.

source: Get all configuration option names as a ``frozenset``.
pt_pt: Obter todos os nomes das opções de configuração como um ``frozenset``.

source: Set the current runtime value of a configuration option.
pt_pt: Defina o valor de tempo de execução atual de uma opção de configuração.

source: Raise a :exc:`ValueError` if there is no option *name*.
pt_pt: Levante um :exc:`ValueError` se não houver a opção *name*.

source: Raise a :exc:`ValueError` if *value* is an invalid value.
pt_pt: Levante um :exc:`ValueError` se *valor* for um valor inválido.

source: Raise a :exc:`ValueError` if the option is read-only (cannot be set).
pt_pt: Levante um :exc:`ValueError` se a opção for somente leitura (não pode ser definida).

source: Raise a :exc:`TypeError` if *value* has not the proper type.
pt_pt: Levante um :exc:`TypeError` se *valor* não tiver o tipo adequado.

source: Raises an :ref:`auditing event <auditing>` ``cpython.PyConfig_Set`` with arguments ``name``, ``value``.
pt_pt: Gera um :ref:`evento de auditoria <auditing>` ``cpython.PyConfig_Set`` com os argumentos ``name``, ``value``.

source: PyConfig C API
pt_pt: API C do PyConfig

source: Python can be initialized with :c:func:`Py_InitializeFromConfig` and the :c:type:`PyConfig` structure. It can be preinitialized with :c:func:`Py_PreInitialize` and the :c:type:`PyPreConfig` structure.
pt_pt: O Python pode ser inicializado com :c:func:`Py_InitializeFromConfig` e a estrutura :c:type:`PyConfig`. Ele pode ser pré-inicializado com :c:func:`Py_PreInitialize` e a estrutura :c:type:`PyPreConfig`.

source: There are two kinds of configuration:
pt_pt: Existem dois tipos de configuração:

source: The :ref:`Python Configuration <init-python-config>` can be used to build a customized Python which behaves as the regular Python. For example, environment variables and command line arguments are used to configure Python.
pt_pt: A :ref:`Configuração Python <init-python-config>` pode ser usada para criar um Python personalizado que se comporta como o Python normal. Por exemplo, variáveis de ambiente e argumentos de linha de comando são usados para configurar o Python.

source: The :ref:`Isolated Configuration <init-isolated-conf>` can be used to embed Python into an application. It isolates Python from the system. For example, environment variables are ignored, the LC_CTYPE locale is left unchanged and no signal handler is registered.
pt_pt: A :ref:`Configuração Isolada <init-isolated-conf>` pode ser usada para incorporar Python numa aplicação. Ela isola o Python do sistema. Por exemplo, as variáveis de ambiente são ignoradas, a localidade LC_CTYPE permanece inalterada e nenhum manipulador de sinal é registado.

source: :pep:`587` "Python Initialization Configuration".
pt_pt: :pep:`587` "Configuração da inicialização do Python".

source: Example of customized Python always running in isolated mode::
pt_pt: Exemplo de Python personalizado sempre a funcionar em modo isolado::

source: int main(int argc, char **argv) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); config.isolated = 1; /* Decode command line arguments. Implicitly preinitialize Python (in isolated mode). */ status = PyConfig_SetBytesArgv(&config, argc, argv); if (PyStatus_Exception(status)) { goto exception; } status = Py_InitializeFromConfig(&config); if (PyStatus_Exception(status)) { goto exception; } PyConfig_Clear(&config); return Py_RunMain(); exception: PyConfig_Clear(&config); if (PyStatus_IsExit(status)) { return status.exitcode; } /* Display the error message and exit the process with non-zero exit code */ Py_ExitStatusException(status); }
pt_pt: int main(int argc, char **argv) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); config.isolated = 1; /* Descodificar argumentos da linha de comando. Pré-inicializar implicitamente o Python (em modo isolado). */ status = PyConfig_SetBytesArgv(&config, argc, argv); if (PyStatus_Exception(status)) { goto exception; } status = Py_InitializeFromConfig(&config); if (PyStatus_Exception(status)) { goto exception; } PyConfig_Clear(&config); return Py_RunMain(); exception: PyConfig_Clear(&config); if (PyStatus_IsExit(status)) { return status.exitcode; } /* Exiba a mensagem de erro e saia do processo com código de saída diferente de zero */ Py_ExitStatusException(status); }

source: List of ``wchar_t*`` strings.
pt_pt: Lista de strings ``wchar_t*``.

source: If *length* is non-zero, *items* must be non-``NULL`` and all strings must be non-``NULL``.
pt_pt: Se *length* for diferente de zero, *items* deve ser diferente de ``NULL`` e todas as cadeias de caracteres devem ser diferentes de ``NULL``.

source: Methods:
pt_pt: Métodos:

source: Append *item* to *list*.
pt_pt: Anexa *item* a *list*.

source: Python must be preinitialized to call this function.
pt_pt: O Python deve ser pré-inicializado para chamar esta função.

source: Insert *item* into *list* at *index*.
pt_pt: Insira *item* na *lista* no *índice*.

source: If *index* is greater than or equal to *list* length, append *item* to *list*.
pt_pt: Se *índice* for maior ou igual ao comprimento da *lista*, acrescente *item* à *lista*.

source: *index* must be greater than or equal to ``0``.
pt_pt: *index* deve ser maior que ou igual a ``0``.

source: Structure fields:
pt_pt: Campos da estrutura:

source: List length.
pt_pt: Comprimento da lista.

source: List items.
pt_pt: Itens da lista.

source: Structure to store an initialization function status: success, error or exit.
pt_pt: Estrutura para armazenar o estado de uma função de inicialização: sucesso, erro ou saída.

source: For an error, it can store the C function name which created the error.
pt_pt: Para um erro, pode armazenar o nome da função C que criou o erro.

source: Exit code. Argument passed to ``exit()``.
pt_pt: Código de saída. Argumento passado para ``exit()``.

source: Error message.
pt_pt: Mensagem de erro.

source: Name of the function which created an error, can be ``NULL``.
pt_pt: O nome da função que criou um erro pode ser ``NULL``.

source: Functions to create a status:
pt_pt: Funções para criar um estado:

source: Success.
pt_pt: Sucesso.

source: Initialization error with a message.
pt_pt: Erro de inicialização com uma mensagem.

source: *err_msg* must not be ``NULL``.
pt_pt: *err_msg* não pode ser ``NULL``.

source: Memory allocation failure (out of memory).
pt_pt: Falha na alocação de memória (memória insuficiente).

source: Exit Python with the specified exit code.
pt_pt: Saia do Python com o código de saída especificado.

source: Functions to handle a status:
pt_pt: Funções para lidar com um estado:

source: Is the status an error or an exit? If true, the exception must be handled; by calling :c:func:`Py_ExitStatusException` for example.
pt_pt: O estado é um erro ou uma saída? Se for verdadeiro, a exceção deve ser tratada; chamando :c:func:`Py_ExitStatusException`, por exemplo.

source: Is the result an error?
pt_pt: O resultado é um erro?

source: Is the result an exit?
pt_pt: O resultado é uma saída?

source: Call ``exit(exitcode)`` if *status* is an exit. Print the error message and exit with a non-zero exit code if *status* is an error. Must only be called if ``PyStatus_Exception(status)`` is non-zero.
pt_pt: Chama ``exit(exitcode)`` se *status* for uma saída. Imprime a mensagem de erro e sai com um código de saída diferente de zero se *status* for um erro. Só deve ser chamado se ``PyStatus_Exception(status)`` for diferente de zero.

source: Internally, Python uses macros which set ``PyStatus.func``, whereas functions to create a status set ``func`` to ``NULL``.
pt_pt: Internamente, o Python usa macros que definem ``PyStatus.func``, enquanto as funções para criar um status definem ``func`` como ``NULL``.

source: Example::
pt_pt: Exemplo::

source: Structure used to preinitialize Python.
pt_pt: Estrutura utilizada para pré-inicializar o Python.

source: Function to initialize a preconfiguration:
pt_pt: Função para inicializar uma pré-configuração:

source: Initialize the preconfiguration with :ref:`Python Configuration <init-python-config>`.
pt_pt: Inicialize a pré-configuração com :ref:`Configuração Python <init-python-config>`.

source: Initialize the preconfiguration with :ref:`Isolated Configuration <init-isolated-conf>`.
pt_pt: Inicialize a pré-configuração com :ref:`Configuração Isolada <init-isolated-conf>`.

source: Name of the Python memory allocators:
pt_pt: Nome dos alocadores de memória Python:

source: ``PYMEM_ALLOCATOR_NOT_SET`` (``0``): don't change memory allocators (use defaults).
pt_pt: ``PYMEM_ALLOCATOR_NOT_SET`` (``0``): não alterar os alocadores de memória (usar os padrões).

source: ``PYMEM_ALLOCATOR_DEFAULT`` (``1``): :ref:`default memory allocators <default-memory-allocators>`.
pt_pt: ``PYMEM_ALLOCATOR_DEFAULT`` (``1``): :ref:`alocadores de memória padrão <default-memory-allocators>`.

source: ``PYMEM_ALLOCATOR_DEBUG`` (``2``): :ref:`default memory allocators <default-memory-allocators>` with :ref:`debug hooks <pymem-debug-hooks>`.
pt_pt: ``PYMEM_ALLOCATOR_DEBUG`` (``2``): :ref:`alocadores de memória padrão <default-memory-allocators>` com :ref:`ganchos de depuração <pymem-debug-hooks>`.

source: ``PYMEM_ALLOCATOR_MALLOC`` (``3``): use ``malloc()`` of the C library.
pt_pt: ``PYMEM_ALLOCATOR_MALLOC`` (``3``): usa ``malloc()`` da biblioteca C.

source: ``PYMEM_ALLOCATOR_MALLOC_DEBUG`` (``4``): force usage of ``malloc()`` with :ref:`debug hooks <pymem-debug-hooks>`.
pt_pt: ``PYMEM_ALLOCATOR_MALLOC_DEBUG`` (``4``): força a utilização de ``malloc()`` com :ref:`ganchos de depuração <pymem-debug-hooks>`.

source: ``PYMEM_ALLOCATOR_PYMALLOC`` (``5``): :ref:`Python pymalloc memory allocator <pymalloc>`.
pt_pt: ``PYMEM_ALLOCATOR_PYMALLOC`` (``5``): :ref:`Alocador de memória Python pymalloc <pymalloc>`.

source: ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` (``6``): :ref:`Python pymalloc memory allocator <pymalloc>` with :ref:`debug hooks <pymem-debug-hooks>`.
pt_pt: ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` (``6``): :ref:`Alocador de memória Python pymalloc <pymalloc>` com :ref:`ganchos de depuração <pymem-debug-hooks>`.

source: ``PYMEM_ALLOCATOR_MIMALLOC`` (``6``): use ``mimalloc``, a fast malloc replacement.
pt_pt: ``PYMEM_ALLOCATOR_MIMALLOC`` (``6``): usa ``mimalloc``, um substituto rápido para malloc.

source: ``PYMEM_ALLOCATOR_MIMALLOC_DEBUG`` (``7``): use ``mimalloc``, a fast malloc replacement with :ref:`debug hooks <pymem-debug-hooks>`.
pt_pt: ``PYMEM_ALLOCATOR_MIMALLOC_DEBUG`` (``7``): usa ``mimalloc``, um substituto rápido para malloc com :ref:`ganchos de depuração <pymem-debug-hooks>`.
