Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/init_config.po
Languages: pt_pt

source: ``PYMEM_ALLOCATOR_PYMALLOC`` and ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` are not supported if Python is :option:`configured using --without-pymalloc <--without-pymalloc>`.
pt_pt: ``PYMEM_ALLOCATOR_PYMALLOC`` e ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` não são suportados se o Python for :option:`configurado usando --without-pymalloc <--without-pymalloc>`.

source: ``PYMEM_ALLOCATOR_MIMALLOC`` and ``PYMEM_ALLOCATOR_MIMALLOC_DEBUG`` are not supported if Python is :option:`configured using --without-mimalloc <--without-mimalloc>` or if the underlying atomic support isn't available.
pt_pt: ``PYMEM_ALLOCATOR_MIMALLOC`` e ``PYMEM_ALLOCATOR_MIMALLOC_DEBUG`` não são suportados se o Python for :option:`configurado usando --without-mimalloc <--without-mimalloc>` ou se o suporte atómico subjacente não estiver disponível.

source: See :ref:`Memory Management <memory>`.
pt_pt: Ver :ref:`Gestão de Memória <memory>`.

source: Default: ``PYMEM_ALLOCATOR_NOT_SET``.
pt_pt: Padrão: ``PYMEM_ALLOCATOR_NOT_SET``.

source: Set the LC_CTYPE locale to the user preferred locale.
pt_pt: Defina a localidade LC_CTYPE para a localidade preferida do utilizador.

source: If equals to ``0``, set :c:member:`~PyPreConfig.coerce_c_locale` and :c:member:`~PyPreConfig.coerce_c_locale_warn` members to ``0``.
pt_pt: Se for igual a ``0``, defina os membros :c:member:`~PyPreConfig.coerce_c_locale` e :c:member:`~PyPreConfig.coerce_c_locale_warn` como ``0``.

source: See the :term:`locale encoding`.
pt_pt: Veja o :term:`codificação de localidade`.

source: Default: ``1`` in Python config, ``0`` in isolated config.
pt_pt: Padrão: ``1`` na configuração Python, ``0`` na configuração isolada.

source: If equals to ``2``, coerce the C locale.
pt_pt: Se for igual a ``2``, force a localidade C.

source: If equals to ``1``, read the LC_CTYPE locale to decide if it should be coerced.
pt_pt: Se for igual a ``1``, ler a localidade LC_CTYPE para decidir se deve ser coagido.

source: Default: ``-1`` in Python config, ``0`` in isolated config.
pt_pt: Padrão: ``-1`` na configuração Python, ``0`` na configuração isolada.

source: If non-zero, emit a warning if the C locale is coerced.
pt_pt: Se diferente de zero, emite um aviso se a localidade C for forçada.

source: :ref:`Python Development Mode <devmode>`: see :c:member:`PyConfig.dev_mode`.
pt_pt: :ref:`Modo de desenvolvimento Python <devmode>`: consulte :c:member:`PyConfig.dev_mode`.

source: Default: ``-1`` in Python mode, ``0`` in isolated mode.
pt_pt: Padrão: ``-1`` no modo Python, ``0`` no modo isolado.

source: Isolated mode: see :c:member:`PyConfig.isolated`.
pt_pt: Modo isolado: consulte :c:member:`PyConfig.isolated`.

source: Default: ``0`` in Python mode, ``1`` in isolated mode.
pt_pt: Padrão: ``0`` no modo Python, ``1`` no modo isolado.

source: If non-zero:
pt_pt: Se diferente de zero:

source: Set :c:member:`PyPreConfig.utf8_mode` to ``0``,
pt_pt: Defina :c:member:`PyPreConfig.utf8_mode` como ``0``,

source: Set :c:member:`PyConfig.filesystem_encoding` to ``"mbcs"``,
pt_pt: Defina :c:member:`PyConfig.filesystem_encoding` como ``"mbcs"``,

source: Set :c:member:`PyConfig.filesystem_errors` to ``"replace"``.
pt_pt: Defina :c:member:`PyConfig.filesystem_errors` como ``"replace"``.

source: Initialized from the :envvar:`PYTHONLEGACYWINDOWSFSENCODING` environment variable value.
pt_pt: Inicializado a partir do valor da variável de ambiente :envvar:`PYTHONLEGACYWINDOWSFSENCODING`.

source: Only available on Windows. ``#ifdef MS_WINDOWS`` macro can be used for Windows specific code.
pt_pt: Disponível apenas no Windows. A macro ``#ifdef MS_WINDOWS`` pode ser usada para código específico do Windows.

source: Default: ``0``.
pt_pt: Padrão: ``0``.

source: If non-zero, :c:func:`Py_PreInitializeFromArgs` and :c:func:`Py_PreInitializeFromBytesArgs` parse their ``argv`` argument the same way the regular Python parses command line arguments: see :ref:`Command Line Arguments <using-on-cmdline>`.
pt_pt: Se diferente de zero, :c:func:`Py_PreInitializeFromArgs` e :c:func:`Py_PreInitializeFromBytesArgs` analisam o seu argumento ``argv`` da mesma forma que o Python normal analisa os argumentos da linha de comando: consulte :ref:`Argumentos da linha de comando <using-on-cmdline>`.

source: Use :ref:`environment variables <using-on-envvars>`? See :c:member:`PyConfig.use_environment`.
pt_pt: Usar :ref:`variáveis de ambiente <using-on-envvars>`? Consulte :c:member:`PyConfig.use_environment`.

source: Default: ``1`` in Python config and ``0`` in isolated config.
pt_pt: Padrão: ``1`` na configuração Python e ``0`` na configuração isolada.

source: If non-zero, enable the :ref:`Python UTF-8 Mode <utf8-mode>`.
pt_pt: Se diferente de zero, ative o :ref:`Modo UTF-8 do Python <utf8-mode>`.

source: Set to ``0`` or ``1`` by the :option:`-X utf8 <-X>` command line option and the :envvar:`PYTHONUTF8` environment variable.
pt_pt: Defina como ``0`` ou ``1`` pela opção de linha de comando :option:`-X utf8 <-X>` e pela variável de ambiente :envvar:`PYTHONUTF8`.

source: Also set to ``1`` if the ``LC_CTYPE`` locale is ``C`` or ``POSIX``.
pt_pt: Também definido como ``1`` se a localidade ``LC_CTYPE`` for ``C`` ou ``POSIX``.

source: Default: ``-1`` in Python config and ``0`` in isolated config.
pt_pt: Padrão: ``-1`` na configuração Python e ``0`` na configuração isolada.

source: Preinitialize Python with PyPreConfig
pt_pt: Pré-inicialize o Python com PyPreConfig

source: The preinitialization of Python:
pt_pt: A pré-inicialização do Python:

source: Set the Python memory allocators (:c:member:`PyPreConfig.allocator`)
pt_pt: Defina os alocadores de memória Python (:c:member:`PyPreConfig.allocator`)

source: Configure the LC_CTYPE locale (:term:`locale encoding`)
pt_pt: Configure a localidade LC_CTYPE (:term:`codificação de localidade`)

source: Set the :ref:`Python UTF-8 Mode <utf8-mode>` (:c:member:`PyPreConfig.utf8_mode`)
pt_pt: Defina o :ref:`Modo UTF-8 do Python <utf8-mode>` (:c:member:`PyPreConfig.utf8_mode`)

source: The current preconfiguration (``PyPreConfig`` type) is stored in ``_PyRuntime.preconfig``.
pt_pt: A pré-configuração atual (tipo ``PyPreConfig``) é armazenada em ``_PyRuntime.preconfig``.

source: Functions to preinitialize Python:
pt_pt: Funções para pré-inicializar Python:

source: Preinitialize Python from *preconfig* preconfiguration.
pt_pt: Pré-inicialize o Python a partir da pré-configuração *preconfig*.

source: *preconfig* must not be ``NULL``.
pt_pt: *preconfig* não deve ser ``NULL``.

source: Parse *argv* command line arguments (bytes strings) if :c:member:`~PyPreConfig.parse_argv` of *preconfig* is non-zero.
pt_pt: Analisa os argumentos da linha de comando *argv* (cadeias de bytes) se :c:member:`~PyPreConfig.parse_argv` de *preconfig* for diferente de zero.

source: Parse *argv* command line arguments (wide strings) if :c:member:`~PyPreConfig.parse_argv` of *preconfig* is non-zero.
pt_pt: Analisa os argumentos da linha de comando *argv* (cadeias largas) se :c:member:`~PyPreConfig.parse_argv` de *preconfig* for diferente de zero.

source: The caller is responsible to handle exceptions (error or exit) using :c:func:`PyStatus_Exception` and :c:func:`Py_ExitStatusException`.
pt_pt: O chamador é responsável por lidar com exceções (erro ou saída) usando :c:func:`PyStatus_Exception` e :c:func:`Py_ExitStatusException`.

source: For :ref:`Python Configuration <init-python-config>` (:c:func:`PyPreConfig_InitPythonConfig`), if Python is initialized with command line arguments, the command line arguments must also be passed to preinitialize Python, since they have an effect on the pre-configuration like encodings. For example, the :option:`-X utf8 <-X>` command line option enables the :ref:`Python UTF-8 Mode <utf8-mode>`.
pt_pt: Para :ref:`Configuração Python <init-python-config>` (:c:func:`PyPreConfig_InitPythonConfig`), se o Python for inicializado com argumentos de linha de comando, os argumentos de linha de comando também devem ser passados para pré-inicializar o Python, uma vez que eles têm um efeito na pré-configuração, como codificações. Por exemplo, a opção de linha de comando :option:`-X utf8 <-X>` ativa o :ref:`Modo UTF-8 do Python <utf8-mode>`.

source: ``PyMem_SetAllocator()`` can be called after :c:func:`Py_PreInitialize` and before :c:func:`Py_InitializeFromConfig` to install a custom memory allocator. It can be called before :c:func:`Py_PreInitialize` if :c:member:`PyPreConfig.allocator` is set to ``PYMEM_ALLOCATOR_NOT_SET``.
pt_pt: ``PyMem_SetAllocator()`` pode ser chamado após :c:func:`Py_PreInitialize` e antes de :c:func:`Py_InitializeFromConfig` para instalar um alocador de memória personalizado. Pode ser chamado antes de :c:func:`Py_PreInitialize` se :c:member:`PyPreConfig.allocator` estiver definido como ``PYMEM_ALLOCATOR_NOT_SET``.

source: Python memory allocation functions like :c:func:`PyMem_RawMalloc` must not be used before the Python preinitialization, whereas calling directly ``malloc()`` and ``free()`` is always safe. :c:func:`Py_DecodeLocale` must not be called before the Python preinitialization.
pt_pt: Funções de alocação de memória Python como :c:func:`PyMem_RawMalloc` não devem ser usadas antes da pré-inicialização do Python, enquanto que chamar diretamente ``malloc()`` e ``free()`` é sempre seguro. :c:func:`Py_DecodeLocale` não deve ser chamado antes da pré-inicialização do Python.

source: Example using the preinitialization to enable the :ref:`Python UTF-8 Mode <utf8-mode>`::
pt_pt: Exemplo usando a pré-inicialização para ativar o :ref:`Modo UTF-8 do Python <utf8-mode>`::

source: PyStatus status; PyPreConfig preconfig; PyPreConfig_InitPythonConfig(&preconfig); preconfig.utf8_mode = 1; status = Py_PreInitialize(&preconfig); if (PyStatus_Exception(status)) { Py_ExitStatusException(status); } /* at this point, Python speaks UTF-8 */ Py_Initialize(); /* ... use Python API here ... */ Py_Finalize();
pt_pt: PyStatus status; PyPreConfig preconfig; PyPreConfig_InitPythonConfig(&preconfig); preconfig.utf8_mode = 1; status = Py_PreInitialize(&preconfig); if (PyStatus_Exception(status)) { Py_ExitStatusException(status); } /* neste ponto, o Python fala UTF-8 */ Py_Initialize(); /* ... use a API Python aqui ... */ Py_Finalize();

source: Structure containing most parameters to configure Python.
pt_pt: Estrutura contendo a maioria dos parâmetros para configurar o Python.

source: When done, the :c:func:`PyConfig_Clear` function must be used to release the configuration memory.
pt_pt: Quando terminar, a função :c:func:`PyConfig_Clear` deve ser usada para liberar a memória de configuração.

source: Structure methods:
pt_pt: Métodos de estrutura:

source: Initialize configuration with the :ref:`Python Configuration <init-python-config>`.
pt_pt: Inicialize a configuração com a :ref:`Configuração Python <init-python-config>`.

source: Initialize configuration with the :ref:`Isolated Configuration <init-isolated-conf>`.
pt_pt: Inicialize a configuração com a :ref:`Configuração Isolada <init-isolated-conf>`.

source: Copy the wide character string *str* into ``*config_str``.
pt_pt: Copie a cadeia de caracteres largos *str* para ``*config_str``.

source: :ref:`Preinitialize Python <c-preinit>` if needed.
pt_pt: :ref:`Pré-inicialize o Python <c-preinit>`, se necessário.

source: Decode *str* using :c:func:`Py_DecodeLocale` and set the result into ``*config_str``.
pt_pt: Descodifique *str* usando :c:func:`Py_DecodeLocale` e defina o resultado em ``*config_str``.

source: Set command line arguments (:c:member:`~PyConfig.argv` member of *config*) from the *argv* list of wide character strings.
pt_pt: Defina os argumentos da linha de comando (:c:member:`~PyConfig.argv` membro de *config*) a partir da lista *argv* de cadeias de caracteres largos.

source: Set command line arguments (:c:member:`~PyConfig.argv` member of *config*) from the *argv* list of bytes strings. Decode bytes using :c:func:`Py_DecodeLocale`.
pt_pt: Defina os argumentos da linha de comando (:c:member:`~PyConfig.argv` membro de *config*) a partir da lista *argv* de cadeias de bytes. Descodifique os bytes usando :c:func:`Py_DecodeLocale`.

source: Set the list of wide strings *list* to *length* and *items*.
pt_pt: Defina a lista de cadeias largas *list* para *length* e *items*.

source: Read all Python configuration.
pt_pt: Leia toda a configuração do Python.

source: Fields which are already initialized are left unchanged.
pt_pt: Os campos que já estão inicializados permanecem inalterados.

source: Fields for :ref:`path configuration <init-path-config>` are no longer calculated or modified when calling this function, as of Python 3.11.
pt_pt: Os campos para :ref:`configuração do caminho <init-path-config>` não são mais calculados ou modificados ao chamar esta função, a partir do Python 3.11.

source: The :c:func:`PyConfig_Read` function only parses :c:member:`PyConfig.argv` arguments once: :c:member:`PyConfig.parse_argv` is set to ``2`` after arguments are parsed. Since Python arguments are stripped from :c:member:`PyConfig.argv`, parsing arguments twice would parse the application options as Python options.
pt_pt: A função :c:func:`PyConfig_Read` analisa os argumentos :c:member:`PyConfig.argv` apenas uma vez: :c:member:`PyConfig.parse_argv` é definido como ``2`` após a análise dos argumentos. Como os argumentos Python são removidos de :c:member:`PyConfig.argv`, analisar os argumentos duas vezes analisaria as opções da aplicação como opções Python.

source: The :c:member:`PyConfig.argv` arguments are now only parsed once, :c:member:`PyConfig.parse_argv` is set to ``2`` after arguments are parsed, and arguments are only parsed if :c:member:`PyConfig.parse_argv` equals ``1``.
pt_pt: Os argumentos :c:member:`PyConfig.argv` agora são analisados apenas uma vez, :c:member:`PyConfig.parse_argv` é definido como ``2`` após a análise dos argumentos, e os argumentos só são analisados se :c:member:`PyConfig.parse_argv` for igual a ``1``.

source: :c:func:`PyConfig_Read` no longer calculates all paths, and so fields listed under :ref:`Python Path Configuration <init-path-config>` may no longer be updated until :c:func:`Py_InitializeFromConfig` is called.
pt_pt: :c:func:`PyConfig_Read` já não calcula todos os caminhos, pelo que os campos listados em :ref:`Configuração do caminho Python <init-path-config>` podem deixar de ser atualizados até que :c:func:`Py_InitializeFromConfig` seja chamado.

source: Release configuration memory.
pt_pt: Liberar memória de configuração.

source: Most ``PyConfig`` methods :ref:`preinitialize Python <c-preinit>` if needed. In that case, the Python preinitialization configuration (:c:type:`PyPreConfig`) in based on the :c:type:`PyConfig`. If configuration fields which are in common with :c:type:`PyPreConfig` are tuned, they must be set before calling a :c:type:`PyConfig` method:
pt_pt: A maioria dos métodos ``PyConfig`` :ref:`pré-inicializam o Python <c-preinit>`, se necessário. Nesse caso, a configuração de pré-inicialização do Python (:c:type:`PyPreConfig`) é baseada no :c:type:`PyConfig`. Se os campos de configuração que são comuns ao :c:type:`PyPreConfig` forem ajustados, eles devem ser definidos antes de chamar um método :c:type:`PyConfig`:

source: Moreover, if :c:func:`PyConfig_SetArgv` or :c:func:`PyConfig_SetBytesArgv` is used, this method must be called before other methods, since the preinitialization configuration depends on command line arguments (if :c:member:`~PyConfig.parse_argv` is non-zero).
pt_pt: Além disso, se :c:func:`PyConfig_SetArgv` ou :c:func:`PyConfig_SetBytesArgv` forem usados, este método deve ser chamado antes de outros métodos, uma vez que a configuração de pré-inicialização depende dos argumentos da linha de comando (se :c:member:`~PyConfig.parse_argv` for diferente de zero).

source: The caller of these methods is responsible to handle exceptions (error or exit) using ``PyStatus_Exception()`` and ``Py_ExitStatusException()``.
pt_pt: O chamador destes métodos é responsável por lidar com exceções (erro ou saída) usando ``PyStatus_Exception()`` e ``Py_ExitStatusException()``.

source: Set :data:`sys.argv` command line arguments based on :c:member:`~PyConfig.argv`. These parameters are similar to those passed to the program's :c:func:`main` function with the difference that the first entry should refer to the script file to be executed rather than the executable hosting the Python interpreter. If there isn't a script that will be run, the first entry in :c:member:`~PyConfig.argv` can be an empty string.
pt_pt: Defina os argumentos da linha de comando :data:`sys.argv` com base em :c:member:`~PyConfig.argv`. Esses parâmetros são semelhantes aos passados para a função :c:func:`main` do programa, com a diferença de que a primeira entrada deve referir-se ao ficheiro de script a ser executado, em vez do executável que hospeda o interpretador Python. Se não houver um script a ser executado, a primeira entrada em :c:member:`~PyConfig.argv` pode ser uma string vazia.

source: Set :c:member:`~PyConfig.parse_argv` to ``1`` to parse :c:member:`~PyConfig.argv` the same way the regular Python parses Python command line arguments and then to strip Python arguments from :c:member:`~PyConfig.argv`.
pt_pt: Defina :c:member:`~PyConfig.parse_argv` como ``1`` para analisar :c:member:`~PyConfig.argv` da mesma forma que o Python normal analisa os argumentos da linha de comando do Python e, em seguida, remova os argumentos do Python de :c:member:`~PyConfig.argv`.

source: If :c:member:`~PyConfig.argv` is empty, an empty string is added to ensure that :data:`sys.argv` always exists and is never empty.
pt_pt: Se :c:member:`~PyConfig.argv` estiver vazio, uma string vazia é adicionada para garantir que :data:`sys.argv` sempre exista e nunca esteja vazio.

source: Default: ``NULL``.
pt_pt: Padrão: ``NULL``.

source: See also the :c:member:`~PyConfig.orig_argv` member.
pt_pt: Veja também o membro :c:member:`~PyConfig.orig_argv`.

source: If equals to zero, ``Py_RunMain()`` prepends a potentially unsafe path to :data:`sys.path` at startup:
pt_pt: Se for igual a zero, ``Py_RunMain()`` acrescenta um caminho potencialmente inseguro a :data:`sys.path` no arranque:

source: If :c:member:`argv[0] <PyConfig.argv>` is equal to ``L"-m"`` (``python -m module``), prepend the current working directory.
pt_pt: Se :c:member:`argv[0] <PyConfig.argv>` for igual a ``L"-m"`` (``python -m module``), acrescente o diretório de trabalho atual.

source: If running a script (``python script.py``), prepend the script's directory. If it's a symbolic link, resolve symbolic links.
pt_pt: Se estiver a executar um script (``python script.py``), coloque o diretório do script no início. Se for um link simbólico, resolva os links simbólicos.

source: Otherwise (``python -c code`` and ``python``), prepend an empty string, which means the current working directory.
pt_pt: Caso contrário (``python -c code`` e ``python``), acrescente uma string vazia, que significa o diretório de trabalho atual.

source: Set to ``1`` by the :option:`-P` command line option and the :envvar:`PYTHONSAFEPATH` environment variable.
pt_pt: Definido como ``1`` pela opção de linha de comando :option:`-P` e pela variável de ambiente :envvar:`PYTHONSAFEPATH`.

source: Default: ``0`` in Python config, ``1`` in isolated config.
pt_pt: Padrão: ``0`` na configuração Python, ``1`` na configuração isolada.

source: Part of the :ref:`Python Path Configuration <init-path-config>` output.
pt_pt: Parte da saída :ref:`Configuração do caminho Python <init-path-config>`.

source: See also :c:member:`PyConfig.exec_prefix`.
pt_pt: Veja também :c:member:`PyConfig.exec_prefix`.

source: Python base executable: :data:`sys._base_executable`.
pt_pt: Executável base Python: :data:`sys._base_executable`.

source: Set by the :envvar:`__PYVENV_LAUNCHER__` environment variable.
pt_pt: Definido pela variável de ambiente :envvar:`__PYVENV_LAUNCHER__`.

source: Set from :c:member:`PyConfig.executable` if ``NULL``.
pt_pt: Definido a partir de :c:member:`PyConfig.executable` se ``NULL``.

source: See also :c:member:`PyConfig.executable`.
pt_pt: Veja também :c:member:`PyConfig.executable`.

source: See also :c:member:`PyConfig.prefix`.
pt_pt: Veja também :c:member:`PyConfig.prefix`.

source: If equals to ``0`` and :c:member:`~PyConfig.configure_c_stdio` is non-zero, disable buffering on the C streams stdout and stderr.
pt_pt: Se for igual a ``0`` e :c:member:`~PyConfig.configure_c_stdio` for diferente de zero, desative o buffer nos fluxos C stdout e stderr.

source: Set to ``0`` by the :option:`-u` command line option and the :envvar:`PYTHONUNBUFFERED` environment variable.
pt_pt: Definido como ``0`` pela opção de linha de comando :option:`-u` e pela variável de ambiente :envvar:`PYTHONUNBUFFERED`.

source: stdin is always opened in buffered mode.
pt_pt: O stdin é sempre aberto no modo buffer.

source: Default: ``1``.
pt_pt: Padrão: ``1``.

source: If equals to ``1``, issue a warning when comparing :class:`bytes` or :class:`bytearray` with :class:`str`, or comparing :class:`bytes` with :class:`int`.
pt_pt: Se for igual a ``1``, emitir um aviso ao comparar :class:`bytes` ou :class:`bytearray` com :class:`str`, ou ao comparar :class:`bytes` com :class:`int`.

source: If equal or greater to ``2``, raise a :exc:`BytesWarning` exception in these cases.
pt_pt: Se for igual ou superior a ``2``, gere uma exceção :exc:`BytesWarning` nestes casos.

source: Incremented by the :option:`-b` command line option.
pt_pt: Aumentado pela opção de linha de comando :option:`-b`.

source: If non-zero, emit a :exc:`EncodingWarning` warning when :class:`io.TextIOWrapper` uses its default encoding. See :ref:`io-encoding-warning` for details.
pt_pt: Se diferente de zero, emite um aviso :exc:`EncodingWarning` quando :class:`io.TextIOWrapper` usa a sua codificação padrão. Consulte :ref:`io-encoding-warning` para obter detalhes.

source: If equals to ``0``, disables the inclusion of the end line and column mappings in code objects. Also disables traceback printing carets to specific error locations.
pt_pt: Se for igual a ``0``, desativa a inclusão dos mapeamentos de linha e coluna finais nos objetos de código. Também desativa a impressão de carets de rastreamento para locais de erro específicos.

source: Set to ``0`` by the :envvar:`PYTHONNODEBUGRANGES` environment variable and by the :option:`-X no_debug_ranges <-X>` command line option.
pt_pt: Definido como ``0`` pela variável de ambiente :envvar:`PYTHONNODEBUGRANGES` e pela opção de linha de comando :option:`-X no_debug_ranges <-X>`.

source: Control the validation behavior of hash-based ``.pyc`` files: value of the :option:`--check-hash-based-pycs` command line option.
pt_pt: Controla o comportamento de validação de ficheiros ``.pyc`` baseados em hash: valor da opção de linha de comando :option:`--check-hash-based-pycs`.

source: Valid values:
pt_pt: Valores válidos:

source: ``L"always"``: Hash the source file for invalidation regardless of value of the 'check_source' flag.
pt_pt: ``L"always"``: Hash o ficheiro de origem para invalidação, independentemente do valor do sinalizador 'check_source'.

source: ``L"never"``: Assume that hash-based pycs always are valid.
pt_pt: ``L"never"``: Presuma que os pycs baseados em hash são sempre válidos.

source: ``L"default"``: The 'check_source' flag in hash-based pycs determines invalidation.
pt_pt: ``L"default"``: O sinalizador 'check_source' em pycs baseados em hash determina a invalidação.

source: Default: ``L"default"``.
pt_pt: Padrão: ``L"default"``.

source: See also :pep:`552` "Deterministic pycs".
pt_pt: Veja também: :pep:`552` "Pycs determinísticos".

source: If non-zero, configure C standard streams:
pt_pt: Se diferente de zero, configure os fluxos padrão C:
