Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/init_config.po
Languages: pt_pt

source: On Windows, set the binary mode (``O_BINARY``) on stdin, stdout and stderr.
pt_pt: No Windows, defina o modo binário (``O_BINARY``) em stdin, stdout e stderr.

source: If :c:member:`~PyConfig.buffered_stdio` equals zero, disable buffering of stdin, stdout and stderr streams.
pt_pt: Se :c:member:`~PyConfig.buffered_stdio` for igual a zero, desative o buffer dos fluxos stdin, stdout e stderr.

source: If :c:member:`~PyConfig.interactive` is non-zero, enable stream buffering on stdin and stdout (only stdout on Windows).
pt_pt: Se :c:member:`~PyConfig.interactive` for diferente de zero, habilite o buffer de fluxo em stdin e stdout (apenas stdout no Windows).

source: If non-zero, enable the :ref:`Python Development Mode <devmode>`.
pt_pt: Se diferente de zero, ative o :ref:`Modo de Desenvolvimento Python <devmode>`.

source: Set to ``1`` by the :option:`-X dev <-X>` option and the :envvar:`PYTHONDEVMODE` environment variable.
pt_pt: Defina como ``1`` pela opção :option:`-X dev <-X>` e pela variável de ambiente :envvar:`PYTHONDEVMODE`.

source: Dump Python references?
pt_pt: Descartar referências Python?

source: If non-zero, dump all objects which are still alive at exit.
pt_pt: Se diferente de zero, descarregue todos os objetos que ainda estiverem ativos na saída.

source: Set to ``1`` by the :envvar:`PYTHONDUMPREFS` environment variable.
pt_pt: Defina como ``1`` pela variável de ambiente :envvar:`PYTHONDUMPREFS`.

source: Needs a special build of Python with the ``Py_TRACE_REFS`` macro defined: see the :option:`configure --with-trace-refs option <--with-trace-refs>`.
pt_pt: Requer uma compilação especial do Python com a macro ``Py_TRACE_REFS`` definida: consulte a opção :option:`configure --with-trace-refs option <--with-trace-refs>`.

source: Filename where to dump Python references.
pt_pt: Nome do ficheiro onde despejar as referências Python.

source: Set by the :envvar:`PYTHONDUMPREFSFILE` environment variable.
pt_pt: Definido pela variável de ambiente :envvar:`PYTHONDUMPREFSFILE`.

source: The site-specific directory prefix where the platform-dependent Python files are installed: :data:`sys.exec_prefix`.
pt_pt: O prefixo do diretório específico do local onde os ficheiros Python dependentes da plataforma são instalados: :data:`sys.exec_prefix`.

source: See also :c:member:`PyConfig.base_exec_prefix`.
pt_pt: Veja também :c:member:`PyConfig.base_exec_prefix`.

source: The absolute path of the executable binary for the Python interpreter: :data:`sys.executable`.
pt_pt: O caminho absoluto do binário executável para o interpretador Python: :data:`sys.executable`.

source: See also :c:member:`PyConfig.base_executable`.
pt_pt: Veja também :c:member:`PyConfig.base_executable`.

source: Enable faulthandler?
pt_pt: Ativar o gestor de falhas?

source: If non-zero, call :func:`faulthandler.enable` at startup.
pt_pt: Se diferente de zero, chame :func:`faulthandler.enable` na inicialização.

source: Set to ``1`` by :option:`-X faulthandler <-X>` and the :envvar:`PYTHONFAULTHANDLER` environment variable.
pt_pt: Defina como ``1`` por meio de :option:`-X faulthandler <-X>` e da variável de ambiente :envvar:`PYTHONFAULTHANDLER`.

source: :term:`Filesystem encoding <filesystem encoding and error handler>`: :func:`sys.getfilesystemencoding`.
pt_pt: :term:`Codificação do sistema de ficheiros <filesystem encoding and error handler>`: :func:`sys.getfilesystemencoding`.

source: On macOS, Android and VxWorks: use ``"utf-8"`` by default.
pt_pt: No macOS, Android e VxWorks: use ``"utf-8"`` por predefinição.

source: On Windows: use ``"utf-8"`` by default, or ``"mbcs"`` if :c:member:`~PyPreConfig.legacy_windows_fs_encoding` of :c:type:`PyPreConfig` is non-zero.
pt_pt: No Windows: use ``"utf-8"`` por predefinição, ou ``"mbcs"`` se :c:member:`~PyPreConfig.legacy_windows_fs_encoding` de :c:type:`PyPreConfig` for diferente de zero.

source: Default encoding on other platforms:
pt_pt: Codificação padrão em outras plataformas:

source: ``"utf-8"`` if :c:member:`PyPreConfig.utf8_mode` is non-zero.
pt_pt: ``"utf-8"`` se :c:member:`PyPreConfig.utf8_mode` for diferente de zero.

source: ``"ascii"`` if Python detects that ``nl_langinfo(CODESET)`` announces the ASCII encoding, whereas the ``mbstowcs()`` function decodes from a different encoding (usually Latin1).
pt_pt: ``"ascii"`` se o Python detectar que ``nl_langinfo(CODESET)`` anuncia a codificação ASCII, enquanto a função ``mbstowcs()`` descodifica a partir de uma codificação diferente (normalmente Latin1).

source: ``"utf-8"`` if ``nl_langinfo(CODESET)`` returns an empty string.
pt_pt: ``"utf-8"`` se ``nl_langinfo(CODESET)`` retornar uma string vazia.

source: Otherwise, use the :term:`locale encoding`: ``nl_langinfo(CODESET)`` result.
pt_pt: Caso contrário, utilize o resultado da codificação local: ``nl_langinfo(CODESET)``.

source: At Python startup, the encoding name is normalized to the Python codec name. For example, ``"ANSI_X3.4-1968"`` is replaced with ``"ascii"``.
pt_pt: Na inicialização do Python, o nome da codificação é normalizado para o nome do codec Python. Por exemplo, ``"ANSI_X3.4-1968"`` é substituído por ``"ascii"``.

source: See also the :c:member:`~PyConfig.filesystem_errors` member.
pt_pt: Veja também o membro :c:member:`~PyConfig.filesystem_errors`.

source: :term:`Filesystem error handler <filesystem encoding and error handler>`: :func:`sys.getfilesystemencodeerrors`.
pt_pt: :term:`Tratador de erros do sistema de ficheiros <filesystem encoding and error handler>`: :func:`sys.getfilesystemencodeerrors`.

source: On Windows: use ``"surrogatepass"`` by default, or ``"replace"`` if :c:member:`~PyPreConfig.legacy_windows_fs_encoding` of :c:type:`PyPreConfig` is non-zero.
pt_pt: No Windows: use ``"surrogatepass"`` por predefinição, ou ``"replace"`` se :c:member:`~PyPreConfig.legacy_windows_fs_encoding` de :c:type:`PyPreConfig` for diferente de zero.

source: On other platforms: use ``"surrogateescape"`` by default.
pt_pt: Em outras plataformas: use ``"surrogateescape"`` por predefinição.

source: Supported error handlers:
pt_pt: Tratadores de erros suportados:

source: ``"surrogatepass"`` (only supported with the UTF-8 encoding)
pt_pt: ``"surrogatepass"`` (apenas suportado com a codificação UTF-8)

source: See also the :c:member:`~PyConfig.filesystem_encoding` member.
pt_pt: Veja também o membro :c:member:`~PyConfig.filesystem_encoding`.

source: If non-zero, use frozen modules.
pt_pt: Se diferente de zero, use módulos congelados.

source: Set by the :envvar:`PYTHON_FROZEN_MODULES` environment variable.
pt_pt: Definido pela variável de ambiente :envvar:`PYTHON_FROZEN_MODULES`.

source: Default: ``1`` in a release build, or ``0`` in a :ref:`debug build <debug-build>`.
pt_pt: Padrão: ``1`` numa compilação de lançamento ou ``0`` numa compilação de depuração <debug-build>`.

source: Randomized hash function seed.
pt_pt: Semente da função hash aleatória.

source: If :c:member:`~PyConfig.use_hash_seed` is zero, a seed is chosen randomly at Python startup, and :c:member:`~PyConfig.hash_seed` is ignored.
pt_pt: Se :c:member:`~PyConfig.use_hash_seed` for zero, uma semente é escolhida aleatoriamente no arranque do Python, e :c:member:`~PyConfig.hash_seed` é ignorado.

source: Set by the :envvar:`PYTHONHASHSEED` environment variable.
pt_pt: Definido pela variável de ambiente :envvar:`PYTHONHASHSEED`.

source: Default *use_hash_seed* value: ``-1`` in Python mode, ``0`` in isolated mode.
pt_pt: Valor padrão *use_hash_seed*: ``-1`` no modo Python, ``0`` no modo isolado.

source: Set the default Python "home" directory, that is, the location of the standard Python libraries (see :envvar:`PYTHONHOME`).
pt_pt: Defina o diretório "home" padrão do Python, ou seja, a localização das bibliotecas padrão do Python (consulte :envvar:`PYTHONHOME`).

source: Set by the :envvar:`PYTHONHOME` environment variable.
pt_pt: Definido pela variável de ambiente :envvar:`PYTHONHOME`.

source: Part of the :ref:`Python Path Configuration <init-path-config>` input.
pt_pt: Parte da entrada :ref:`Configuração do caminho Python <init-path-config>`.

source: If ``1``, profile import time. If ``2``, include additional output that indicates when an imported module has already been loaded.
pt_pt: Se ``1``, tempo de importação do perfil. Se ``2``, inclua uma saída adicional que indique quando um módulo importado já foi carregado.

source: Set by the :option:`-X importtime <-X>` option and the :envvar:`PYTHONPROFILEIMPORTTIME` environment variable.
pt_pt: Definido pela opção :option:`-X importtime <-X>` e pela variável de ambiente :envvar:`PYTHONPROFILEIMPORTTIME`.

source: Added support for ``import_time = 2``
pt_pt: Adicionado suporte para ``import_time = 2``

source: Enter interactive mode after executing a script or a command.
pt_pt: Entre no modo interativo após executar um script ou um comando.

source: If greater than ``0``, enable inspect: when a script is passed as first argument or the -c option is used, enter interactive mode after executing the script or the command, even when :data:`sys.stdin` does not appear to be a terminal.
pt_pt: Se for maior que ``0``, ative a inspeção: quando um script for passado como primeiro argumento ou a opção -c for usada, entre no modo interativo após executar o script ou o comando, mesmo quando :data:`sys.stdin` não parecer ser um terminal.

source: Incremented by the :option:`-i` command line option. Set to ``1`` if the :envvar:`PYTHONINSPECT` environment variable is non-empty.
pt_pt: Aumentado pela opção de linha de comando :option:`-i`. Definido como ``1`` se a variável de ambiente :envvar:`PYTHONINSPECT` não estiver vazia.

source: Install Python signal handlers?
pt_pt: Instalar manipuladores de sinal Python?

source: Default: ``1`` in Python mode, ``0`` in isolated mode.
pt_pt: Padrão: ``1`` no modo Python, ``0`` no modo isolado.

source: If greater than ``0``, enable the interactive mode (REPL).
pt_pt: Se for maior que ``0``, ative o modo interativo (REPL).

source: Incremented by the :option:`-i` command line option.
pt_pt: Aumentado pela opção de linha de comando :option:`-i`.

source: Configures the :ref:`integer string conversion length limitation <int_max_str_digits>`. An initial value of ``-1`` means the value will be taken from the command line or environment or otherwise default to 4300 (:data:`sys.int_info.default_max_str_digits`). A value of ``0`` disables the limitation. Values greater than zero but less than 640 (:data:`sys.int_info.str_digits_check_threshold`) are unsupported and will produce an error.
pt_pt: Configura a :ref:`limitação do comprimento da conversão de strings inteiras <int_max_str_digits>`. Um valor inicial de ``-1`` significa que o valor será obtido da linha de comando ou do ambiente ou, caso contrário, o padrão será 4300 (:data:`sys.int_info.default_max_str_digits`). Um valor de ``0`` desativa a limitação. Valores maiores que zero, mas menores que 640 (:data:`sys.int_info.str_digits_check_threshold`) não são suportados e produzirão um erro.

source: Configured by the :option:`-X int_max_str_digits <-X>` command line flag or the :envvar:`PYTHONINTMAXSTRDIGITS` environment variable.
pt_pt: Configurado pela flag de linha de comando :option:`-X int_max_str_digits <-X>` ou pela variável de ambiente :envvar:`PYTHONINTMAXSTRDIGITS`.

source: Default: ``-1`` in Python mode. 4300 (:data:`sys.int_info.default_max_str_digits`) in isolated mode.
pt_pt: Padrão: ``-1`` no modo Python. 4300 (:data:`sys.int_info.default_max_str_digits`) no modo isolado.

source: If the value of :c:member:`~PyConfig.cpu_count` is not ``-1`` then it will override the return values of :func:`os.cpu_count`, :func:`os.process_cpu_count`, and :func:`multiprocessing.cpu_count`.
pt_pt: Se o valor de :c:member:`~PyConfig.cpu_count` não for ``-1``, ele substituirá os valores de retorno de :func:`os.cpu_count`, :func:`os.process_cpu_count` e :func:`multiprocessing.cpu_count`.

source: Configured by the :samp:`-X cpu_count={n|default}` command line flag or the :envvar:`PYTHON_CPU_COUNT` environment variable.
pt_pt: Configurado pela flag de linha de comando :samp:`-X cpu_count={n|default}` ou pela variável de ambiente :envvar:`PYTHON_CPU_COUNT`.

source: Default: ``-1``.
pt_pt: Padrão: ``-1``.

source: If greater than ``0``, enable isolated mode:
pt_pt: Se for maior que ``0``, ative o modo isolado:

source: Set :c:member:`~PyConfig.safe_path` to ``1``: don't prepend a potentially unsafe path to :data:`sys.path` at Python startup, such as the current directory, the script's directory or an empty string.
pt_pt: Defina :c:member:`~PyConfig.safe_path` como ``1``: não anteponha um caminho potencialmente inseguro a :data:`sys.path` no arranque do Python, como o diretório atual, o diretório do script ou uma string vazia.

source: Set :c:member:`~PyConfig.use_environment` to ``0``: ignore ``PYTHON`` environment variables.
pt_pt: Defina :c:member:`~PyConfig.use_environment` como ``0``: ignore as variáveis de ambiente ``PYTHON``.

source: Set :c:member:`~PyConfig.user_site_directory` to ``0``: don't add the user site directory to :data:`sys.path`.
pt_pt: Defina :c:member:`~PyConfig.user_site_directory` como ``0``: não adicione o diretório do site do utilizador a :data:`sys.path`.

source: Python REPL doesn't import :mod:`readline` nor enable default readline configuration on interactive prompts.
pt_pt: O Python REPL não importa :mod:`readline` nem habilita a configuração padrão do readline em prompts interativos.

source: Set to ``1`` by the :option:`-I` command line option.
pt_pt: Definido como ``1`` pela opção de linha de comando :option:`-I`.

source: See also the :ref:`Isolated Configuration <init-isolated-conf>` and :c:member:`PyPreConfig.isolated`.
pt_pt: Veja também: :ref:`Configuração Isolada <init-isolated-conf>` e :c:member:`PyPreConfig.isolated`.

source: If non-zero, use :class:`io.FileIO` instead of :class:`!io._WindowsConsoleIO` for :data:`sys.stdin`, :data:`sys.stdout` and :data:`sys.stderr`.
pt_pt: Se diferente de zero, use :class:`io.FileIO` em vez de :class:`!io._WindowsConsoleIO` para :data:`sys.stdin`, :data:`sys.stdout` e :data:`sys.stderr`.

source: Set to ``1`` if the :envvar:`PYTHONLEGACYWINDOWSSTDIO` environment variable is set to a non-empty string.
pt_pt: Defina como ``1`` se a variável de ambiente :envvar:`PYTHONLEGACYWINDOWSSTDIO` estiver definida como uma string não vazia.

source: See also the :pep:`528` (Change Windows console encoding to UTF-8).
pt_pt: Veja também o :pep:`528` (Alterar a codificação da consola do Windows para UTF-8).

source: If non-zero, dump statistics on :ref:`Python pymalloc memory allocator <pymalloc>` at exit.
pt_pt: Se diferente de zero, descarregar estatísticas sobre :ref:`Alocador de memória Python pymalloc <pymalloc>` ao sair.

source: Set to ``1`` by the :envvar:`PYTHONMALLOCSTATS` environment variable.
pt_pt: Defina como ``1`` pela variável de ambiente :envvar:`PYTHONMALLOCSTATS`.

source: The option is ignored if Python is :option:`configured using the --without-pymalloc option <--without-pymalloc>`.
pt_pt: A opção é ignorada se o Python for :option:`configurado usando a opção --without-pymalloc <--without-pymalloc>`.

source: Platform library directory name: :data:`sys.platlibdir`.
pt_pt: Nome do diretório da biblioteca da plataforma: :data:`sys.platlibdir`.

source: Set by the :envvar:`PYTHONPLATLIBDIR` environment variable.
pt_pt: Definido pela variável de ambiente :envvar:`PYTHONPLATLIBDIR`.

source: Default: value of the ``PLATLIBDIR`` macro which is set by the :option:`configure --with-platlibdir option <--with-platlibdir>` (default: ``"lib"``, or ``"DLLs"`` on Windows).
pt_pt: Padrão: valor da macro ``PLATLIBDIR`` definida pela opção :option:`configure --with-platlibdir option <--with-platlibdir>` (padrão: ``"lib"`` ou ``"DLLs"`` no Windows).

source: This macro is now used on Windows to locate the standard library extension modules, typically under ``DLLs``. However, for compatibility, note that this value is ignored for any non-standard layouts, including in-tree builds and virtual environments.
pt_pt: Esta macro é agora utilizada no Windows para localizar os módulos de extensão da biblioteca padrão, normalmente em ``DLLs``. No entanto, por motivos de compatibilidade, note que este valor é ignorado para quaisquer layouts não padrão, incluindo compilações em árvore e ambientes virtuais.

source: Module search paths (:data:`sys.path`) as a string separated by ``DELIM`` (:data:`os.pathsep`).
pt_pt: Caminhos de pesquisa do módulo (:data:`sys.path`) como uma string separada por ``DELIM`` (:data:`os.pathsep`).

source: Set by the :envvar:`PYTHONPATH` environment variable.
pt_pt: Definido pela variável de ambiente :envvar:`PYTHONPATH`.

source: Module search paths: :data:`sys.path`.
pt_pt: Caminhos de pesquisa do módulo: :data:`sys.path`.

source: If :c:member:`~PyConfig.module_search_paths_set` is equal to ``0``, :c:func:`Py_InitializeFromConfig` will replace :c:member:`~PyConfig.module_search_paths` and sets :c:member:`~PyConfig.module_search_paths_set` to ``1``.
pt_pt: Se :c:member:`~PyConfig.module_search_paths_set` for igual a ``0``, :c:func:`Py_InitializeFromConfig` substituirá :c:member:`~PyConfig.module_search_paths` e definirá :c:member:`~PyConfig.module_search_paths_set` como ``1``.

source: Default: empty list (``module_search_paths``) and ``0`` (``module_search_paths_set``).
pt_pt: Padrão: lista vazia (``module_search_paths``) e ``0`` (``module_search_paths_set``).

source: Compilation optimization level:
pt_pt: Nível de otimização da compilação:

source: ``0``: Peephole optimizer, set ``__debug__`` to ``True``.
pt_pt: ``0``: Otimizador de olho mágico, defina ``__debug__`` como ``True``.

source: ``1``: Level 0, remove assertions, set ``__debug__`` to ``False``.
pt_pt: ``1``: Nível 0, remova as asserções, defina ``__debug__`` como ``False``.

source: ``2``: Level 1, strip docstrings.
pt_pt: ``2``: Nível 1, remover docstrings.

source: Incremented by the :option:`-O` command line option. Set to the :envvar:`PYTHONOPTIMIZE` environment variable value.
pt_pt: Aumentado pela opção de linha de comando :option:`-O`. Definido para o valor da variável de ambiente :envvar:`PYTHONOPTIMIZE`.

source: The list of the original command line arguments passed to the Python executable: :data:`sys.orig_argv`.
pt_pt: A lista dos argumentos da linha de comando originais passados para o executável Python: :data:`sys.orig_argv`.

source: If :c:member:`~PyConfig.orig_argv` list is empty and :c:member:`~PyConfig.argv` is not a list only containing an empty string, :c:func:`PyConfig_Read` copies :c:member:`~PyConfig.argv` into :c:member:`~PyConfig.orig_argv` before modifying :c:member:`~PyConfig.argv` (if :c:member:`~PyConfig.parse_argv` is non-zero).
pt_pt: Se a lista :c:member:`~PyConfig.orig_argv` estiver vazia e :c:member:`~PyConfig.argv` não for uma lista contendo apenas uma string vazia, :c:func:`PyConfig_Read` copia :c:member:`~PyConfig.argv` para :c:member:`~PyConfig.orig_argv` antes de modificar :c:member:`~PyConfig.argv` (se :c:member:`~PyConfig.parse_argv` for diferente de zero).

source: See also the :c:member:`~PyConfig.argv` member and the :c:func:`Py_GetArgcArgv` function.
pt_pt: Veja também o membro :c:member:`~PyConfig.argv` e a função :c:func:`Py_GetArgcArgv`.

source: Default: empty list.
pt_pt: Padrão: lista vazia.

source: Parse command line arguments?
pt_pt: Analisar argumentos da linha de comando?

source: If equals to ``1``, parse :c:member:`~PyConfig.argv` the same way the regular Python parses :ref:`command line arguments <using-on-cmdline>`, and strip Python arguments from :c:member:`~PyConfig.argv`.
pt_pt: Se for igual a ``1``, analise :c:member:`~PyConfig.argv` da mesma forma que o Python normal analisa :ref:`argumentos da linha de comando <using-on-cmdline>` e remova os argumentos do Python de :c:member:`~PyConfig.argv`.

source: The :c:member:`PyConfig.argv` arguments are now only parsed if :c:member:`PyConfig.parse_argv` equals to ``1``.
pt_pt: Os argumentos :c:member:`PyConfig.argv` agora só são analisados se :c:member:`PyConfig.parse_argv` for igual a ``1``.

source: Parser debug mode. If greater than ``0``, turn on parser debugging output (for expert only, depending on compilation options).
pt_pt: Modo de depuração do analisador. Se for maior que ``0``, ative a saída de depuração do analisador (apenas para especialistas, dependendo das opções de compilação).

source: Incremented by the :option:`-d` command line option. Set to the :envvar:`PYTHONDEBUG` environment variable value.
pt_pt: Aumentado pela opção de linha de comando :option:`-d`. Definido para o valor da variável de ambiente :envvar:`PYTHONDEBUG`.

source: Needs a :ref:`debug build of Python <debug-build>` (the ``Py_DEBUG`` macro must be defined).
pt_pt: Requer uma ref:`compilação de depuração do Python <debug-build>` (a macro ``Py_DEBUG`` deve estar definida).

source: If non-zero, calculation of path configuration is allowed to log warnings into ``stderr``. If equals to ``0``, suppress these warnings.
pt_pt: Se diferente de zero, o cálculo da configuração do caminho pode registar avisos em ``stderr``. Se for igual a ``0``, suprime esses avisos.

source: Now also applies on Windows.
pt_pt: Agora também se aplica ao Windows.

source: The site-specific directory prefix where the platform independent Python files are installed: :data:`sys.prefix`.
pt_pt: O prefixo do diretório específico do local onde os ficheiros Python independentes da plataforma estão instalados: :data:`sys.prefix`.

source: See also :c:member:`PyConfig.base_prefix`.
pt_pt: Veja também :c:member:`PyConfig.base_prefix`.

source: Program name used to initialize :c:member:`~PyConfig.executable` and in early error messages during Python initialization.
pt_pt: Nome do programa usado para inicializar :c:member:`~PyConfig.executable` e nas primeiras mensagens de erro durante a inicialização do Python.

source: On macOS, use :envvar:`PYTHONEXECUTABLE` environment variable if set.
pt_pt: No macOS, use a variável de ambiente :envvar:`PYTHONEXECUTABLE`, se estiver definida.

source: If the ``WITH_NEXT_FRAMEWORK`` macro is defined, use :envvar:`__PYVENV_LAUNCHER__` environment variable if set.
pt_pt: Se a macro ``WITH_NEXT_FRAMEWORK`` estiver definida, use a variável de ambiente :envvar:`__PYVENV_LAUNCHER__`, se estiver definida.

source: Use ``argv[0]`` of :c:member:`~PyConfig.argv` if available and non-empty.
pt_pt: Use ``argv[0]`` de :c:member:`~PyConfig.argv` se disponível e não estiver vazio.

source: Otherwise, use ``L"python"`` on Windows, or ``L"python3"`` on other platforms.
pt_pt: Caso contrário, utilize ``L"python"`` no Windows ou ``L"python3"`` noutras plataformas.

source: Directory where cached ``.pyc`` files are written: :data:`sys.pycache_prefix`.
pt_pt: Diretório onde os ficheiros ``.pyc`` em cache são gravados: :data:`sys.pycache_prefix`.

source: Set by the :option:`-X pycache_prefix=PATH <-X>` command line option and the :envvar:`PYTHONPYCACHEPREFIX` environment variable. The command-line option takes precedence.
pt_pt: Definido pela opção de linha de comando :option:`-X pycache_prefix=PATH <-X>` e pela variável de ambiente :envvar:`PYTHONPYCACHEPREFIX`. A opção de linha de comando tem precedência.

source: If ``NULL``, :data:`sys.pycache_prefix` is set to ``None``.
pt_pt: Se for ``NULL``, :data:`sys.pycache_prefix` é definido como ``None``.

source: Quiet mode. If greater than ``0``, don't display the copyright and version at Python startup in interactive mode.
pt_pt: Modo silencioso. Se for maior que ``0``, não exibe os direitos de autor e a versão na inicialização do Python no modo interativo.

source: Incremented by the :option:`-q` command line option.
pt_pt: Aumentado pela opção de linha de comando :option:`-q`.
