Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/init_config.po
Languages: pt_pt

source: It is possible to completely ignore the function calculating the default path configuration by setting explicitly all path configuration output fields listed above. A string is considered as set even if it is non-empty. ``module_search_paths`` is considered as set if ``module_search_paths_set`` is set to ``1``. In this case, ``module_search_paths`` will be used without modification.
pt_pt: É possível ignorar completamente a função que calcula a configuração do caminho padrão, definindo explicitamente todos os campos de saída da configuração do caminho listados acima. Uma string é considerada definida mesmo que não esteja vazia. ``module_search_paths`` é considerado definido se ``module_search_paths_set`` estiver definido como ``1``. Neste caso, ``module_search_paths`` será usado sem modificações.

source: Set :c:member:`~PyConfig.pathconfig_warnings` to ``0`` to suppress warnings when calculating the path configuration (Unix only, Windows does not log any warning).
pt_pt: Defina :c:member:`~PyConfig.pathconfig_warnings` como ``0`` para suprimir avisos ao calcular a configuração do caminho (apenas Unix, o Windows não regista nenhum aviso).

source: If :c:member:`~PyConfig.base_prefix` or :c:member:`~PyConfig.base_exec_prefix` fields are not set, they inherit their value from :c:member:`~PyConfig.prefix` and :c:member:`~PyConfig.exec_prefix` respectively.
pt_pt: Se os campos :c:member:`~PyConfig.base_prefix` ou :c:member:`~PyConfig.base_exec_prefix` não estiverem definidos, eles herdam o seu valor de :c:member:`~PyConfig.prefix` e :c:member:`~PyConfig.exec_prefix`, respetivamente.

source: :c:func:`Py_RunMain` and :c:func:`Py_Main` modify :data:`sys.path`:
pt_pt: :c:func:`Py_RunMain` e :c:func:`Py_Main` modificam :data:`sys.path`:

source: If :c:member:`~PyConfig.run_filename` is set and is a directory which contains a ``__main__.py`` script, prepend :c:member:`~PyConfig.run_filename` to :data:`sys.path`.
pt_pt: Se :c:member:`~PyConfig.run_filename` estiver definido e for um diretório que contém um script ``__main__.py``, acrescente :c:member:`~PyConfig.run_filename` ao :data:`sys.path`.

source: If :c:member:`~PyConfig.isolated` is zero:
pt_pt: Se :c:member:`~PyConfig.isolated` for zero:

source: If :c:member:`~PyConfig.run_module` is set, prepend the current directory to :data:`sys.path`. Do nothing if the current directory cannot be read.
pt_pt: Se :c:member:`~PyConfig.run_module` estiver definido, acrescente o diretório atual ao :data:`sys.path`. Não faça nada se o diretório atual não puder ser lido.

source: If :c:member:`~PyConfig.run_filename` is set, prepend the directory of the filename to :data:`sys.path`.
pt_pt: Se :c:member:`~PyConfig.run_filename` estiver definido, acrescente o diretório do nome do ficheiro a :data:`sys.path`.

source: Otherwise, prepend an empty string to :data:`sys.path`.
pt_pt: Caso contrário, acrescente uma string vazia ao :data:`sys.path`.

source: If :c:member:`~PyConfig.site_import` is non-zero, :data:`sys.path` can be modified by the :mod:`site` module. If :c:member:`~PyConfig.user_site_directory` is non-zero and the user's site-package directory exists, the :mod:`site` module appends the user's site-package directory to :data:`sys.path`.
pt_pt: Se :c:member:`~PyConfig.site_import` for diferente de zero, :data:`sys.path` pode ser modificado pelo módulo :mod:`site`. Se :c:member:`~PyConfig.user_site_directory` for diferente de zero e o diretório site-package do utilizador existir, o módulo :mod:`site` acrescenta o diretório site-package do utilizador a :data:`sys.path`.

source: The following configuration files are used by the path configuration:
pt_pt: Os seguintes ficheiros de configuração são utilizados pela configuração do caminho:

source: ``._pth`` file (ex: ``python._pth``)
pt_pt: ficheiro ``._pth`` (ex: ``python._pth``)

source: ``pybuilddir.txt`` (Unix only)
pt_pt: ``pybuilddir.txt`` (apenas Unix)

source: If a ``._pth`` file is present:
pt_pt: Se um ficheiro ``._pth`` estiver presente:

source: Set :c:member:`~PyConfig.isolated` to ``1``.
pt_pt: Defina :c:member:`~PyConfig.isolated` como ``1``.

source: Set :c:member:`~PyConfig.use_environment` to ``0``.
pt_pt: Defina :c:member:`~PyConfig.use_environment` como ``0``.

source: Set :c:member:`~PyConfig.site_import` to ``0``.
pt_pt: Defina :c:member:`~PyConfig.site_import` como ``0``.

source: Set :c:member:`~PyConfig.safe_path` to ``1``.
pt_pt: Defina :c:member:`~PyConfig.safe_path` como ``1``.

source: If :c:member:`~PyConfig.home` is not set and a ``pyvenv.cfg`` file is present in the same directory as :c:member:`~PyConfig.executable`, or its parent, :c:member:`~PyConfig.prefix` and :c:member:`~PyConfig.exec_prefix` are set that location. When this happens, :c:member:`~PyConfig.base_prefix` and :c:member:`~PyConfig.base_exec_prefix` still keep their value, pointing to the base installation. See :ref:`sys-path-init-virtual-environments` for more information.
pt_pt: Se :c:member:`~PyConfig.home` não estiver definido e um ficheiro ``pyvenv.cfg`` estiver presente no mesmo diretório que :c:member:`~PyConfig.executable`, ou seu pai, :c:member:`~PyConfig.prefix` e :c:member:`~PyConfig.exec_prefix` serão definidos nessa localização. Quando isso acontece, :c:member:`~PyConfig.base_prefix` e :c:member:`~PyConfig.base_exec_prefix` ainda mantêm o seu valor, apontando para a instalação base. Consulte :ref:`sys-path-init-virtual-environments` para obter mais informações.

source: The ``__PYVENV_LAUNCHER__`` environment variable is used to set :c:member:`PyConfig.base_executable`.
pt_pt: A variável de ambiente ``__PYVENV_LAUNCHER__`` é usada para definir :c:member:`PyConfig.base_executable`.

source: :c:member:`~PyConfig.prefix`, and :c:member:`~PyConfig.exec_prefix`, are now set to the ``pyvenv.cfg`` directory. This was previously done by :mod:`site`, therefore affected by :option:`-S`.
pt_pt: :c:member:`~PyConfig.prefix` e :c:member:`~PyConfig.exec_prefix` agora estão definidos para o diretório ``pyvenv.cfg``. Anteriormente, isso era feito por :mod:`site`, portanto, afetado por :option:`-S`.

source: Get the original command line arguments, before Python modified them.
pt_pt: Obtenha os argumentos originais da linha de comando, antes que o Python os modifique.

source: See also :c:member:`PyConfig.orig_argv` member.
pt_pt: Veja também o membro :c:member:`PyConfig.orig_argv`.

source: Delaying main module execution
pt_pt: Atrasar a execução do módulo principal

source: In some embedding use cases, it may be desirable to separate interpreter initialization from the execution of the main module.
pt_pt: Em alguns casos de uso de incorporação, pode ser desejável separar a inicialização do interpretador da execução do módulo principal.

source: This separation can be achieved by setting ``PyConfig.run_command`` to the empty string during initialization (to prevent the interpreter from dropping into the interactive prompt), and then subsequently executing the desired main module code using ``__main__.__dict__`` as the global namespace.
pt_pt: Essa separação pode ser obtida definindo ``PyConfig.run_command`` como uma string vazia durante a inicialização (para impedir que o interpretador entre no prompt interativo) e, em seguida, executando o código do módulo principal desejado usando ``__main__.__dict__`` como namespace global.

source: argv (in module sys)
pt_pt: argv (no módulo sys)
