Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/init_config.po
Languages: pt_pt

source: Value of the :option:`-c` command line option.
pt_pt: Valor da opção de linha de comando :option:`-c`.

source: Used by :c:func:`Py_RunMain`.
pt_pt: Usado por :c:func:`Py_RunMain`.

source: Filename passed on the command line: trailing command line argument without :option:`-c` or :option:`-m`. It is used by the :c:func:`Py_RunMain` function.
pt_pt: Nome do ficheiro passado na linha de comando: argumento final da linha de comando sem :option:`-c` ou :option:`-m`. É utilizado pela função :c:func:`Py_RunMain`.

source: For example, it is set to ``script.py`` by the ``python3 script.py arg`` command line.
pt_pt: Por exemplo, é definido como ``script.py`` pela linha de comando ``python3 script.py arg``.

source: See also the :c:member:`PyConfig.skip_source_first_line` option.
pt_pt: Veja também a opção :c:member:`PyConfig.skip_source_first_line`.

source: Value of the :option:`-m` command line option.
pt_pt: Valor da opção de linha de comando :option:`-m`.

source: ``package.module`` path to module that should be imported before ``site.py`` is run.
pt_pt: Caminho ``package.module`` para o módulo que deve ser importado antes da execução do ``site.py``.

source: Set by the :option:`-X presite=package.module <-X>` command-line option and the :envvar:`PYTHON_PRESITE` environment variable. The command-line option takes precedence.
pt_pt: Definido pela opção de linha de comando :option:`-X presite=package.module <-X>` e pela variável de ambiente :envvar:`PYTHON_PRESITE`. A opção de linha de comando tem precedência.

source: Show total reference count at exit (excluding :term:`immortal` objects)?
pt_pt: Mostrar contagem total de referências na saída (excluindo objetos :term:`imortais`)?

source: Set to ``1`` by :option:`-X showrefcount <-X>` command line option.
pt_pt: Definido como ``1`` pela opção de linha de comando :option:`-X showrefcount <-X>`.

source: Needs a :ref:`debug build of Python <debug-build>` (the ``Py_REF_DEBUG`` macro must be defined).
pt_pt: Requer uma :ref:`compilação de depuração do Python <debug-build>` (a macro ``Py_REF_DEBUG`` deve estar definida).

source: Import the :mod:`site` module at startup?
pt_pt: Importar o módulo :mod:`site` no arranque?

source: If equal to zero, disable the import of the module site and the site-dependent manipulations of :data:`sys.path` that it entails.
pt_pt: Se for igual a zero, desative a importação do site do módulo e as manipulações dependentes do site de :data:`sys.path` que isso implica.

source: Also disable these manipulations if the :mod:`site` module is explicitly imported later (call :func:`site.main` if you want them to be triggered).
pt_pt: Desative também essas manipulações se o módulo :mod:`site` for importado explicitamente posteriormente (chame :func:`site.main` se quiser que elas sejam acionadas).

source: Set to ``0`` by the :option:`-S` command line option.
pt_pt: Definido como ``0`` pela opção de linha de comando :option:`-S`.

source: :data:`sys.flags.no_site <sys.flags>` is set to the inverted value of :c:member:`~PyConfig.site_import`.
pt_pt: :data:`sys.flags.no_site <sys.flags>` está definido para o valor invertido de :c:member:`~PyConfig.site_import`.

source: If non-zero, skip the first line of the :c:member:`PyConfig.run_filename` source.
pt_pt: Se diferente de zero, ignore a primeira linha da fonte :c:member:`PyConfig.run_filename`.

source: It allows the usage of non-Unix forms of ``#!cmd``. This is intended for a DOS specific hack only.
pt_pt: Permite a utilização de formas não Unix de ``#!cmd``. Isto destina-se apenas a um hack específico do DOS.

source: Set to ``1`` by the :option:`-x` command line option.
pt_pt: Definido como ``1`` pela opção de linha de comando :option:`-x`.

source: Encoding and encoding errors of :data:`sys.stdin`, :data:`sys.stdout` and :data:`sys.stderr` (but :data:`sys.stderr` always uses ``"backslashreplace"`` error handler).
pt_pt: Codificação e erros de codificação de :data:`sys.stdin`, :data:`sys.stdout` e :data:`sys.stderr` (mas :data:`sys.stderr` utiliza sempre o gestor de erros ``"backslashreplace"``).

source: Use the :envvar:`PYTHONIOENCODING` environment variable if it is non-empty.
pt_pt: Use a variável de ambiente :envvar:`PYTHONIOENCODING` se ela não estiver vazia.

source: Default encoding:
pt_pt: Codificação padrão:

source: ``"UTF-8"`` if :c:member:`PyPreConfig.utf8_mode` is non-zero.
pt_pt: ``"UTF-8"`` se :c:member:`PyPreConfig.utf8_mode` for diferente de zero.

source: Otherwise, use the :term:`locale encoding`.
pt_pt: Caso contrário, utilize a :term:`codificação de localidade.

source: Default error handler:
pt_pt: Tratamento de erros padrão:

source: On Windows: use ``"surrogateescape"``.
pt_pt: No Windows: use ``"surrogateescape"``.

source: ``"surrogateescape"`` if :c:member:`PyPreConfig.utf8_mode` is non-zero, or if the LC_CTYPE locale is "C" or "POSIX".
pt_pt: ``"surrogateescape"`` se :c:member:`PyPreConfig.utf8_mode` for diferente de zero, ou se a localidade LC_CTYPE for "C" ou "POSIX".

source: ``"strict"`` otherwise.
pt_pt: ``"strict"`` caso contrário.

source: See also :c:member:`PyConfig.legacy_windows_stdio`.
pt_pt: Veja também :c:member:`PyConfig.legacy_windows_stdio`.

source: Enable tracemalloc?
pt_pt: Ativar tracemalloc?

source: If non-zero, call :func:`tracemalloc.start` at startup.
pt_pt: Se diferente de zero, chame :func:`tracemalloc.start` na inicialização.

source: Set by :option:`-X tracemalloc=N <-X>` command line option and by the :envvar:`PYTHONTRACEMALLOC` environment variable.
pt_pt: Definido pela opção de linha de comando :option:`-X tracemalloc=N <-X>` e pela variável de ambiente :envvar:`PYTHONTRACEMALLOC`.

source: Enable the Linux ``perf`` profiler support?
pt_pt: Ativar o suporte ao perfilador ``perf`` do Linux?

source: If equals to ``1``, enable support for the Linux ``perf`` profiler.
pt_pt: Se for igual a ``1``, habilite o suporte para o profiler ``perf`` do Linux.

source: If equals to ``2``, enable support for the Linux ``perf`` profiler with DWARF JIT support.
pt_pt: Se for igual a ``2``, habilite o suporte para o profiler ``perf`` do Linux com suporte DWARF JIT.

source: Set to ``1`` by :option:`-X perf <-X>` command-line option and the :envvar:`PYTHONPERFSUPPORT` environment variable.
pt_pt: Defina como ``1`` pela opção de linha de comando :option:`-X perf <-X>` e pela variável de ambiente :envvar:`PYTHONPERFSUPPORT`.

source: Set to ``2`` by the :option:`-X perf_jit <-X>` command-line option and the :envvar:`PYTHON_PERF_JIT_SUPPORT` environment variable.
pt_pt: Defina como ``2`` pela opção de linha de comando :option:`-X perf_jit <-X>` e pela variável de ambiente :envvar:`PYTHON_PERF_JIT_SUPPORT`.

source: See :ref:`perf_profiling` for more information.
pt_pt: Consulte :ref:`perf_profiling` para obter mais informações.

source: Directory of the Python standard library.
pt_pt: Diretório da biblioteca padrão do Python.

source: Use :ref:`environment variables <using-on-envvars>`?
pt_pt: Utilizar :ref:`variáveis de ambiente <using-on-envvars>`?

source: If equals to zero, ignore the :ref:`environment variables <using-on-envvars>`.
pt_pt: Se for igual a zero, ignore as :ref:`variáveis de ambiente <using-on-envvars>`.

source: Set to ``0`` by the :option:`-E` environment variable.
pt_pt: Definido como ``0`` pela variável de ambiente :option:`-E`.

source: If non-zero, ``stdout`` and ``stderr`` will be redirected to the system log.
pt_pt: Se diferente de zero, ``stdout`` e ``stderr`` serão redirecionados para o log do sistema.

source: Only available on macOS 10.12 and later, and on iOS.
pt_pt: Disponível apenas no macOS 10.12 e posterior, e no iOS.

source: Default: ``0`` (don't use the system log) on macOS; ``1`` on iOS (use the system log).
pt_pt: Padrão: ``0`` (não usar o registo do sistema) no macOS; ``1`` no iOS (usar o registo do sistema).

source: If non-zero, add the user site directory to :data:`sys.path`.
pt_pt: Se diferente de zero, adicione o diretório do site do utilizador a :data:`sys.path`.

source: Set to ``0`` by the :option:`-s` and :option:`-I` command line options.
pt_pt: Definido como ``0`` pelas opções de linha de comando :option:`-s` e :option:`-I`.

source: Set to ``0`` by the :envvar:`PYTHONNOUSERSITE` environment variable.
pt_pt: Definido como ``0`` pela variável de ambiente :envvar:`PYTHONNOUSERSITE`.

source: Verbose mode. If greater than ``0``, print a message each time a module is imported, showing the place (filename or built-in module) from which it is loaded.
pt_pt: Modo detalhado. Se for maior que ``0``, imprima uma mensagem cada vez que um módulo for importado, mostrando o local (nome do ficheiro ou módulo incorporado) de onde ele é carregado.

source: If greater than or equal to ``2``, print a message for each file that is checked for when searching for a module. Also provides information on module cleanup at exit.
pt_pt: Se for maior ou igual a ``2``, imprima uma mensagem para cada ficheiro que é verificado durante a pesquisa de um módulo. Também fornece informações sobre a limpeza do módulo ao sair.

source: Incremented by the :option:`-v` command line option.
pt_pt: Aumentado pela opção de linha de comando :option:`-v`.

source: Set by the :envvar:`PYTHONVERBOSE` environment variable value.
pt_pt: Definido pelo valor da variável de ambiente :envvar:`PYTHONVERBOSE`.

source: Options of the :mod:`warnings` module to build warnings filters, lowest to highest priority: :data:`sys.warnoptions`.
pt_pt: Opções do módulo :mod:`warnings` para criar filtros de avisos, da prioridade mais baixa à mais alta: :data:`sys.warnoptions`.

source: The :mod:`warnings` module adds :data:`sys.warnoptions` in the reverse order: the last :c:member:`PyConfig.warnoptions` item becomes the first item of :data:`warnings.filters` which is checked first (highest priority).
pt_pt: O módulo :mod:`warnings` adiciona :data:`sys.warnoptions` na ordem inversa: o último item :c:member:`PyConfig.warnoptions` torna-se o primeiro item de :data:`warnings.filters`, que é verificado primeiro (prioridade mais alta).

source: The :option:`-W` command line options adds its value to :c:member:`~PyConfig.warnoptions`, it can be used multiple times.
pt_pt: A opção de linha de comando :option:`-W` adiciona o seu valor a :c:member:`~PyConfig.warnoptions`, podendo ser utilizada várias vezes.

source: The :envvar:`PYTHONWARNINGS` environment variable can also be used to add warning options. Multiple options can be specified, separated by commas (``,``).
pt_pt: A variável de ambiente :envvar:`PYTHONWARNINGS` também pode ser usada para adicionar opções de aviso. É possível especificar várias opções, separadas por vírgulas (``,``).

source: If equal to ``0``, Python won't try to write ``.pyc`` files on the import of source modules.
pt_pt: Se for igual a ``0``, o Python não tentará gravar ficheiros ``.pyc`` na importação de módulos de origem.

source: Set to ``0`` by the :option:`-B` command line option and the :envvar:`PYTHONDONTWRITEBYTECODE` environment variable.
pt_pt: Definido como ``0`` pela opção de linha de comando :option:`-B` e pela variável de ambiente :envvar:`PYTHONDONTWRITEBYTECODE`.

source: :data:`sys.dont_write_bytecode` is initialized to the inverted value of :c:member:`~PyConfig.write_bytecode`.
pt_pt: :data:`sys.dont_write_bytecode` é inicializado com o valor invertido de :c:member:`~PyConfig.write_bytecode`.

source: Values of the :option:`-X` command line options: :data:`sys._xoptions`.
pt_pt: Valores das opções da linha de comando :option:`-X`: :data:`sys._xoptions`.

source: If non-zero, write performance statistics at Python exit.
pt_pt: Se diferente de zero, grava estatísticas de desempenho ao sair do Python.

source: Need a special build with the ``Py_STATS`` macro: see :option:`--enable-pystats`.
pt_pt: Precisa de uma compilação especial com a macro ``Py_STATS``: consulte :option:`--enable-pystats`.

source: If :c:member:`~PyConfig.parse_argv` is non-zero, :c:member:`~PyConfig.argv` arguments are parsed the same way the regular Python parses :ref:`command line arguments <using-on-cmdline>`, and Python arguments are stripped from :c:member:`~PyConfig.argv`.
pt_pt: Se :c:member:`~PyConfig.parse_argv` for diferente de zero, os argumentos :c:member:`~PyConfig.argv` são analisados da mesma forma que o Python normal analisa :ref:`argumentos da linha de comando <using-on-cmdline>`, e os argumentos do Python são removidos de :c:member:`~PyConfig.argv`.

source: The :c:member:`~PyConfig.xoptions` options are parsed to set other options: see the :option:`-X` command line option.
pt_pt: As opções :c:member:`~PyConfig.xoptions` são analisadas para definir outras opções: consulte a opção de linha de comando :option:`-X`.

source: The ``show_alloc_count`` field has been removed.
pt_pt: O campo ``show_alloc_count`` foi removido.

source: Initialization with PyConfig
pt_pt: Inicialização com PyConfig

source: Initializing the interpreter from a populated configuration struct is handled by calling :c:func:`Py_InitializeFromConfig`.
pt_pt: A inicialização do interpretador a partir de uma estrutura de configuração preenchida é feita através da chamada :c:func:`Py_InitializeFromConfig`.

source: If :c:func:`PyImport_FrozenModules`, :c:func:`PyImport_AppendInittab` or :c:func:`PyImport_ExtendInittab` are used, they must be set or called after Python preinitialization and before the Python initialization. If Python is initialized multiple times, :c:func:`PyImport_AppendInittab` or :c:func:`PyImport_ExtendInittab` must be called before each Python initialization.
pt_pt: Se :c:func:`PyImport_FrozenModules`, :c:func:`PyImport_AppendInittab` ou :c:func:`PyImport_ExtendInittab` forem usados, eles devem ser definidos ou chamados após a pré-inicialização do Python e antes da inicialização do Python. Se o Python for inicializado várias vezes, :c:func:`PyImport_AppendInittab` ou :c:func:`PyImport_ExtendInittab` devem ser chamados antes de cada inicialização do Python.

source: The current configuration (``PyConfig`` type) is stored in ``PyInterpreterState.config``.
pt_pt: A configuração atual (tipo ``PyConfig``) é armazenada em ``PyInterpreterState.config``.

source: Example setting the program name::
pt_pt: Exemplo de definição do nome do programa::

source: void init_python(void) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); /* Set the program name. Implicitly preinitialize Python. */ status = PyConfig_SetString(&config, &config.program_name, L"/path/to/my_program"); if (PyStatus_Exception(status)) { goto exception; } status = Py_InitializeFromConfig(&config); if (PyStatus_Exception(status)) { goto exception; } PyConfig_Clear(&config); return; exception: PyConfig_Clear(&config); Py_ExitStatusException(status); }
pt_pt: void init_python(void) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); /* Define o nome do programa. Pré-inicializa implicitamenta o Python. */ status = PyConfig_SetString(&config, &config.program_name, L"/path/to/my_program"); if (PyStatus_Exception(status)) { goto exception; } status = Py_InitializeFromConfig(&config); if (PyStatus_Exception(status)) { goto exception; } PyConfig_Clear(&config); return; exception: PyConfig_Clear(&config); Py_ExitStatusException(status); }

source: More complete example modifying the default configuration, read the configuration, and then override some parameters. Note that since 3.11, many parameters are not calculated until initialization, and so values cannot be read from the configuration structure. Any values set before initialize is called will be left unchanged by initialization::
pt_pt: Exemplo mais completo modificando a configuração padrão, lendo a configuração e, em seguida, substituindo alguns parâmetros. Observe que, desde a versão 3.11, muitos parâmetros não são calculados até a inicialização e, portanto, os valores não podem ser lidos da estrutura de configuração. Quaisquer valores definidos antes da chamada da inicialização permanecerão inalterados pela inicialização::

source: PyStatus init_python(const char *program_name) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); /* Set the program name before reading the configuration (decode byte string from the locale encoding). Implicitly preinitialize Python. */ status = PyConfig_SetBytesString(&config, &config.program_name, program_name); if (PyStatus_Exception(status)) { goto done; } /* Read all configuration at once */ status = PyConfig_Read(&config); if (PyStatus_Exception(status)) { goto done; } /* Specify sys.path explicitly */ /* If you want to modify the default set of paths, finish initialization first and then use PySys_GetObject("path") */ config.module_search_paths_set = 1; status = PyWideStringList_Append(&config.module_search_paths, L"/path/to/stdlib"); if (PyStatus_Exception(status)) { goto done; } status = PyWideStringList_Append(&config.module_search_paths, L"/path/to/more/modules"); if (PyStatus_Exception(status)) { goto done; } /* Override executable computed by PyConfig_Read() */ status = PyConfig_SetString(&config, &config.executable, L"/path/to/my_executable"); if (PyStatus_Exception(status)) { goto done; } status = Py_InitializeFromConfig(&config); done: PyConfig_Clear(&config); return status; }
pt_pt: PyStatus init_python(const char *program_name) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); /* Define o nome do programa antes de ler a configuração (descodifica a string de bytes da codificação local). Pré-inicializa implicitamente o Python. */ status = PyConfig_SetBytesString(&config, &config.program_name, program_name); if (PyStatus_Exception(status)) { goto done; } /* Leia toda a configuração de uma só vez */ status = PyConfig_Read(&config); if (PyStatus_Exception(status)) { goto done; } /* Especifica explicitamente sys.path */ /* Se pretender modificar o conjunto padrão de caminhos, Conclua a inicialização primeiro e, em seguida, utilize PySys_GetObject("path") */ config.module_search_paths_set = 1; status = PyWideStringList_Append(&config.module_search_paths, L"/path/to/stdlib"); if (PyStatus_Exception(status)) { goto done; } status = PyWideStringList_Append(&config.module_search_paths, L"/path/to/more/modules"); if (PyStatus_Exception(status)) { goto done; } /* Substitui o executável calculado por PyConfig_Read() */ status = PyConfig_SetString(&config, &config.executable, L"/path/to/my_executable"); if (PyStatus_Exception(status)) { goto done; } status = Py_InitializeFromConfig(&config); done: PyConfig_Clear(&config); return status; }

source: Isolated Configuration
pt_pt: Configuração isolada

source: :c:func:`PyPreConfig_InitIsolatedConfig` and :c:func:`PyConfig_InitIsolatedConfig` functions create a configuration to isolate Python from the system. For example, to embed Python into an application.
pt_pt: As funções :c:func:`PyPreConfig_InitIsolatedConfig` e :c:func:`PyConfig_InitIsolatedConfig` criam uma configuração para isolar o Python do sistema. Por exemplo, para incorporar o Python numa aplicação.

source: This configuration ignores global configuration variables, environment variables, command line arguments (:c:member:`PyConfig.argv` is not parsed) and user site directory. The C standard streams (ex: ``stdout``) and the LC_CTYPE locale are left unchanged. Signal handlers are not installed.
pt_pt: Esta configuração ignora variáveis de configuração globais, variáveis de ambiente, argumentos de linha de comando (:c:member:`PyConfig.argv` não é analisado) e diretório do site do utilizador. Os fluxos padrão C (ex: ``stdout``) e a localidade LC_CTYPE permanecem inalterados. Os manipuladores de sinal não são instalados.

source: Configuration files are still used with this configuration to determine paths that are unspecified. Ensure :c:member:`PyConfig.home` is specified to avoid computing the default path configuration.
pt_pt: Os ficheiros de configuração ainda são usados com esta configuração para determinar caminhos que não estão especificados. Certifique-se de que :c:member:`PyConfig.home` está especificado para evitar o cálculo da configuração do caminho padrão.

source: Python Configuration
pt_pt: Configuração Python

source: :c:func:`PyPreConfig_InitPythonConfig` and :c:func:`PyConfig_InitPythonConfig` functions create a configuration to build a customized Python which behaves as the regular Python.
pt_pt: As funções :c:func:`PyPreConfig_InitPythonConfig` e :c:func:`PyConfig_InitPythonConfig` criam uma configuração para construir um Python personalizado que se comporta como o Python normal.

source: Environments variables and command line arguments are used to configure Python, whereas global configuration variables are ignored.
pt_pt: Variáveis de ambiente e argumentos de linha de comando são usados para configurar o Python, enquanto variáveis de configuração globais são ignoradas.

source: This function enables C locale coercion (:pep:`538`) and :ref:`Python UTF-8 Mode <utf8-mode>` (:pep:`540`) depending on the LC_CTYPE locale, :envvar:`PYTHONUTF8` and :envvar:`PYTHONCOERCECLOCALE` environment variables.
pt_pt: Esta função permite a coerção de localidade C (:pep:`538`) e :ref:`Modo UTF-8 do Python <utf8-mode>` (:pep:`540`) dependendo da localidade LC_CTYPE, das variáveis de ambiente :envvar:`PYTHONUTF8` e :envvar:`PYTHONCOERCECLOCALE`.

source: Python Path Configuration
pt_pt: Configuração do caminho do Python

source: :c:type:`PyConfig` contains multiple fields for the path configuration:
pt_pt: :c:type:`PyConfig` contém vários campos para a configuração do caminho:

source: Path configuration inputs:
pt_pt: Entradas de configuração do caminho:

source: current working directory: to get absolute paths
pt_pt: diretório de trabalho atual: para obter caminhos absolutos

source: ``PATH`` environment variable to get the program full path (from :c:member:`PyConfig.program_name`)
pt_pt: Variável de ambiente ``PATH`` para obter o caminho completo do programa (de :c:member:`PyConfig.program_name`)

source: ``__PYVENV_LAUNCHER__`` environment variable
pt_pt: Variável de ambiente ``__PYVENV_LAUNCHER__``

source: (Windows only) Application paths in the registry under "Software\Python\PythonCore\X.Y\PythonPath" of HKEY_CURRENT_USER and HKEY_LOCAL_MACHINE (where X.Y is the Python version).
pt_pt: (Apenas Windows) Caminhos de aplicação no registo em «Software\Python\PythonCore\X.Y\PythonPath» de HKEY_CURRENT_USER e HKEY_LOCAL_MACHINE (onde X.Y é a versão do Python).

source: Path configuration output fields:
pt_pt: Campos de saída da configuração do caminho:

source: If at least one "output field" is not set, Python calculates the path configuration to fill unset fields. If :c:member:`~PyConfig.module_search_paths_set` is equal to ``0``, :c:member:`~PyConfig.module_search_paths` is overridden and :c:member:`~PyConfig.module_search_paths_set` is set to ``1``.
pt_pt: Se pelo menos um «campo de saída» não estiver definido, o Python calcula a configuração do caminho para preencher os campos não definidos. Se :c:member:`~PyConfig.module_search_paths_set` for igual a ``0``, :c:member:`~PyConfig.module_search_paths` é substituído e :c:member:`~PyConfig.module_search_paths_set` é definido como ``1``.
