Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/iter.po
Languages: pt_pt

source: Iterator Protocol
pt_pt: Protocolo Iterador

source: There are two functions specifically for working with iterators.
pt_pt: Existem duas funções específicas para trabalhar com iteradores.

source: Return non-zero if the object *o* can be safely passed to :c:func:`PyIter_NextItem` and ``0`` otherwise. This function always succeeds.
pt_pt: Retorna um valor diferente de zero se o objeto *o* puder ser passado com segurança para :c:func:`PyIter_NextItem` e ``0`` caso contrário. Esta função é sempre bem-sucedida.

source: Return non-zero if the object *o* provides the :class:`AsyncIterator` protocol, and ``0`` otherwise. This function always succeeds.
pt_pt: Retorna um valor diferente de zero se o objeto *o* fornecer o protocolo :class:`AsyncIterator` e ``0`` caso contrário. Esta função é sempre bem-sucedida.

source: Return ``1`` and set *item* to a :term:`strong reference` of the next value of the iterator *iter* on success. Return ``0`` and set *item* to ``NULL`` if there are no remaining values. Return ``-1``, set *item* to ``NULL`` and set an exception on error.
pt_pt: Retorna ``1`` e define *item* como uma :term:`referência forte` do próximo valor do iterador *iter* em caso de sucesso. Retorna ``0`` e define *item* como ``NULL`` se não houver valores restantes. Retorna ``-1``, define *item* como ``NULL`` e define uma exceção em caso de erro.

source: This is an older version of :c:func:`!PyIter_NextItem`, which is retained for backwards compatibility. Prefer :c:func:`PyIter_NextItem`.
pt_pt: Esta é uma versão mais antiga de :c:func:`!PyIter_NextItem`, que é mantida para compatibilidade com versões anteriores. Prefira :c:func:`PyIter_NextItem`.

source: Return the next value from the iterator *o*. The object must be an iterator according to :c:func:`PyIter_Check` (it is up to the caller to check this). If there are no remaining values, returns ``NULL`` with no exception set. If an error occurs while retrieving the item, returns ``NULL`` and passes along the exception.
pt_pt: Retorna o próximo valor do iterador *o*. O objeto deve ser um iterador de acordo com :c:func:`PyIter_Check` (cabe ao chamador verificar isso). Se não houver valores restantes, retorna ``NULL`` sem definir nenhuma exceção. Se ocorrer um erro ao recuperar o item, retorna ``NULL`` e passa a exceção.

source: The enum value used to represent different results of :c:func:`PyIter_Send`.
pt_pt: O valor enumerado usado para representar diferentes resultados de :c:func:`PyIter_Send`.

source: Sends the *arg* value into the iterator *iter*. Returns:
pt_pt: Envia o valor *arg* para o iterador *iter*. Retorna:

source: ``PYGEN_RETURN`` if iterator returns. Return value is returned via *presult*.
pt_pt: ``PYGEN_RETURN`` se o iterador retornar. O valor de retorno é retornado via *presult*.

source: ``PYGEN_NEXT`` if iterator yields. Yielded value is returned via *presult*.
pt_pt: ``PYGEN_NEXT`` se o iterador produzir um resultado. O valor produzido é retornado através de *presult*.

source: ``PYGEN_ERROR`` if iterator has raised and exception. *presult* is set to ``NULL``.
pt_pt: ``PYGEN_ERROR`` se o iterador tiver levantado uma exceção. *presult* é definido como ``NULL``.
