Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/marshal.po
Languages: pt_pt

source: Data marshalling support
pt_pt: Suporte à organização de dados

source: These routines allow C code to work with serialized objects using the same data format as the :mod:`marshal` module. There are functions to write data into the serialization format, and additional functions that can be used to read the data back. Files used to store marshalled data must be opened in binary mode.
pt_pt: Essas rotinas permitem que o código C trabalhe com objetos serializados usando o mesmo formato de dados que o módulo :mod:`marshal`. Existem funções para gravar dados no formato de serialização e funções adicionais que podem ser usadas para ler os dados novamente. Os ficheiros usados para armazenar dados marshalled devem ser abertos no modo binário.

source: Numeric values are stored with the least significant byte first.
pt_pt: Os valores numéricos são armazenados com o byte menos significativo primeiro.

source: The module supports several versions of the data format; see the :py:mod:`Python module documentation <marshal>` for details.
pt_pt: O módulo suporta várias versões do formato de dados; consulte a :py:mod:`documentação do módulo Python <marshal>` para obter detalhes.

source: The current format version. See :py:data:`marshal.version`.
pt_pt: A versão atual do formato. Veja :py:data:`marshal.version`.

source: Marshal a :c:expr:`long` integer, *value*, to *file*. This will only write the least-significant 32 bits of *value*; regardless of the size of the native :c:expr:`long` type. *version* indicates the file format.
pt_pt: Organize um inteiro :c:expr:`long`, *valor*, para *ficheiro*. Isto irá escrever apenas os 32 bits menos significativos de *valor*, independentemente do tamanho do tipo nativo :c:expr:`long`. *versão* indica o formato do ficheiro.

source: This function can fail, in which case it sets the error indicator. Use :c:func:`PyErr_Occurred` to check for that.
pt_pt: Esta função pode falhar, caso em que define o indicador de erro. Use :c:func:`PyErr_Occurred` para verificar isso.

source: Marshal a Python object, *value*, to *file*. *version* indicates the file format.
pt_pt: Organize um objeto Python, *valor*, em *ficheiro*. *versão* indica o formato do ficheiro.

source: Return a bytes object containing the marshalled representation of *value*. *version* indicates the file format.
pt_pt: Retorna um objeto bytes contendo a representação marshalled de *value*. *version* indica o formato do ficheiro.

source: The following functions allow marshalled values to be read back in.
pt_pt: As seguintes funções permitem que os valores marshalled sejam lidos novamente.

source: Return a C :c:expr:`long` from the data stream in a :c:expr:`FILE*` opened for reading. Only a 32-bit value can be read in using this function, regardless of the native size of :c:expr:`long`.
pt_pt: Retorna um C :c:expr:`long` do fluxo de dados num :c:expr:`FILE*` aberto para leitura. Apenas um valor de 32 bits pode ser lido usando esta função, independentemente do tamanho nativo de :c:expr:`long`.

source: On error, sets the appropriate exception (:exc:`EOFError`) and returns ``-1``.
pt_pt: Em caso de erro, define a exceção apropriada (:exc:`EOFError`) e retorna ``-1``.

source: Return a C :c:expr:`short` from the data stream in a :c:expr:`FILE*` opened for reading. Only a 16-bit value can be read in using this function, regardless of the native size of :c:expr:`short`.
pt_pt: Retorna um C :c:expr:`short` do fluxo de dados num :c:expr:`FILE*` aberto para leitura. Apenas um valor de 16 bits pode ser lido usando esta função, independentemente do tamanho nativo de :c:expr:`short`.

source: Return a Python object from the data stream in a :c:expr:`FILE*` opened for reading.
pt_pt: Retorna um objeto Python do fluxo de dados em um :c:expr:`FILE*` aberto para leitura.

source: On error, sets the appropriate exception (:exc:`EOFError`, :exc:`ValueError` or :exc:`TypeError`) and returns ``NULL``.
pt_pt: Em caso de erro, define a exceção apropriada (:exc:`EOFError`, :exc:`ValueError` ou :exc:`TypeError`) e retorna ``NULL``.

source: Return a Python object from the data stream in a byte buffer containing *len* bytes pointed to by *data*.
pt_pt: Retorna um objeto Python do fluxo de dados num buffer de bytes contendo *len* bytes apontados por *data*.
