Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/unicode.po
Languages: pt_pt

source: The hex representation of a C pointer. Mostly equivalent to ``printf("%p")`` except that it is guaranteed to start with the literal ``0x`` regardless of what the platform's ``printf`` yields.
pt_pt: A representação hexadecimal de um ponteiro C. Maioritariamente equivalente a ``printf("%p")`` exceto que é garantido que começa com o literal ``0x`` independentemente do que o ``printf`` da plataforma produz.

source: The result of calling :func:`ascii`.
pt_pt: O resultado de chamar :func:`ascii`.

source: A Unicode object.
pt_pt: Um objeto Unicode.

source: :c:expr:`PyObject*`, :c:expr:`const char*` or :c:expr:`const wchar_t*`
pt_pt: :c:expr:`PyObject*`, :c:expr:`const char*` ou :c:expr:`const wchar_t*`

source: A Unicode object (which may be ``NULL``) and a null-terminated C character array as a second parameter (which will be used, if the first parameter is ``NULL``).
pt_pt: Um objeto Unicode (que pode ser ``NULL``) e uma matriz de caracteres C terminada por nulo como segundo parâmetro (que será usada, se o primeiro parâmetro for ``NULL``).

source: The result of calling :c:func:`PyObject_Str`.
pt_pt: O resultado de chamar :c:func:`PyObject_Str`.

source: The result of calling :c:func:`PyObject_Repr`.
pt_pt: O resultado de chamar :c:func:`PyObject_Repr`.

source: Get the fully qualified name of an object type; call :c:func:`PyType_GetFullyQualifiedName`.
pt_pt: Obtém o nome totalmente qualificado de um tipo de objeto; chama :c:func:`PyType_GetFullyQualifiedName`.

source: Similar to ``T`` format, but use a colon (``:``) as separator between the module name and the qualified name.
pt_pt: Semelhante ao formato ``T``, mas usa dois pontos (``:``) como separador entre o nome do módulo e o nome qualificado.

source: Get the fully qualified name of a type; call :c:func:`PyType_GetFullyQualifiedName`.
pt_pt: Obtém o nome totalmente qualificado de um tipo; chama :c:func:`PyType_GetFullyQualifiedName`.

source: Similar to ``N`` format, but use a colon (``:``) as separator between the module name and the qualified name.
pt_pt: Semelhante ao formato ``N``, mas usa dois pontos (``:``) como separador entre o nome do módulo e o nome qualificado.

source: The width formatter unit is number of characters rather than bytes. The precision formatter unit is number of bytes or :c:type:`wchar_t` items (if the length modifier ``l`` is used) for ``"%s"`` and ``"%V"`` (if the ``PyObject*`` argument is ``NULL``), and a number of characters for ``"%A"``, ``"%U"``, ``"%S"``, ``"%R"`` and ``"%V"`` (if the ``PyObject*`` argument is not ``NULL``).
pt_pt: A unidade do formatador de largura é o número de caracteres em vez de bytes. A unidade do formatador de precisão é o número de bytes ou itens :c:type:`wchar_t` (se o modificador de comprimento ``l`` for usado) para ``"%s"`` e ``"%V"`` (se o argumento ``PyObject*`` for ``NULL``), e um número de caracteres para ``"%A"``, ``"%U"``, ``"%S"``, ``"%R"`` e ``"%V"`` (se o argumento ``PyObject*`` não for ``NULL``).

source: Unlike to C :c:func:`printf` the ``0`` flag has effect even when a precision is given for integer conversions (``d``, ``i``, ``u``, ``o``, ``x``, or ``X``).
pt_pt: Ao contrário do C :c:func:`printf`, a flag ``0`` tem efeito mesmo quando uma precisão é dada para conversões inteiras (``d``, ``i``, ``u``, ``o``, ``x``, ou ``X``).

source: Support for ``"%lld"`` and ``"%llu"`` added.
pt_pt: Suporte para ``"%lld"`` e ``"%llu"`` adicionado.

source: Support for ``"%li"``, ``"%lli"`` and ``"%zi"`` added.
pt_pt: Suporte para ``"%li"``, ``"%lli"`` e ``"%zi"`` adicionado.

source: Support width and precision formatter for ``"%s"``, ``"%A"``, ``"%U"``, ``"%V"``, ``"%S"``, ``"%R"`` added.
pt_pt: Suporte para formatador de largura e precisão para ``"%s"``, ``"%A"``, ``"%U"``, ``"%V"``, ``"%S"``, ``"%R"`` adicionado.

source: Support for conversion specifiers ``o`` and ``X``. Support for length modifiers ``j`` and ``t``. Length modifiers are now applied to all integer conversions. Length modifier ``l`` is now applied to conversion specifiers ``s`` and ``V``. Support for variable width and precision ``*``. Support for flag ``-``.
pt_pt: Suporte para especificadores de conversão ``o`` e ``X``. Suporte para modificadores de comprimento ``j`` e ``t``. Os modificadores de comprimento são agora aplicados a todas as conversões inteiras. O modificador de comprimento ``l`` é agora aplicado aos especificadores de conversão ``s`` e ``V``. Suporte para largura e precisão variáveis ``*``. Suporte para a flag ``-``.

source: An unrecognized format character now sets a :exc:`SystemError`. In previous versions it caused all the rest of the format string to be copied as-is to the result string, and any extra arguments discarded.
pt_pt: Um caractere de formato não reconhecido agora define um :exc:`SystemError`. Nas versões anteriores, causava que todo o resto da cadeia de formato fosse copiado como está para a cadeia de resultado, e quaisquer argumentos extra fossem descartados.

source: Support for ``%T``, ``%#T``, ``%N`` and ``%#N`` formats added.
pt_pt: Suporte para os formatos ``%T``, ``%#T``, ``%N`` e ``%#N`` adicionado.

source: Identical to :c:func:`PyUnicode_FromFormat` except that it takes exactly two arguments.
pt_pt: Idêntico a :c:func:`PyUnicode_FromFormat` exceto que recebe exatamente dois argumentos.

source: Copy an instance of a Unicode subtype to a new true Unicode object if necessary. If *obj* is already a true Unicode object (not a subtype), return a new :term:`strong reference` to the object.
pt_pt: Copia uma instância de um subtipo Unicode para um novo objeto Unicode verdadeiro, se necessário. Se *obj* já for um objeto Unicode verdadeiro (não um subtipo), retorna uma nova :term:`referência forte` para o objeto.

source: Objects other than Unicode or its subtypes will cause a :exc:`TypeError`.
pt_pt: Objetos que não sejam Unicode ou os seus subtipos causarão um :exc:`TypeError`.

source: Create a Unicode Object from the given Unicode code point *ordinal*.
pt_pt: Cria um Objeto Unicode a partir do ponto de código Unicode dado *ordinal*.

source: The ordinal must be in ``range(0x110000)``. A :exc:`ValueError` is raised in the case it is not.
pt_pt: O ordinal deve estar em ``range(0x110000)``. Um :exc:`ValueError` é levantado caso não esteja.

source: Decode an encoded object *obj* to a Unicode object.
pt_pt: Descodifica um objeto codificado *obj* para um objeto Unicode.

source: :class:`bytes`, :class:`bytearray` and other :term:`bytes-like objects <bytes-like object>` are decoded according to the given *encoding* and using the error handling defined by *errors*. Both can be ``NULL`` to have the interface use the default values (see :ref:`builtincodecs` for details).
pt_pt: :class:`bytes`, :class:`bytearray` e outros :term:`objeto semelhante a bytes <bytes-like object>` são descodificados de acordo com a *codificação* dada e usando o tratamento de erros definido por *errors*. Ambos podem ser ``NULL`` para que a interface use os valores predefinidos (ver :ref:`builtincodecs` para detalhes).

source: All other objects, including Unicode objects, cause a :exc:`TypeError` to be set.
pt_pt: Todos os outros objetos, incluindo objetos Unicode, causam um :exc:`TypeError` a ser definido.

source: The API returns ``NULL`` if there was an error. The caller is responsible for decref'ing the returned objects.
pt_pt: A API retorna ``NULL`` se houver um erro. O chamador é responsável por decref'ing os objetos retornados.

source: Append the string *right* to the end of *p_left*. *p_left* must point to a :term:`strong reference` to a Unicode object; :c:func:`!PyUnicode_Append` releases ("steals") this reference.
pt_pt: Acrescenta a cadeia de caracteres *right* ao final de *p_left*. *p_left* deve apontar para uma :term:`referência forte` a um objeto Unicode; :c:func:`!PyUnicode_Append` libera ("rouba") esta referência.

source: On error, set *\*p_left* to ``NULL`` and set an exception.
pt_pt: Em caso de erro, define *\*p_left* para ``NULL`` e define uma exceção.

source: On success, set *\*p_left* to a new strong reference to the result.
pt_pt: Em caso de sucesso, define *\*p_left* para uma nova referência forte ao resultado.

source: The function is similar to :c:func:`PyUnicode_Append`, with the only difference being that it decrements the reference count of *right* by one.
pt_pt: A função é semelhante a :c:func:`PyUnicode_Append`, com a única diferença de que decrementa a contagem de referências de *right* em um.

source: Return a mapping suitable for decoding a custom single-byte encoding. Given a Unicode string *string* of up to 256 characters representing an encoding table, returns either a compact internal mapping object or a dictionary mapping character ordinals to byte values. Raises a :exc:`TypeError` and return ``NULL`` on invalid input.
pt_pt: Retorna um mapeamento adequado para decodificar uma codificação personalizada de um byte. Dada uma cadeia de caracteres Unicode *string* de até 256 caracteres representando uma tabela de codificação, retorna um objeto de mapeamento interno compacto ou um dicionário mapeando ordinais de caracteres para valores de byte. Levanta um :exc:`TypeError` e retorna ``NULL`` em entrada inválida.

source: Return the name of the default string encoding, ``"utf-8"``. See :func:`sys.getdefaultencoding`.
pt_pt: Retorna o nome da codificação de cadeias de caracteres predefinida, ``"utf-8"``. Veja :func:`sys.getdefaultencoding`.

source: The returned string does not need to be freed, and is valid until interpreter shutdown.
pt_pt: A cadeia de caracteres retornada não precisa de ser libertada e é válida até ao encerramento do interpretador.

source: Return the length of the Unicode object, in code points.
pt_pt: Retorna o comprimento do objeto Unicode, em pontos de código.

source: On error, set an exception and return ``-1``.
pt_pt: Em caso de erro, define uma exceção e retorna ``-1``.

source: Copy characters from one Unicode object into another. This function performs character conversion when necessary and falls back to :c:func:`!memcpy` if possible. Returns ``-1`` and sets an exception on error, otherwise returns the number of copied characters.
pt_pt: Copia caracteres de um objeto Unicode para outro. Esta função realiza conversão de caracteres quando necessário e recorre a :c:func:`!memcpy` se possível. Retorna ``-1`` e define uma exceção em caso de erro, caso contrário retorna o número de caracteres copiados.

source: The string must not have been “used” yet. See :c:func:`PyUnicode_New` for details.
pt_pt: A cadeia de caracteres não deve ter sido "usada" ainda. Veja :c:func:`PyUnicode_New` para detalhes.

source: Resize a Unicode object *\*unicode* to the new *length* in code points.
pt_pt: Redimensiona um objeto Unicode *\*unicode* para o novo *length* em pontos de código.

source: Try to resize the string in place (which is usually faster than allocating a new string and copying characters), or create a new string.
pt_pt: Tenta redimensionar a cadeia de caracteres no local (o que é geralmente mais rápido do que alocar uma nova cadeia de caracteres e copiar caracteres), ou cria uma nova cadeia de caracteres.

source: *\*unicode* is modified to point to the new (resized) object and ``0`` is returned on success. Otherwise, ``-1`` is returned and an exception is set, and *\*unicode* is left untouched.
pt_pt: *\*unicode* é modificado para apontar para o novo objeto (redimensionado) e ``0`` é retornado em caso de sucesso. Caso contrário, ``-1`` é retornado e uma exceção é definida, e *\*unicode* é deixado inalterado.

source: The function doesn't check string content, the result may not be a string in canonical representation.
pt_pt: A função não verifica o conteúdo da cadeia de caracteres, o resultado pode não ser uma cadeia de caracteres em representação canónica.

source: Fill a string with a character: write *fill_char* into ``unicode[start:start+length]``.
pt_pt: Preenche uma cadeia de caracteres com um carácter: escreve *fill_char* em ``unicode[start:start+length]``.

source: Fail if *fill_char* is bigger than the string maximum character, or if the string has more than 1 reference.
pt_pt: Falha se *fill_char* for maior do que o carácter máximo da cadeia de caracteres, ou se a cadeia de caracteres tiver mais do que 1 referência.

source: Return the number of written character, or return ``-1`` and raise an exception on error.
pt_pt: Retorna o número de caracteres escritos, ou retorna ``-1`` e levanta uma exceção em caso de erro.

source: Write a *character* to the string *unicode* at the zero-based *index*. Return ``0`` on success, ``-1`` on error with an exception set.
pt_pt: Escreve um *character* na cadeia de caracteres *unicode* no *index* com base zero. Retorna ``0`` em caso de sucesso, ``-1`` em caso de erro com uma exceção definida.

source: Read a character from a string. This function checks that *unicode* is a Unicode object and the index is not out of bounds, in contrast to :c:func:`PyUnicode_READ_CHAR`, which performs no error checking.
pt_pt: Lê um carácter de uma cadeia de caracteres. Esta função verifica que *unicode* é um objeto Unicode e que o índice não está fora dos limites, ao contrário de :c:func:`PyUnicode_READ_CHAR`, que não efetua verificações de erro.

source: Return character on success, ``-1`` on error with an exception set.
pt_pt: Retorna o caractere em caso de sucesso, ``-1`` em caso de erro com uma exceção definida.

source: Return a substring of *unicode*, from character index *start* (included) to character index *end* (excluded). Negative indices are not supported. On error, set an exception and return ``NULL``.
pt_pt: Retorna uma subcadeia de *unicode*, do índice de caractere *start* (incluído) ao índice de caractere *end* (excluído). Índices negativos não são suportados. Em caso de erro, define uma exceção e retorna ``NULL``.

source: Copy the string *unicode* into a UCS4 buffer, including a null character, if *copy_null* is set. Returns ``NULL`` and sets an exception on error (in particular, a :exc:`SystemError` if *buflen* is smaller than the length of *unicode*). *buffer* is returned on success.
pt_pt: Copia a cadeia de caracteres *unicode* para um buffer UCS4, incluindo um carácter nulo, se *copy_null* estiver definido. Retorna ``NULL`` e define uma exceção em caso de erro (em particular, um :exc:`SystemError` se *buflen* for menor do que o comprimento de *unicode*). *buffer* é retornado em caso de sucesso.

source: Copy the string *unicode* into a new UCS4 buffer that is allocated using :c:func:`PyMem_Malloc`. If this fails, ``NULL`` is returned with a :exc:`MemoryError` set. The returned buffer always has an extra null code point appended.
pt_pt: Copia a cadeia de caracteres *unicode* para um novo buffer UCS4 que é alocado usando :c:func:`PyMem_Malloc`. Se isto falhar, ``NULL`` é retornado com um :exc:`MemoryError` definido. O buffer retornado tem sempre um ponto de código nulo extra anexado.

source: Locale Encoding
pt_pt: Codificação Local

source: The current locale encoding can be used to decode text from the operating system.
pt_pt: A codificação local atual pode ser usada para descodificar texto do sistema operativo.

source: Decode a string from UTF-8 on Android and VxWorks, or from the current locale encoding on other platforms. The supported error handlers are ``"strict"`` and ``"surrogateescape"`` (:pep:`383`). The decoder uses ``"strict"`` error handler if *errors* is ``NULL``. *str* must end with a null character but cannot contain embedded null characters.
pt_pt: Descodifica uma cadeia de caracteres de UTF-8 no Android e VxWorks, ou da codificação local atual noutras plataformas. Os gestores de erro suportados são ``"strict"`` e ``"surrogateescape"`` (:pep:`383`). O descodificador usa o gestor de erro ``"strict"`` se *errors* for ``NULL``. *str* deve terminar com um caractere nulo, mas não pode conter caracteres nulos incorporados.

source: Use :c:func:`PyUnicode_DecodeFSDefaultAndSize` to decode a string from the :term:`filesystem encoding and error handler`.
pt_pt: Use :c:func:`PyUnicode_DecodeFSDefaultAndSize` para descodificar uma cadeia de caracteres da :term:`codificação do sistema de ficheiros e manipulador de erros`.

source: This function ignores the :ref:`Python UTF-8 Mode <utf8-mode>`.
pt_pt: Esta função ignora o :ref:`Modo UTF-8 do Python <utf8-mode>`.

source: The :c:func:`Py_DecodeLocale` function.
pt_pt: A função :c:func:`Py_DecodeLocale`.

source: The function now also uses the current locale encoding for the ``surrogateescape`` error handler, except on Android. Previously, :c:func:`Py_DecodeLocale` was used for the ``surrogateescape``, and the current locale encoding was used for ``strict``.
pt_pt: A função agora também usa a codificação local atual para o manipulador de erros ``surrogateescape``, exceto no Android. Anteriormente, :c:func:`Py_DecodeLocale` era usado para o ``surrogateescape``, e a codificação local atual era usada para ``strict``.

source: Similar to :c:func:`PyUnicode_DecodeLocaleAndSize`, but compute the string length using :c:func:`!strlen`.
pt_pt: Semelhante a :c:func:`PyUnicode_DecodeLocaleAndSize`, mas calcula o comprimento da cadeia de caracteres usando :c:func:`!strlen`.

source: Encode a Unicode object to UTF-8 on Android and VxWorks, or to the current locale encoding on other platforms. The supported error handlers are ``"strict"`` and ``"surrogateescape"`` (:pep:`383`). The encoder uses ``"strict"`` error handler if *errors* is ``NULL``. Return a :class:`bytes` object. *unicode* cannot contain embedded null characters.
pt_pt: Codifica um objeto Unicode para UTF-8 no Android e VxWorks, ou para a codificação local atual noutras plataformas. Os gestores de erro suportados são ``"strict"`` e ``"surrogateescape"`` (:pep:`383`). O codificador usa o gestor de erro ``"strict"`` se *errors* for ``NULL``. Retorna um objeto :class:`bytes`. *unicode* não pode conter caracteres nulos incorporados.

source: Use :c:func:`PyUnicode_EncodeFSDefault` to encode a string to the :term:`filesystem encoding and error handler`.
pt_pt: Use :c:func:`PyUnicode_EncodeFSDefault` para codificar uma cadeia de caracteres para a :term:`codificação do sistema de ficheiros e manipulador de erros`.

source: The :c:func:`Py_EncodeLocale` function.
pt_pt: A função :c:func:`Py_EncodeLocale`.

source: The function now also uses the current locale encoding for the ``surrogateescape`` error handler, except on Android. Previously, :c:func:`Py_EncodeLocale` was used for the ``surrogateescape``, and the current locale encoding was used for ``strict``.
pt_pt: A função agora também usa a codificação local atual para o manipulador de erros ``surrogateescape``, exceto no Android. Anteriormente, :c:func:`Py_EncodeLocale` era usado para o ``surrogateescape``, e a codificação local atual era usada para ``strict``.

source: File System Encoding
pt_pt: Codificação do Sistema de Ficheiros

source: Functions encoding to and decoding from the :term:`filesystem encoding and error handler` (:pep:`383` and :pep:`529`).
pt_pt: Funções de codificação e decodificação para e da :term:`codificação do sistema de ficheiros e manipulador de erros` (:pep:`383` e :pep:`529`).

source: To encode file names to :class:`bytes` during argument parsing, the ``"O&"`` converter should be used, passing :c:func:`!PyUnicode_FSConverter` as the conversion function:
pt_pt: Para codificar nomes de ficheiros para :class:`bytes` durante a análise de argumentos, o conversor ``"O&"`` deve ser usado, passando :c:func:`!PyUnicode_FSConverter` como a função de conversão:

source: :ref:`PyArg_Parse\* converter <arg-parsing>`: encode :class:`str` objects -- obtained directly or through the :class:`os.PathLike` interface -- to :class:`bytes` using :c:func:`PyUnicode_EncodeFSDefault`; :class:`bytes` objects are output as-is. *result* must be an address of a C variable of type :c:expr:`PyObject*` (or :c:expr:`PyBytesObject*`). On success, set the variable to a new :term:`strong reference` to a :ref:`bytes object <bytesobjects>` which must be released when it is no longer used and return a non-zero value (:c:macro:`Py_CLEANUP_SUPPORTED`). Embedded null bytes are not allowed in the result. On failure, return ``0`` with an exception set.
pt_pt: :ref:`Conversor PyArg_Parse\* <arg-parsing>`: codifica objetos :class:`str` -- obtidos diretamente ou através da interface :class:`os.PathLike` -- para :class:`bytes` usando :c:func:`PyUnicode_EncodeFSDefault`; objetos :class:`bytes` são produzidos como estão. *result* deve ser o endereço de uma variável C do tipo :c:expr:`PyObject*` (ou :c:expr:`PyBytesObject*`). Em caso de sucesso, define a variável para uma nova :term:`referência forte` a um :ref:`objeto bytes <bytesobjects>` que deve ser libertado quando já não for usado e retorna um valor não-zero (:c:macro:`Py_CLEANUP_SUPPORTED`). Bytes nulos incorporados não são permitidos no resultado. Em caso de falha, retorna ``0`` com uma exceção definida.

source: If *obj* is ``NULL``, the function releases a strong reference stored in the variable referred by *result* and returns ``1``.
pt_pt: Se *obj* for ``NULL``, a função libera uma referência forte armazenada na variável referida por *result* e retorna ``1``.

source: Accepts a :term:`path-like object`.
pt_pt: Aceita um :term:`objeto semelhante a um caminho`.

source: To decode file names to :class:`str` during argument parsing, the ``"O&"`` converter should be used, passing :c:func:`!PyUnicode_FSDecoder` as the conversion function:
pt_pt: Para descodificar nomes de ficheiros para :class:`str` durante a análise de argumentos, o conversor ``"O&"`` deve ser usado, passando :c:func:`!PyUnicode_FSDecoder` como a função de conversão:

source: :ref:`PyArg_Parse\* converter <arg-parsing>`: decode :class:`bytes` objects -- obtained either directly or indirectly through the :class:`os.PathLike` interface -- to :class:`str` using :c:func:`PyUnicode_DecodeFSDefaultAndSize`; :class:`str` objects are output as-is. *result* must be an address of a C variable of type :c:expr:`PyObject*` (or :c:expr:`PyUnicodeObject*`). On success, set the variable to a new :term:`strong reference` to a :ref:`Unicode object <unicodeobjects>` which must be released when it is no longer used and return a non-zero value (:c:macro:`Py_CLEANUP_SUPPORTED`). Embedded null characters are not allowed in the result. On failure, return ``0`` with an exception set.
pt_pt: :ref:`Conversor PyArg_Parse\* <arg-parsing>`: descodifica objetos :class:`bytes` -- obtidos diretamente ou indiretamente através da interface :class:`os.PathLike` -- para :class:`str` usando :c:func:`PyUnicode_DecodeFSDefaultAndSize`; objetos :class:`str` são produzidos como estão. *result* deve ser o endereço de uma variável C do tipo :c:expr:`PyObject*` (ou :c:expr:`PyUnicodeObject*`). Em caso de sucesso, define a variável para uma nova :term:`referência forte` a um :ref:`objeto Unicode <unicodeobjects>` que deve ser libertado quando já não for usado e retorna um valor não-zero (:c:macro:`Py_CLEANUP_SUPPORTED`). Caracteres nulos incorporados não são permitidos no resultado. Em caso de falha, retorna ``0`` com uma exceção definida.

source: If *obj* is ``NULL``, release the strong reference to the object referred to by *result* and return ``1``.
pt_pt: Se *obj* for ``NULL``, libera a referência forte ao objeto referido por *result* e retorna ``1``.

source: Decode a string from the :term:`filesystem encoding and error handler`.
pt_pt: Descodifica uma cadeia de caracteres da :term:`codificação do sistema de ficheiros e manipulador de erros`.

source: If you need to decode a string from the current locale encoding, use :c:func:`PyUnicode_DecodeLocaleAndSize`.
pt_pt: Se precisar de descodificar uma cadeia de caracteres da codificação local atual, use :c:func:`PyUnicode_DecodeLocaleAndSize`.
