Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/unicode.po
Languages: pt_pt

source: Unicode Objects and Codecs
pt_pt: Objetos Unicode e Codecs

source: Unicode Objects
pt_pt: Objetos Unicode

source: Since the implementation of :pep:`393` in Python 3.3, Unicode objects internally use a variety of representations, in order to allow handling the complete range of Unicode characters while staying memory efficient. There are special cases for strings where all code points are below 128, 256, or 65536; otherwise, code points must be below 1114112 (which is the full Unicode range).
pt_pt: Desde a implementação da :pep:`393` no Python 3.3, os objetos Unicode usam internamente várias representações, de forma a permitir o manuseamento de todo o intervalo de caracteres Unicode mantendo a eficiência de memória. Existem casos especiais para cadeias de caracteres em que todos os pontos de código estão abaixo de 128, 256 ou 65536; caso contrário, os pontos de código devem estar abaixo de 1114112 (que é o intervalo completo do Unicode).

source: UTF-8 representation is created on demand and cached in the Unicode object.
pt_pt: A representação UTF-8 é criada sob pedido e armazenada em cache no objeto Unicode.

source: The :c:type:`Py_UNICODE` representation has been removed since Python 3.12 with deprecated APIs. See :pep:`623` for more information.
pt_pt: A representação :c:type:`Py_UNICODE` foi removida desde o Python 3.12 com as APIs obsoletas. Consulte a :pep:`623` para mais informações.

source: Unicode Type
pt_pt: Tipo Unicode

source: These are the basic Unicode object types used for the Unicode implementation in Python:
pt_pt: Estes são os tipos básicos de objetos Unicode usados para a implementação Unicode no Python:

source: This instance of :c:type:`PyTypeObject` represents the Python Unicode type. It is exposed to Python code as :py:class:`str`.
pt_pt: Esta instância de :c:type:`PyTypeObject` representa o tipo Unicode do Python. Está exposta ao código Python como :py:class:`str`.

source: This instance of :c:type:`PyTypeObject` represents the Python Unicode iterator type. It is used to iterate over Unicode string objects.
pt_pt: Esta instância de :c:type:`PyTypeObject` representa o tipo de iterador Unicode do Python. É usado para iterar sobre objetos de cadeias de caracteres Unicode.

source: These types are typedefs for unsigned integer types wide enough to contain characters of 32 bits, 16 bits and 8 bits, respectively. When dealing with single Unicode characters, use :c:type:`Py_UCS4`.
pt_pt: Estes tipos são typedefs para tipos inteiros sem sinal suficientemente largos para conter caracteres de 32 bits, 16 bits e 8 bits, respetivamente. Ao lidar com caracteres Unicode individuais, use :c:type:`Py_UCS4`.

source: These subtypes of :c:type:`PyObject` represent a Python Unicode object. In almost all cases, they shouldn't be used directly, since all API functions that deal with Unicode objects take and return :c:type:`PyObject` pointers.
pt_pt: Estes subtipos de :c:type:`PyObject` representam um objeto Unicode do Python. Em quase todos os casos, não devem ser usados diretamente, uma vez que todas as funções da API que lidam com objetos Unicode recebem e retornam ponteiros :c:type:`PyObject`.

source: The following APIs are C macros and static inlined functions for fast checks and access to internal read-only data of Unicode objects:
pt_pt: As seguintes APIs são macros C e funções inline estáticas para verificações rápidas e acesso a dados internos de apenas leitura de objetos Unicode:

source: Return true if the object *obj* is a Unicode object or an instance of a Unicode subtype. This function always succeeds.
pt_pt: Retorna verdadeiro se o objeto *obj* for um objeto Unicode ou uma instância de um subtipo Unicode. Esta função é sempre bem-sucedida.

source: Return true if the object *obj* is a Unicode object, but not an instance of a subtype. This function always succeeds.
pt_pt: Retorna verdadeiro se o objeto *obj* for um objeto Unicode, mas não uma instância de um subtipo. Esta função é sempre bem-sucedida.

source: Return the length of the Unicode string, in code points. *unicode* has to be a Unicode object in the "canonical" representation (not checked).
pt_pt: Retorna o comprimento da cadeia de caracteres Unicode, em pontos de código. *unicode* tem de ser um objeto Unicode na representação "canónica" (não verificado).

source: Return a pointer to the canonical representation cast to UCS1, UCS2 or UCS4 integer types for direct character access. No checks are performed if the canonical representation has the correct character size; use :c:func:`PyUnicode_KIND` to select the right function.
pt_pt: Retorna um ponteiro para a representação canónica convertida para os tipos inteiros UCS1, UCS2 ou UCS4 para acesso direto a caracteres. Não são efetuadas verificações se a representação canónica tiver o tamanho de caractere correto; use :c:func:`PyUnicode_KIND` para selecionar a função correta.

source: Return values of the :c:func:`PyUnicode_KIND` macro.
pt_pt: Retorna valores da macro :c:func:`PyUnicode_KIND`.

source: ``PyUnicode_WCHAR_KIND`` has been removed.
pt_pt: ``PyUnicode_WCHAR_KIND`` foi removido.

source: Return one of the PyUnicode kind constants (see above) that indicate how many bytes per character this Unicode object uses to store its data. *unicode* has to be a Unicode object in the "canonical" representation (not checked).
pt_pt: Retorna uma das constantes de tipo PyUnicode (ver acima) que indicam quantos bytes por caractere este objeto Unicode usa para armazenar os seus dados. *unicode* tem de ser um objeto Unicode na representação "canónica" (não verificado).

source: Return a void pointer to the raw Unicode buffer. *unicode* has to be a Unicode object in the "canonical" representation (not checked).
pt_pt: Retorna um ponteiro void para o buffer Unicode bruto. *unicode* tem de ser um objeto Unicode na representação "canónica" (não verificado).

source: Write the code point *value* to the given zero-based *index* in a string.
pt_pt: Escreve o ponto de código *value* no *index* com base zero dado numa cadeia de caracteres.

source: The *kind* value and *data* pointer must have been obtained from a string using :c:func:`PyUnicode_KIND` and :c:func:`PyUnicode_DATA` respectively. You must hold a reference to that string while calling :c:func:`!PyUnicode_WRITE`. All requirements of :c:func:`PyUnicode_WriteChar` also apply.
pt_pt: O valor *kind* e o ponteiro *data* devem ter sido obtidos de uma cadeia de caracteres usando :c:func:`PyUnicode_KIND` e :c:func:`PyUnicode_DATA`, respetivamente. Deve manter uma referência a essa cadeia de caracteres enquanto chama :c:func:`!PyUnicode_WRITE`. Todos os requisitos de :c:func:`PyUnicode_WriteChar` também se aplicam.

source: The function performs no checks for any of its requirements, and is intended for usage in loops.
pt_pt: A função não efetua verificações para quaisquer dos seus requisitos e destina-se a ser usada em ciclos.

source: Read a code point from a canonical representation *data* (as obtained with :c:func:`PyUnicode_DATA`). No checks or ready calls are performed.
pt_pt: Lê um ponto de código de uma representação canónica *data* (como obtido com :c:func:`PyUnicode_DATA`). Não são efetuadas verificações ou chamadas de preparação.

source: Read a character from a Unicode object *unicode*, which must be in the "canonical" representation. This is less efficient than :c:func:`PyUnicode_READ` if you do multiple consecutive reads.
pt_pt: Lê um caractere de um objeto Unicode *unicode*, que deve estar na representação "canónica". Isto é menos eficiente do que :c:func:`PyUnicode_READ` se efetuar várias leituras consecutivas.

source: Return the maximum code point that is suitable for creating another string based on *unicode*, which must be in the "canonical" representation. This is always an approximation but more efficient than iterating over the string.
pt_pt: Retorna o ponto de código máximo que é adequado para criar outra cadeia de caracteres com base em *unicode*, que deve estar na representação "canónica". Isto é sempre uma aproximação, mas mais eficiente do que iterar sobre a cadeia de caracteres.

source: Return ``1`` if the string is a valid identifier according to the language definition, section :ref:`identifiers`. Return ``0`` otherwise.
pt_pt: Retorna ``1`` se a cadeia de caracteres for um identificador válido de acordo com a definição da linguagem, secção :ref:`identifiers`. Retorna ``0`` caso contrário.

source: The function does not call :c:func:`Py_FatalError` anymore if the string is not ready.
pt_pt: A função já não chama :c:func:`Py_FatalError` se a cadeia de caracteres não estiver pronta.

source: Return true if the string only contains ASCII characters. Equivalent to :py:meth:`str.isascii`.
pt_pt: Retorna verdadeiro se a cadeia de caracteres contiver apenas caracteres ASCII. Equivalente a :py:meth:`str.isascii`.

source: Unicode Character Properties
pt_pt: Propriedades de Caracteres Unicode

source: Unicode provides many different character properties. The most often needed ones are available through these macros which are mapped to C functions depending on the Python configuration.
pt_pt: O Unicode fornece muitas propriedades diferentes de caracteres. As mais frequentemente necessárias estão disponíveis através destas macros, que são mapeadas para funções C dependendo da configuração do Python.

source: Return ``1`` or ``0`` depending on whether *ch* is a whitespace character.
pt_pt: Retorna ``1`` ou ``0`` dependendo se *ch* é um caractere de espaço em branco.

source: Return ``1`` or ``0`` depending on whether *ch* is a lowercase character.
pt_pt: Retorna ``1`` ou ``0`` dependendo se *ch* é um caractere minúsculo.

source: Return ``1`` or ``0`` depending on whether *ch* is an uppercase character.
pt_pt: Retorna ``1`` ou ``0`` dependendo se *ch* é um caractere maiúsculo.

source: Return ``1`` or ``0`` depending on whether *ch* is a titlecase character.
pt_pt: Retorna ``1`` ou ``0`` dependendo se *ch* é um caractere em título.

source: Return ``1`` or ``0`` depending on whether *ch* is a linebreak character.
pt_pt: Retorna ``1`` ou ``0`` dependendo se *ch* é um caractere de quebra de linha.

source: Return ``1`` or ``0`` depending on whether *ch* is a decimal character.
pt_pt: Retorna ``1`` ou ``0`` dependendo se *ch* é um caractere decimal.

source: Return ``1`` or ``0`` depending on whether *ch* is a digit character.
pt_pt: Retorna ``1`` ou ``0`` dependendo se *ch* é um caractere dígito.

source: Return ``1`` or ``0`` depending on whether *ch* is a numeric character.
pt_pt: Retorna ``1`` ou ``0`` dependendo se *ch* é um caractere numérico.

source: Return ``1`` or ``0`` depending on whether *ch* is an alphabetic character.
pt_pt: Retorna ``1`` ou ``0`` dependendo se *ch* é um caractere alfabético.

source: Return ``1`` or ``0`` depending on whether *ch* is an alphanumeric character.
pt_pt: Retorna ``1`` ou ``0`` dependendo se *ch* é um caractere alfanumérico.

source: Return ``1`` or ``0`` depending on whether *ch* is a printable character, in the sense of :meth:`str.isprintable`.
pt_pt: Retorna ``1`` ou ``0`` dependendo se *ch* é um caractere imprimível, no sentido de :meth:`str.isprintable`.

source: These APIs can be used for fast direct character conversions:
pt_pt: Estas APIs podem ser usadas para conversões diretas rápidas de caracteres:

source: Return the character *ch* converted to lower case.
pt_pt: Retorna o caractere *ch* convertido para minúsculas.

source: Return the character *ch* converted to upper case.
pt_pt: Retorna o caractere *ch* convertido para maiúsculas.

source: Return the character *ch* converted to title case.
pt_pt: Retorna o caractere *ch* convertido para título.

source: Return the character *ch* converted to a decimal positive integer. Return ``-1`` if this is not possible. This function does not raise exceptions.
pt_pt: Retorna o caractere *ch* convertido para um inteiro positivo decimal. Retorna ``-1`` se não for possível. Esta função não levanta exceções.

source: Return the character *ch* converted to a single digit integer. Return ``-1`` if this is not possible. This function does not raise exceptions.
pt_pt: Retorna o caractere *ch* convertido para um inteiro de um único dígito. Retorna ``-1`` se não for possível. Esta função não levanta exceções.

source: Return the character *ch* converted to a double. Return ``-1.0`` if this is not possible. This function does not raise exceptions.
pt_pt: Retorna o caractere *ch* convertido para um double. Retorna ``-1.0`` se não for possível. Esta função não levanta exceções.

source: These APIs can be used to work with surrogates:
pt_pt: Estas APIs podem ser usadas para trabalhar com substitutos:

source: Check if *ch* is a surrogate (``0xD800 <= ch <= 0xDFFF``).
pt_pt: Verifica se *ch* é um substituto (``0xD800 <= ch <= 0xDFFF``).

source: Check if *ch* is a high surrogate (``0xD800 <= ch <= 0xDBFF``).
pt_pt: Verifica se *ch* é um substituto alto (``0xD800 <= ch <= 0xDBFF``).

source: Check if *ch* is a low surrogate (``0xDC00 <= ch <= 0xDFFF``).
pt_pt: Verifica se *ch* é um substituto baixo (``0xDC00 <= ch <= 0xDFFF``).

source: Creating and accessing Unicode strings
pt_pt: Criar e aceder a cadeias de caracteres Unicode

source: To create Unicode objects and access their basic sequence properties, use these APIs:
pt_pt: Para criar objetos Unicode e aceder às suas propriedades básicas de sequência, use estas APIs:

source: Create a new Unicode object. *maxchar* should be the true maximum code point to be placed in the string. As an approximation, it can be rounded up to the nearest value in the sequence 127, 255, 65535, 1114111.
pt_pt: Cria um novo objeto Unicode. *maxchar* deve ser o verdadeiro ponto de código máximo real a ser colocado na cadeia de caracteres. Como aproximação, pode ser arredondado para o valor mais próximo na sequência 127, 255, 65535, 1114111.

source: On error, set an exception and return ``NULL``.
pt_pt: Em caso de erro, define uma exceção e retorna ``NULL``.

source: After creation, the string can be filled by :c:func:`PyUnicode_WriteChar`, :c:func:`PyUnicode_CopyCharacters`, :c:func:`PyUnicode_Fill`, :c:func:`PyUnicode_WRITE` or similar. Since strings are supposed to be immutable, take care to not “use” the result while it is being modified. In particular, before it's filled with its final contents, a string:
pt_pt: Após a criação, a cadeia de caracteres pode ser preenchida por :c:func:`PyUnicode_WriteChar`, :c:func:`PyUnicode_CopyCharacters`, :c:func:`PyUnicode_Fill`, :c:func:`PyUnicode_WRITE` ou similar. Uma vez que as cadeias de caracteres são supostas imutáveis, tenha cuidado para não "usar" o resultado enquanto está a ser modificado. Em particular, antes de ser preenchida com o seu conteúdo final, uma cadeia de caracteres:

source: must not be hashed,
pt_pt: não deve ser hashada,

source: must not be :c:func:`converted to UTF-8 <PyUnicode_AsUTF8AndSize>`, or another non-"canonical" representation,
pt_pt: não deve ser :c:func:`convertida para UTF-8 <PyUnicode_AsUTF8AndSize>`, ou outra representação não "canónica",

source: must not have its reference count changed,
pt_pt: não deve ter a sua contagem de referências alterada,

source: must not be shared with code that might do one of the above.
pt_pt: não deve ser partilhada com código que possa fazer uma das ações acima.

source: This list is not exhaustive. Avoiding these uses is your responsibility; Python does not always check these requirements.
pt_pt: Esta lista não é exaustiva. Evitar estes usos é da sua responsabilidade; o Python não verifica sempre estes requisitos.

source: To avoid accidentally exposing a partially-written string object, prefer using the :c:type:`PyUnicodeWriter` API, or one of the ``PyUnicode_From*`` functions below.
pt_pt: Para evitar expor acidentalmente um objeto de cadeia de caracteres parcialmente escrito, prefira usar a API :c:type:`PyUnicodeWriter`, ou uma das funções ``PyUnicode_From*`` abaixo.

source: Create a new Unicode object with the given *kind* (possible values are :c:macro:`PyUnicode_1BYTE_KIND` etc., as returned by :c:func:`PyUnicode_KIND`). The *buffer* must point to an array of *size* units of 1, 2 or 4 bytes per character, as given by the kind.
pt_pt: Cria um novo objeto Unicode com o *kind* dado (valores possíveis são :c:macro:`PyUnicode_1BYTE_KIND`, etc., como retornado por :c:func:`PyUnicode_KIND`). O *buffer* deve apontar para um array de *size* unidades de 1, 2 ou 4 bytes por caractere, como dado pelo tipo.

source: If necessary, the input *buffer* is copied and transformed into the canonical representation. For example, if the *buffer* is a UCS4 string (:c:macro:`PyUnicode_4BYTE_KIND`) and it consists only of codepoints in the UCS1 range, it will be transformed into UCS1 (:c:macro:`PyUnicode_1BYTE_KIND`).
pt_pt: Se necessário, o *buffer* de entrada é copiado e transformado na representação canónica. Por exemplo, se o *buffer* for uma cadeia de caracteres UCS4 (:c:macro:`PyUnicode_4BYTE_KIND`) e consistir apenas de pontos de código no intervalo UCS1, será transformado em UCS1 (:c:macro:`PyUnicode_1BYTE_KIND`).

source: Create a Unicode object from the char buffer *str*. The bytes will be interpreted as being UTF-8 encoded. The buffer is copied into the new object. The return value might be a shared object, i.e. modification of the data is not allowed.
pt_pt: Cria um objeto Unicode a partir do buffer de caracteres *str*. Os bytes serão interpretados como codificados em UTF-8. O buffer é copiado para o novo objeto. O valor de retorno pode ser um objeto partilhado, ou seja, a modificação dos dados não é permitida.

source: This function raises :exc:`SystemError` when:
pt_pt: Esta função levanta :exc:`SystemError` quando:

source: *str* is ``NULL`` and *size* > 0
pt_pt: *str* é ``NULL`` e *size* > 0

source: *str* == ``NULL`` with *size* > 0 is not allowed anymore.
pt_pt: *str* == ``NULL`` com *size* > 0 já não é permitido.

source: Create a Unicode object from a UTF-8 encoded null-terminated char buffer *str*.
pt_pt: Cria um objeto Unicode a partir de um buffer de caracteres terminado por nulo codificado em UTF-8 *str*.

source: Take a C :c:func:`printf`\ -style *format* string and a variable number of arguments, calculate the size of the resulting Python Unicode string and return a string with the values formatted into it. The variable arguments must be C types and must correspond exactly to the format characters in the *format* ASCII-encoded string.
pt_pt: Recebe uma cadeia de caracteres *format* no estilo :c:func:`printf` e um número variável de argumentos, calcula o tamanho da cadeia de caracteres Unicode resultante do Python e retorna uma cadeia de caracteres com os valores formatados nela. Os argumentos variáveis devem ser tipos C e devem corresponder exatamente aos caracteres de formatação na cadeia de caracteres ASCII *format*.

source: A conversion specifier contains two or more characters and has the following components, which must occur in this order:
pt_pt: Um especificador de conversão contém dois ou mais caracteres e tem os seguintes componentes, que devem ocorrer nesta ordem:

source: The ``'%'`` character, which marks the start of the specifier.
pt_pt: O caractere ``'%'``, que marca o início do especificador.

source: Conversion flags (optional), which affect the result of some conversion types.
pt_pt: Flags de conversão (opcionais), que afetam o resultado de alguns tipos de conversão.

source: Minimum field width (optional). If specified as an ``'*'`` (asterisk), the actual width is given in the next argument, which must be of type :c:expr:`int`, and the object to convert comes after the minimum field width and optional precision.
pt_pt: Largura mínima do campo (opcional). Se especificado como ``'*'`` (asterisco), a largura real é dada no próximo argumento, que deve ser do tipo :c:expr:`int`, e o objeto a converter vem depois da largura mínima do campo e da precisão opcional.

source: Precision (optional), given as a ``'.'`` (dot) followed by the precision. If specified as ``'*'`` (an asterisk), the actual precision is given in the next argument, which must be of type :c:expr:`int`, and the value to convert comes after the precision.
pt_pt: Precisão (opcional), dada como um ``'.'`` (ponto) seguido da precisão. Se especificada como ``'*'`` (um asterisco), a precisão real é dada no próximo argumento, que deve ser do tipo :c:expr:`int`, e o valor a converter vem depois da precisão.

source: Length modifier (optional).
pt_pt: Modificador de comprimento (opcional).

source: Conversion type.
pt_pt: Tipo de conversão.

source: The conversion flag characters are:
pt_pt: Os caracteres de flag de conversão são:

source: Meaning
pt_pt: Significado

source: The conversion will be zero padded for numeric values.
pt_pt: A conversão será preenchida com zeros para valores numéricos.

source: The converted value is left adjusted (overrides the ``0`` flag if both are given).
pt_pt: O valor convertido é ajustado à esquerda (substitui a flag ``0`` se ambas forem dadas).

source: The length modifiers for following integer conversions (``d``, ``i``, ``o``, ``u``, ``x``, or ``X``) specify the type of the argument (:c:expr:`int` by default):
pt_pt: Os modificadores de comprimento para conversões inteiras seguintes (``d``, ``i``, ``o``, ``u``, ``x``, ou ``X``) especificam o tipo do argumento (:c:expr:`int` por defeito):

source: Modifier
pt_pt: Modificador

source: Types
pt_pt: Tipos

source: :c:expr:`long` or :c:expr:`unsigned long`
pt_pt: :c:expr:`long` ou :c:expr:`unsigned long`

source: :c:expr:`long long` or :c:expr:`unsigned long long`
pt_pt: :c:expr:`long long` ou :c:expr:`unsigned long long`

source: :c:type:`intmax_t` or :c:type:`uintmax_t`
pt_pt: :c:type:`intmax_t` ou :c:type:`uintmax_t`

source: :c:type:`size_t` or :c:type:`ssize_t`
pt_pt: :c:type:`size_t` ou :c:type:`ssize_t`

source: The length modifier ``l`` for following conversions ``s`` or ``V`` specify that the type of the argument is :c:expr:`const wchar_t*`.
pt_pt: O modificador de comprimento ``l`` para conversões seguintes ``s`` ou ``V`` especifica que o tipo do argumento é :c:expr:`const wchar_t*`.

source: The conversion specifiers are:
pt_pt: Os especificadores de conversão são:

source: Conversion Specifier
pt_pt: Especificador de Conversão

source: Type
pt_pt: Tipo

source: Comment
pt_pt: Comentário

source: *n/a*
pt_pt: *n/d*

source: The literal ``%`` character.
pt_pt: O caractere literal ``%``.

source: Specified by the length modifier
pt_pt: Especificado pelo modificador de comprimento

source: The decimal representation of a signed C integer.
pt_pt: A representação decimal de um inteiro C com sinal.

source: The decimal representation of an unsigned C integer.
pt_pt: A representação decimal de um inteiro C sem sinal.

source: The octal representation of an unsigned C integer.
pt_pt: A representação octal de um inteiro C sem sinal.

source: The hexadecimal representation of an unsigned C integer (lowercase).
pt_pt: A representação hexadecimal de um inteiro C sem sinal (minúsculas).

source: The hexadecimal representation of an unsigned C integer (uppercase).
pt_pt: A representação hexadecimal de um inteiro C sem sinal (maiúsculas).

source: A single character.
pt_pt: Um único caractere.

source: :c:expr:`const char*` or :c:expr:`const wchar_t*`
pt_pt: :c:expr:`const char*` ou :c:expr:`const wchar_t*`

source: A null-terminated C character array.
pt_pt: Uma matriz de caracteres C terminada por nulo.
