Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/unicode.po
Languages: pt_pt

source: The :term:`filesystem error handler <filesystem encoding and error handler>` is now used.
pt_pt: O :term:`manipulador de erros do sistema de ficheiros <codificação do sistema de ficheiros e manipulador de erros>` é agora usado.

source: Decode a null-terminated string from the :term:`filesystem encoding and error handler`.
pt_pt: Descodifica uma cadeia de caracteres terminada por nulo da :term:`codificação do sistema de ficheiros e manipulador de erros`.

source: If the string length is known, use :c:func:`PyUnicode_DecodeFSDefaultAndSize`.
pt_pt: Se o comprimento da cadeia de caracteres for conhecido, use :c:func:`PyUnicode_DecodeFSDefaultAndSize`.

source: Encode a Unicode object to the :term:`filesystem encoding and error handler`, and return :class:`bytes`. Note that the resulting :class:`bytes` object can contain null bytes.
pt_pt: Codifica um objeto Unicode para a :term:`codificação do sistema de ficheiros e manipulador de erros`, e retorna :class:`bytes`. Note que o objeto :class:`bytes` resultante pode conter bytes nulos.

source: If you need to encode a string to the current locale encoding, use :c:func:`PyUnicode_EncodeLocale`.
pt_pt: Se precisar de codificar uma cadeia de caracteres para a codificação local atual, use :c:func:`PyUnicode_EncodeLocale`.

source: wchar_t Support
pt_pt: Suporte para wchar_t

source: :c:type:`wchar_t` support for platforms which support it:
pt_pt: Suporte para :c:type:`wchar_t` em plataformas que o suportam:

source: Create a Unicode object from the :c:type:`wchar_t` buffer *wstr* of the given *size*. Passing ``-1`` as the *size* indicates that the function must itself compute the length, using :c:func:`!wcslen`. Return ``NULL`` on failure.
pt_pt: Cria um objeto Unicode a partir do buffer :c:type:`wchar_t` *wstr* do *size* dado. Passar ``-1`` como *size* indica que a função deve calcular ela própria o comprimento, usando :c:func:`!wcslen`. Retorna ``NULL`` em caso de falha.

source: Copy the Unicode object contents into the :c:type:`wchar_t` buffer *wstr*. At most *size* :c:type:`wchar_t` characters are copied (excluding a possibly trailing null termination character). Return the number of :c:type:`wchar_t` characters copied or ``-1`` in case of an error.
pt_pt: Copia o conteúdo do objeto Unicode para o buffer :c:type:`wchar_t` *wstr*. No máximo *size* caracteres :c:type:`wchar_t` são copiados (excluindo um carácter de terminação nula opcional). Retorna o número de caracteres :c:type:`wchar_t` copiados ou ``-1`` em caso de erro.

source: When *wstr* is ``NULL``, instead return the *size* that would be required to store all of *unicode* including a terminating null.
pt_pt: Quando *wstr* é ``NULL``, em vez disso retorna o *size* que seria necessário para armazenar todo o *unicode* incluindo um nulo de terminação.

source: Note that the resulting :c:expr:`wchar_t*` string may or may not be null-terminated. It is the responsibility of the caller to make sure that the :c:expr:`wchar_t*` string is null-terminated in case this is required by the application. Also, note that the :c:expr:`wchar_t*` string might contain null characters, which would cause the string to be truncated when used with most C functions.
pt_pt: Note que a cadeia de caracteres :c:expr:`wchar_t*` resultante pode ou não estar terminada por nulo. É da responsabilidade do chamador garantir que a cadeia de caracteres :c:expr:`wchar_t*` esteja terminada por nulo, caso isso seja necessário pela aplicação. Além disso, note que a cadeia de caracteres :c:expr:`wchar_t*` pode conter caracteres nulos, o que causaria o truncamento da cadeia de caracteres quando usada com a maioria das funções C.

source: Convert the Unicode object to a wide character string. The output string always ends with a null character. If *size* is not ``NULL``, write the number of wide characters (excluding the trailing null termination character) into *\*size*. Note that the resulting :c:type:`wchar_t` string might contain null characters, which would cause the string to be truncated when used with most C functions. If *size* is ``NULL`` and the :c:expr:`wchar_t*` string contains null characters a :exc:`ValueError` is raised.
pt_pt: Converte o objeto Unicode para uma cadeia de caracteres largos. A cadeia de saída termina sempre com um carácter nulo. Se *size* não for ``NULL``, escreve o número de caracteres largos (excluindo o carácter nulo de terminação) em *\*size*. Note que a cadeia de caracteres :c:type:`wchar_t` resultante pode conter caracteres nulos, o que causaria o truncamento da cadeia de caracteres quando usada com a maioria das funções C. Se *size* for ``NULL`` e a cadeia de caracteres :c:expr:`wchar_t*` contiver caracteres nulos, é levantado um :exc:`ValueError`.

source: Returns a buffer allocated by :c:macro:`PyMem_New` (use :c:func:`PyMem_Free` to free it) on success. On error, returns ``NULL`` and *\*size* is undefined. Raises a :exc:`MemoryError` if memory allocation is failed.
pt_pt: Retorna um buffer alocado por :c:macro:`PyMem_New` (use :c:func:`PyMem_Free` para libertá-lo) em caso de sucesso. Em caso de erro, retorna ``NULL`` e *\*size* é indefinido. Levanta um :exc:`MemoryError` se a alocação de memória falhar.

source: Raises a :exc:`ValueError` if *size* is ``NULL`` and the :c:expr:`wchar_t*` string contains null characters.
pt_pt: Levanta um :exc:`ValueError` se *size* for ``NULL`` e a cadeia de caracteres :c:expr:`wchar_t*` contiver caracteres nulos.

source: Built-in Codecs
pt_pt: Codecs Integrados

source: Python provides a set of built-in codecs which are written in C for speed. All of these codecs are directly usable via the following functions.
pt_pt: O Python fornece um conjunto de codecs integrados que são escritos em C para velocidade. Todos estes codecs são diretamente utilizáveis através das seguintes funções.

source: Many of the following APIs take two arguments encoding and errors, and they have the same semantics as the ones of the built-in :func:`str` string object constructor.
pt_pt: Muitas das seguintes APIs recebem dois argumentos, codificação e erros, e têm a mesma semântica que os do construtor de objetos de cadeias de caracteres :func:`str` integrado.

source: Setting encoding to ``NULL`` causes the default encoding to be used which is UTF-8. The file system calls should use :c:func:`PyUnicode_FSConverter` for encoding file names. This uses the :term:`filesystem encoding and error handler` internally.
pt_pt: Definir a codificação para ``NULL`` faz com que a codificação predefinida seja usada, que é UTF-8. As chamadas do sistema de ficheiros devem usar :c:func:`PyUnicode_FSConverter` para codificar nomes de ficheiros. Isto usa internamente a :term:`codificação do sistema de ficheiros e manipulador de erros`.

source: Error handling is set by errors which may also be set to ``NULL`` meaning to use the default handling defined for the codec. Default error handling for all built-in codecs is "strict" (:exc:`ValueError` is raised).
pt_pt: O tratamento de erros é definido por erros, que também pode ser definido como ``NULL``, significando usar o tratamento predefinido definido para o codec. O tratamento de erros predefinido para todos os codecs integrados é "strict" (um :exc:`ValueError` é levantado).

source: The codecs all use a similar interface. Only deviations from the following generic ones are documented for simplicity.
pt_pt: Os codecs usam todos uma interface semelhante. Apenas os desvios dos seguintes genéricos são documentados por simplicidade.

source: Generic Codecs
pt_pt: Codecs Genéricos

source: The following macro is provided:
pt_pt: A seguinte macro é fornecida:

source: The Unicode code point ``U+FFFD`` (replacement character).
pt_pt: O ponto de código Unicode ``U+FFFD`` (caractere de substituição).

source: This Unicode character is used as the replacement character during decoding if the *errors* argument is set to "replace".
pt_pt: Este caractere Unicode é usado como caractere de substituição durante a descodificação se o argumento *errors* for definido como "replace".

source: These are the generic codec APIs:
pt_pt: Estas são as APIs genéricas de codec:

source: Create a Unicode object by decoding *size* bytes of the encoded string *str*. *encoding* and *errors* have the same meaning as the parameters of the same name in the :func:`str` built-in function. The codec to be used is looked up using the Python codec registry. Return ``NULL`` if an exception was raised by the codec.
pt_pt: Cria um objeto Unicode decodificando *size* bytes da cadeia de caracteres codificada *str*. *encoding* e *errors* têm o mesmo significado que os parâmetros com o mesmo nome na função integrada :func:`str`. O codec a ser usado é procurado usando o registo de codecs do Python. Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: Encode a Unicode object and return the result as Python bytes object. *encoding* and *errors* have the same meaning as the parameters of the same name in the Unicode :meth:`~str.encode` method. The codec to be used is looked up using the Python codec registry. Return ``NULL`` if an exception was raised by the codec.
pt_pt: Codifica um objeto Unicode e retorna o resultado como um objeto bytes do Python. *encoding* e *errors* têm o mesmo significado que os parâmetros com o mesmo nome no método Unicode :meth:`~str.encode`. O codec a ser usado é procurado usando o registo de codecs do Python. Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: UTF-8 Codecs
pt_pt: Codecs UTF-8

source: These are the UTF-8 codec APIs:
pt_pt: Estas são as APIs de codec UTF-8:

source: Create a Unicode object by decoding *size* bytes of the UTF-8 encoded string *str*. Return ``NULL`` if an exception was raised by the codec.
pt_pt: Cria um objeto Unicode decodificando *size* bytes da cadeia de caracteres codificada em UTF-8 *str*. Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeUTF8`. If *consumed* is not ``NULL``, trailing incomplete UTF-8 byte sequences will not be treated as an error. Those bytes will not be decoded and the number of bytes that have been decoded will be stored in *consumed*.
pt_pt: Se *consumed* for ``NULL``, comporta-se como :c:func:`PyUnicode_DecodeUTF8`. Se *consumed* não for ``NULL``, sequências de bytes UTF-8 incompletas no final não serão tratadas como erro. Esses bytes não serão decodificados e o número de bytes que foram decodificados será armazenado em *consumed*.

source: Encode a Unicode object using UTF-8 and return the result as Python bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
pt_pt: Codifica um objeto Unicode usando UTF-8 e retorna o resultado como um objeto bytes do Python. O tratamento de erros é "strict". Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: The function fails if the string contains surrogate code points (``U+D800`` - ``U+DFFF``).
pt_pt: A função falha se a cadeia de caracteres contiver pontos de código substitutos (``U+D800`` - ``U+DFFF``).

source: Return a pointer to the UTF-8 encoding of the Unicode object, and store the size of the encoded representation (in bytes) in *size*. The *size* argument can be ``NULL``; in this case no size will be stored. The returned buffer always has an extra null byte appended (not included in *size*), regardless of whether there are any other null code points.
pt_pt: Retorna um ponteiro para a codificação UTF-8 do objeto Unicode e armazena o tamanho da representação codificada (em bytes) em *size*. O argumento *size* pode ser ``NULL``; neste caso, nenhum tamanho será armazenado. O buffer retornado tem sempre um byte nulo extra anexado (não incluído em *size*), independentemente de haver outros pontos de código nulos.

source: On error, set an exception, set *size* to ``-1`` (if it's not NULL) and return ``NULL``.
pt_pt: Em caso de erro, define uma exceção, define *size* para ``-1`` (se não for NULL) e retorna ``NULL``.

source: This caches the UTF-8 representation of the string in the Unicode object, and subsequent calls will return a pointer to the same buffer. The caller is not responsible for deallocating the buffer. The buffer is deallocated and pointers to it become invalid when the Unicode object is garbage collected.
pt_pt: Isto armazena em cache a representação UTF-8 da cadeia de caracteres no objeto Unicode, e chamadas subsequentes retornarão um ponteiro para o mesmo buffer. O chamador não é responsável por desalocar o buffer. O buffer é desalocado e os ponteiros para ele tornam-se inválidos quando o objeto Unicode é recolhido pelo recolhedor de lixo.

source: The return type is now ``const char *`` rather of ``char *``.
pt_pt: O tipo de retorno é agora ``const char *`` em vez de ``char *``.

source: This function is a part of the :ref:`limited API <limited-c-api>`.
pt_pt: Esta função faz parte da :ref:`API limitada <limited-c-api>`.

source: As :c:func:`PyUnicode_AsUTF8AndSize`, but does not store the size.
pt_pt: Como :c:func:`PyUnicode_AsUTF8AndSize`, mas não armazena o tamanho.

source: This function does not have any special behavior for `null characters <https://en.wikipedia.org/wiki/Null_character>`_ embedded within *unicode*. As a result, strings containing null characters will remain in the returned string, which some C functions might interpret as the end of the string, leading to truncation. If truncation is an issue, it is recommended to use :c:func:`PyUnicode_AsUTF8AndSize` instead.
pt_pt: Esta função não tem qualquer comportamento especial para `caracteres nulos <https://en.wikipedia.org/wiki/Null_character>`_ incorporados em *unicode*. Como resultado, cadeias de caracteres contendo caracteres nulos permanecerão na cadeia de caracteres retornada, que algumas funções C podem interpretar como o fim da cadeia de caracteres, levando ao truncamento. Se o truncamento for um problema, recomenda-se usar :c:func:`PyUnicode_AsUTF8AndSize` em vez disso.

source: UTF-32 Codecs
pt_pt: Codecs UTF-32

source: These are the UTF-32 codec APIs:
pt_pt: Estas são as APIs de codec UTF-32:

source: Decode *size* bytes from a UTF-32 encoded buffer string and return the corresponding Unicode object. *errors* (if non-``NULL``) defines the error handling. It defaults to "strict".
pt_pt: Descodifica *size* bytes de uma cadeia de caracteres de buffer codificada em UTF-32 e retorna o objeto Unicode correspondente. *errors* (se não for ``NULL``) define o tratamento de erros. O valor predefinido é "strict".

source: If *byteorder* is non-``NULL``, the decoder starts decoding using the given byte order::
pt_pt: Se *byteorder* não for ``NULL``, o decodificador começa a decodificar usando a ordem de bytes dada:

source: *byteorder == -1: little endian *byteorder == 0: native order *byteorder == 1: big endian
pt_pt: *byteorder == -1: little endian *byteorder == 0: ordem nativa *byteorder == 1: big endian

source: If ``*byteorder`` is zero, and the first four bytes of the input data are a byte order mark (BOM), the decoder switches to this byte order and the BOM is not copied into the resulting Unicode string. If ``*byteorder`` is ``-1`` or ``1``, any byte order mark is copied to the output.
pt_pt: Se ``*byteorder`` for zero e os primeiros quatro bytes dos dados de entrada forem uma marca de ordem de bytes (BOM), o decodificador muda para esta ordem de bytes e a BOM não é copiada para a cadeia de caracteres Unicode resultante. Se ``*byteorder`` for ``-1`` ou ``1``, qualquer marca de ordem de bytes é copiada para a saída.

source: After completion, *\*byteorder* is set to the current byte order at the end of input data.
pt_pt: Após a conclusão, *\*byteorder* é definido para a ordem de bytes atual no final dos dados de entrada.

source: If *byteorder* is ``NULL``, the codec starts in native order mode.
pt_pt: Se *byteorder* for ``NULL``, o codec começa no modo de ordem nativa.

source: Return ``NULL`` if an exception was raised by the codec.
pt_pt: Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeUTF32`. If *consumed* is not ``NULL``, :c:func:`PyUnicode_DecodeUTF32Stateful` will not treat trailing incomplete UTF-32 byte sequences (such as a number of bytes not divisible by four) as an error. Those bytes will not be decoded and the number of bytes that have been decoded will be stored in *consumed*.
pt_pt: Se *consumed* for ``NULL``, comporta-se como :c:func:`PyUnicode_DecodeUTF32`. Se *consumed* não for ``NULL``, :c:func:`PyUnicode_DecodeUTF32Stateful` não tratará sequências de bytes UTF-32 incompletas no final (como um número de bytes não divisível por quatro) como um erro. Esses bytes não serão decodificados e o número de bytes que foram decodificados será armazenado em *consumed*.

source: Return a Python byte string using the UTF-32 encoding in native byte order. The string always starts with a BOM mark. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
pt_pt: Retorna uma cadeia de bytes Python usando a codificação UTF-32 na ordem de bytes nativa. A cadeia de caracteres sempre começa com uma marca BOM. O tratamento de erros é "strict". Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: UTF-16 Codecs
pt_pt: Codecs UTF-16

source: These are the UTF-16 codec APIs:
pt_pt: Estas são as APIs de codec UTF-16:

source: Decode *size* bytes from a UTF-16 encoded buffer string and return the corresponding Unicode object. *errors* (if non-``NULL``) defines the error handling. It defaults to "strict".
pt_pt: Descodifica *size* bytes de uma cadeia de caracteres de buffer codificada em UTF-16 e retorna o objeto Unicode correspondente. *errors* (se não for ``NULL``) define o tratamento de erros. O valor predefinido é "strict".

source: If ``*byteorder`` is zero, and the first two bytes of the input data are a byte order mark (BOM), the decoder switches to this byte order and the BOM is not copied into the resulting Unicode string. If ``*byteorder`` is ``-1`` or ``1``, any byte order mark is copied to the output (where it will result in either a ``\ufeff`` or a ``\ufffe`` character).
pt_pt: Se ``*byteorder`` for zero e os primeiros dois bytes dos dados de entrada forem uma marca de ordem de bytes (BOM), o decodificador muda para esta ordem de bytes e a BOM não é copiada para a cadeia de caracteres Unicode resultante. Se ``*byteorder`` for ``-1`` ou ``1``, qualquer marca de ordem de bytes é copiada para a saída (onde resultará em um carácter ``\ufeff`` ou ``\ufffe``).

source: After completion, ``*byteorder`` is set to the current byte order at the end of input data.
pt_pt: Após a conclusão, ``*byteorder`` é definido para a ordem de bytes atual no final dos dados de entrada.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeUTF16`. If *consumed* is not ``NULL``, :c:func:`PyUnicode_DecodeUTF16Stateful` will not treat trailing incomplete UTF-16 byte sequences (such as an odd number of bytes or a split surrogate pair) as an error. Those bytes will not be decoded and the number of bytes that have been decoded will be stored in *consumed*.
pt_pt: Se *consumed* for ``NULL``, comporta-se como :c:func:`PyUnicode_DecodeUTF16`. Se *consumed* não for ``NULL``, :c:func:`PyUnicode_DecodeUTF16Stateful` não tratará sequências de bytes UTF-16 incompletas no final (como um número ímpar de bytes ou um par de substitutos dividido) como um erro. Esses bytes não serão decodificados e o número de bytes que foram decodificados será armazenado em *consumed*.

source: Return a Python byte string using the UTF-16 encoding in native byte order. The string always starts with a BOM mark. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
pt_pt: Retorna uma cadeia de bytes Python usando a codificação UTF-16 na ordem de bytes nativa. A cadeia de caracteres sempre começa com uma marca BOM. O tratamento de erros é "strict". Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: UTF-7 Codecs
pt_pt: Codecs UTF-7

source: These are the UTF-7 codec APIs:
pt_pt: Estas são as APIs de codec UTF-7:

source: Create a Unicode object by decoding *size* bytes of the UTF-7 encoded string *str*. Return ``NULL`` if an exception was raised by the codec.
pt_pt: Cria um objeto Unicode decodificando *size* bytes da cadeia de caracteres codificada em UTF-7 *str*. Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeUTF7`. If *consumed* is not ``NULL``, trailing incomplete UTF-7 base-64 sections will not be treated as an error. Those bytes will not be decoded and the number of bytes that have been decoded will be stored in *consumed*.
pt_pt: Se *consumed* for ``NULL``, comporta-se como :c:func:`PyUnicode_DecodeUTF7`. Se *consumed* não for ``NULL``, secções base-64 UTF-7 incompletas no final não serão tratadas como erro. Esses bytes não serão decodificados e o número de bytes que foram decodificados será armazenado em *consumed*.

source: Unicode-Escape Codecs
pt_pt: Codecs Unicode-Escape

source: These are the "Unicode Escape" codec APIs:
pt_pt: Estas são as APIs de codec "Unicode Escape":

source: Create a Unicode object by decoding *size* bytes of the Unicode-Escape encoded string *str*. Return ``NULL`` if an exception was raised by the codec.
pt_pt: Cria um objeto Unicode decodificando *size* bytes da cadeia de caracteres codificada em Unicode-Escape *str*. Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: Encode a Unicode object using Unicode-Escape and return the result as a bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
pt_pt: Codifica um objeto Unicode usando Unicode-Escape e retorna o resultado como um objeto bytes. O tratamento de erros é "strict". Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: Raw-Unicode-Escape Codecs
pt_pt: Codecs Raw-Unicode-Escape

source: These are the "Raw Unicode Escape" codec APIs:
pt_pt: Estas são as APIs de codec "Raw Unicode Escape":

source: Create a Unicode object by decoding *size* bytes of the Raw-Unicode-Escape encoded string *str*. Return ``NULL`` if an exception was raised by the codec.
pt_pt: Cria um objeto Unicode decodificando *size* bytes da cadeia de caracteres codificada em Raw-Unicode-Escape *str*. Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: Encode a Unicode object using Raw-Unicode-Escape and return the result as a bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
pt_pt: Codifica um objeto Unicode usando Raw-Unicode-Escape e retorna o resultado como um objeto bytes. O tratamento de erros é "strict". Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: Latin-1 Codecs
pt_pt: Codecs Latin-1

source: These are the Latin-1 codec APIs: Latin-1 corresponds to the first 256 Unicode ordinals and only these are accepted by the codecs during encoding.
pt_pt: Estas são as APIs de codec Latin-1: Latin-1 corresponde aos primeiros 256 ordinais Unicode e apenas estes são aceites pelos codecs durante a codificação.

source: Create a Unicode object by decoding *size* bytes of the Latin-1 encoded string *str*. Return ``NULL`` if an exception was raised by the codec.
pt_pt: Cria um objeto Unicode decodificando *size* bytes da cadeia de caracteres codificada em Latin-1 *str*. Retorna ``NULL`` se uma exceção for levantada pelo codec.
