Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/unicode.po
Languages: pt_pt

source: Encode a Unicode object using Latin-1 and return the result as Python bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
pt_pt: Codifica um objeto Unicode usando Latin-1 e retorna o resultado como um objeto bytes do Python. O tratamento de erros é "strict". Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: ASCII Codecs
pt_pt: Codecs ASCII

source: These are the ASCII codec APIs. Only 7-bit ASCII data is accepted. All other codes generate errors.
pt_pt: Estas são as APIs de codec ASCII. Apenas dados ASCII de 7 bits são aceites. Todos os outros códigos geram erros.

source: Create a Unicode object by decoding *size* bytes of the ASCII encoded string *str*. Return ``NULL`` if an exception was raised by the codec.
pt_pt: Cria um objeto Unicode decodificando *size* bytes da cadeia de caracteres codificada em ASCII *str*. Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: Encode a Unicode object using ASCII and return the result as Python bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
pt_pt: Codifica um objeto Unicode usando ASCII e retorna o resultado como um objeto bytes do Python. O tratamento de erros é "strict". Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: Character Map Codecs
pt_pt: Codecs de Mapeamento de Caracteres

source: This codec is special in that it can be used to implement many different codecs (and this is in fact what was done to obtain most of the standard codecs included in the :mod:`!encodings` package). The codec uses mappings to encode and decode characters. The mapping objects provided must support the :meth:`~object.__getitem__` mapping interface; dictionaries and sequences work well.
pt_pt: Este codec é especial porque pode ser usado para implementar muitos codecs diferentes (e isto foi de facto feito para obter a maioria dos codecs padrão incluídos no pacote :mod:`!encodings`). O codec usa mapeamentos para codificar e descodificar caracteres. Os objetos de mapeamento fornecidos devem suportar a interface de mapeamento :meth:`~object.__getitem__`; dicionários e sequências funcionam bem.

source: These are the mapping codec APIs:
pt_pt: Estas são as APIs de codec de mapeamento:

source: Create a Unicode object by decoding *size* bytes of the encoded string *str* using the given *mapping* object. Return ``NULL`` if an exception was raised by the codec.
pt_pt: Cria um objeto Unicode decodificando *size* bytes da cadeia de caracteres codificada *str* usando o objeto *mapping* dado. Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: If *mapping* is ``NULL``, Latin-1 decoding will be applied. Else *mapping* must map bytes ordinals (integers in the range from 0 to 255) to Unicode strings, integers (which are then interpreted as Unicode ordinals) or ``None``. Unmapped data bytes -- ones which cause a :exc:`LookupError`, as well as ones which get mapped to ``None``, ``0xFFFE`` or ``'\ufffe'``, are treated as undefined mappings and cause an error.
pt_pt: Se *mapping* for ``NULL``, a descodificação Latin-1 será aplicada. Caso contrário, *mapping* deve mapear ordinais de bytes (inteiros no intervalo de 0 a 255) para cadeias de caracteres Unicode, inteiros (que são então interpretados como ordinais Unicode) ou ``None``. Bytes de dados não mapeados -- aqueles que causam um :exc:`LookupError`, bem como aqueles que são mapeados para ``None``, ``0xFFFE`` ou ``'\ufffe'``, são tratados como mapeamentos indefinidos e causam um erro.

source: Encode a Unicode object using the given *mapping* object and return the result as a bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
pt_pt: Codifica um objeto Unicode usando o objeto *mapping* dado e retorna o resultado como um objeto bytes. O tratamento de erros é "strict". Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: The *mapping* object must map Unicode ordinal integers to bytes objects, integers in the range from 0 to 255 or ``None``. Unmapped character ordinals (ones which cause a :exc:`LookupError`) as well as mapped to ``None`` are treated as "undefined mapping" and cause an error.
pt_pt: O objeto *mapping* deve mapear inteiros ordinais Unicode para objetos bytes, inteiros no intervalo de 0 a 255 ou ``None``. Ordinais de caracteres não mapeados (aqueles que causam um :exc:`LookupError`) bem como mapeados para ``None`` são tratados como "mapeamento indefinido" e causam um erro.

source: The following codec API is special in that maps Unicode to Unicode.
pt_pt: A seguinte API de codec é especial porque mapeia Unicode para Unicode.

source: Translate a string by applying a character mapping table to it and return the resulting Unicode object. Return ``NULL`` if an exception was raised by the codec.
pt_pt: Traduza uma cadeia de caracteres aplicando uma tabela de mapeamento de caracteres a ela e retorne o objeto Unicode resultante. Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: The mapping table must map Unicode ordinal integers to Unicode ordinal integers or ``None`` (causing deletion of the character).
pt_pt: A tabela de mapeamento deve mapear inteiros ordinais Unicode para inteiros ordinais Unicode ou ``None`` (causando a eliminação do caractere).

source: Mapping tables need only provide the :meth:`~object.__getitem__` interface; dictionaries and sequences work well. Unmapped character ordinals (ones which cause a :exc:`LookupError`) are left untouched and are copied as-is.
pt_pt: As tabelas de mapeamento precisam apenas de fornecer a interface :meth:`~object.__getitem__`; dicionários e sequências funcionam bem. Ordinais de caracteres não mapeados (aqueles que causam um :exc:`LookupError`) são deixados intocados e são copiados como estão.

source: *errors* has the usual meaning for codecs. It may be ``NULL`` which indicates to use the default error handling.
pt_pt: *errors* tem o significado habitual para codecs. Pode ser ``NULL``, o que indica usar o tratamento de erros predefinido.

source: MBCS codecs for Windows
pt_pt: Codecs MBCS para Windows

source: These are the MBCS codec APIs. They are currently only available on Windows and use the Win32 MBCS converters to implement the conversions. Note that MBCS (or DBCS) is a class of encodings, not just one. The target encoding is defined by the user settings on the machine running the codec.
pt_pt: Estas são as APIs de codec MBCS. Atualmente, estão disponíveis apenas no Windows e usam os conversores MBCS Win32 para implementar as conversões. Note que MBCS (ou DBCS) é uma classe de codificações, não apenas uma. A codificação de destino é definida pelas configurações do utilizador na máquina que executa o codec.

source: Create a Unicode object by decoding *size* bytes of the MBCS encoded string *str*. Return ``NULL`` if an exception was raised by the codec.
pt_pt: Cria um objeto Unicode decodificando *size* bytes da cadeia de caracteres codificada em MBCS *str*. Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeMBCS`. If *consumed* is not ``NULL``, :c:func:`PyUnicode_DecodeMBCSStateful` will not decode trailing lead byte and the number of bytes that have been decoded will be stored in *consumed*.
pt_pt: Se *consumed* for ``NULL``, comporta-se como :c:func:`PyUnicode_DecodeMBCS`. Se *consumed* não for ``NULL``, :c:func:`PyUnicode_DecodeMBCSStateful` não descodificará o byte inicial final e o número de bytes que foram descodificados será armazenado em *consumed*.

source: Similar to :c:func:`PyUnicode_DecodeMBCSStateful`, except uses the code page specified by *code_page*.
pt_pt: Semelhante a :c:func:`PyUnicode_DecodeMBCSStateful`, exceto que usa a página de código especificada por *code_page*.

source: Encode a Unicode object using MBCS and return the result as Python bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
pt_pt: Codifica um objeto Unicode usando MBCS e retorna o resultado como um objeto bytes do Python. O tratamento de erros é "strict". Retorna ``NULL`` se uma exceção for levantada pelo codec.

source: Encode the Unicode object using the specified code page and return a Python bytes object. Return ``NULL`` if an exception was raised by the codec. Use :c:macro:`!CP_ACP` code page to get the MBCS encoder.
pt_pt: Codifica o objeto Unicode usando a página de código especificada e retorna um objeto bytes do Python. Retorna ``NULL`` se uma exceção for levantada pelo codec. Use a página de código :c:macro:`!CP_ACP` para obter o codificador MBCS.

source: Methods and Slot Functions
pt_pt: Métodos e Funções de Slot

source: The following APIs are capable of handling Unicode objects and strings on input (we refer to them as strings in the descriptions) and return Unicode objects or integers as appropriate.
pt_pt: As seguintes APIs são capazes de lidar com objetos Unicode e cadeias de caracteres na entrada (referimo-nos a eles como cadeias de caracteres nas descrições) e retornam objetos Unicode ou inteiros, conforme apropriado.

source: They all return ``NULL`` or ``-1`` if an exception occurs.
pt_pt: Todas retornam ``NULL`` ou ``-1`` se ocorrer uma exceção.

source: Concat two strings giving a new Unicode string.
pt_pt: Concatena duas cadeias de caracteres, dando uma nova cadeia de caracteres Unicode.

source: Split a string giving a list of Unicode strings. If *sep* is ``NULL``, splitting will be done at all whitespace substrings. Otherwise, splits occur at the given separator. At most *maxsplit* splits will be done. If negative, no limit is set. Separators are not included in the resulting list.
pt_pt: Divide uma cadeia de caracteres, dando uma lista de cadeias de caracteres Unicode. Se *sep* for ``NULL``, a divisão será feita em todas as subcadeias de espaço em branco. Caso contrário, as divisões ocorrem no separador dado. No máximo *maxsplit* divisões serão feitas. Se for negativo, nenhum limite é definido. Os separadores não são incluídos na lista resultante.

source: On error, return ``NULL`` with an exception set.
pt_pt: Em caso de erro, retorna ``NULL`` com uma exceção definida.

source: Equivalent to :py:meth:`str.split`.
pt_pt: Equivalente a :py:meth:`str.split`.

source: Similar to :c:func:`PyUnicode_Split`, but splitting will be done beginning at the end of the string.
pt_pt: Semelhante a :c:func:`PyUnicode_Split`, mas a divisão será feita a partir do final da cadeia de caracteres.

source: Equivalent to :py:meth:`str.rsplit`.
pt_pt: Equivalente a :py:meth:`str.rsplit`.

source: Split a Unicode string at line breaks, returning a list of Unicode strings. CRLF is considered to be one line break. If *keepends* is ``0``, the Line break characters are not included in the resulting strings.
pt_pt: Divide uma cadeia de caracteres Unicode em quebras de linha, retornando uma lista de cadeias de caracteres Unicode. CRLF é considerado como uma quebra de linha. Se *keepends* for ``0``, os caracteres de quebra de linha não são incluídos nas cadeias de caracteres resultantes.

source: Split a Unicode string at the first occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself, and the part after the separator. If the separator is not found, return a 3-tuple containing the string itself, followed by two empty strings.
pt_pt: Divide uma cadeia de caracteres Unicode na primeira ocorrência de *sep* e retorna um 3-tuplo contendo a parte antes do separador, o separador em si e a parte após o separador. Se o separador não for encontrado, retorna um 3-tuplo contendo a cadeia de caracteres em si, seguida de duas cadeias de caracteres vazias.

source: *sep* must not be empty.
pt_pt: *sep* não deve estar vazio.

source: Equivalent to :py:meth:`str.partition`.
pt_pt: Equivalente a :py:meth:`str.partition`.

source: Similar to :c:func:`PyUnicode_Partition`, but split a Unicode string at the last occurrence of *sep*. If the separator is not found, return a 3-tuple containing two empty strings, followed by the string itself.
pt_pt: Semelhante a :c:func:`PyUnicode_Partition`, mas divide uma cadeia de caracteres Unicode na última ocorrência de *sep*. Se o separador não for encontrado, retorna um 3-tuplo contendo duas cadeias de caracteres vazias, seguida da cadeia de caracteres em si.

source: Equivalent to :py:meth:`str.rpartition`.
pt_pt: Equivalente a :py:meth:`str.rpartition`.

source: Join a sequence of strings using the given *separator* and return the resulting Unicode string.
pt_pt: Une uma sequência de cadeias de caracteres usando o *separador* dado e retorna a cadeia de caracteres Unicode resultante.

source: Return ``1`` if *substr* matches ``unicode[start:end]`` at the given tail end (*direction* == ``-1`` means to do a prefix match, *direction* == ``1`` a suffix match), ``0`` otherwise. Return ``-1`` if an error occurred.
pt_pt: Retorna ``1`` se *substr* corresponder a ``unicode[start:end]`` na extremidade final dada (*direction* == ``-1`` significa fazer uma correspondência de prefixo, *direction* == ``1`` uma correspondência de sufixo), ``0`` caso contrário. Retorna ``-1`` se ocorrer um erro.

source: Return the first position of *substr* in ``unicode[start:end]`` using the given *direction* (*direction* == ``1`` means to do a forward search, *direction* == ``-1`` a backward search). The return value is the index of the first match; a value of ``-1`` indicates that no match was found, and ``-2`` indicates that an error occurred and an exception has been set.
pt_pt: Retorna a primeira posição de *substr* em ``unicode[start:end]`` usando a *direction* dada (*direction* == ``1`` significa fazer uma pesquisa para a frente, *direction* == ``-1`` uma pesquisa para trás). O valor de retorno é o índice da primeira correspondência; um valor de ``-1`` indica que nenhuma correspondência foi encontrada, e ``-2`` indica que ocorreu um erro e uma exceção foi definida.

source: Return the first position of the character *ch* in ``unicode[start:end]`` using the given *direction* (*direction* == ``1`` means to do a forward search, *direction* == ``-1`` a backward search). The return value is the index of the first match; a value of ``-1`` indicates that no match was found, and ``-2`` indicates that an error occurred and an exception has been set.
pt_pt: Retorna a primeira posição do caractere *ch* em ``unicode[start:end]`` usando a *direction* dada (*direction* == ``1`` significa fazer uma pesquisa para a frente, *direction* == ``-1`` uma pesquisa para trás). O valor de retorno é o índice da primeira correspondência; um valor de ``-1`` indica que nenhuma correspondência foi encontrada, e ``-2`` indica que ocorreu um erro e uma exceção foi definida.

source: *start* and *end* are now adjusted to behave like ``unicode[start:end]``.
pt_pt: *start* e *end* são agora ajustados para se comportarem como ``unicode[start:end]``.

source: Return the number of non-overlapping occurrences of *substr* in ``unicode[start:end]``. Return ``-1`` if an error occurred.
pt_pt: Retorna o número de ocorrências não sobrepostas de *substr* em ``unicode[start:end]``. Retorna ``-1`` se ocorrer um erro.

source: Replace at most *maxcount* occurrences of *substr* in *unicode* with *replstr* and return the resulting Unicode object. *maxcount* == ``-1`` means replace all occurrences.
pt_pt: Substitui no máximo *maxcount* ocorrências de *substr* em *unicode* por *replstr* e retorna o objeto Unicode resultante. *maxcount* == ``-1`` significa substituir todas as ocorrências.

source: Compare two strings and return ``-1``, ``0``, ``1`` for less than, equal, and greater than, respectively.
pt_pt: Compara duas cadeias de caracteres e retorna ``-1``, ``0``, ``1`` para menor que, igual e maior que, respetivamente.

source: This function returns ``-1`` upon failure, so one should call :c:func:`PyErr_Occurred` to check for errors.
pt_pt: Esta função retorna ``-1`` em caso de falha, por isso deve chamar :c:func:`PyErr_Occurred` para verificar erros.

source: The :c:func:`PyUnicode_Equal` function.
pt_pt: A função :c:func:`PyUnicode_Equal`.

source: Test if two strings are equal:
pt_pt: Testa se duas cadeias de caracteres são iguais:

source: Return ``1`` if *a* is equal to *b*.
pt_pt: Retorna ``1`` se *a* for igual a *b*.

source: Return ``0`` if *a* is not equal to *b*.
pt_pt: Retorna ``0`` se *a* não for igual a *b*.

source: Set a :exc:`TypeError` exception and return ``-1`` if *a* or *b* is not a :class:`str` object.
pt_pt: Define uma exceção :exc:`TypeError` e retorna ``-1`` se *a* ou *b* não for um objeto :class:`str`.

source: The function always succeeds if *a* and *b* are :class:`str` objects.
pt_pt: A função sempre tem sucesso se *a* e *b* forem objetos :class:`str`.

source: The function works for :class:`str` subclasses, but does not honor custom ``__eq__()`` method.
pt_pt: A função funciona para subtipos de :class:`str`, mas não honra o método personalizado ``__eq__()``.

source: The :c:func:`PyUnicode_Compare` function.
pt_pt: A função :c:func:`PyUnicode_Compare`.

source: Compare a Unicode object with a char buffer which is interpreted as being UTF-8 or ASCII encoded and return true (``1``) if they are equal, or false (``0``) otherwise. If the Unicode object contains surrogate code points (``U+D800`` - ``U+DFFF``) or the C string is not valid UTF-8, false (``0``) is returned.
pt_pt: Compara um objeto Unicode com um buffer de caracteres que é interpretado como sendo codificado em UTF-8 ou ASCII e retorna verdadeiro (``1``) se forem iguais, ou falso (``0``) caso contrário. Se o objeto Unicode contiver pontos de código substitutos (``U+D800`` - ``U+DFFF``) ou a cadeia de caracteres C não for UTF-8 válido, falso (``0``) é retornado.

source: This function does not raise exceptions.
pt_pt: Esta função não levanta exceções.

source: Similar to :c:func:`PyUnicode_EqualToUTF8AndSize`, but compute *string* length using :c:func:`!strlen`. If the Unicode object contains null characters, false (``0``) is returned.
pt_pt: Semelhante a :c:func:`PyUnicode_EqualToUTF8AndSize`, mas calcula o comprimento de *string* usando :c:func:`!strlen`. Se o objeto Unicode contiver caracteres nulos, falso (``0``) é retornado.

source: Compare a Unicode object, *unicode*, with *string* and return ``-1``, ``0``, ``1`` for less than, equal, and greater than, respectively. It is best to pass only ASCII-encoded strings, but the function interprets the input string as ISO-8859-1 if it contains non-ASCII characters.
pt_pt: Compara um objeto Unicode, *unicode*, com *string* e retorna ``-1``, ``0``, ``1`` para menor que, igual e maior que, respetivamente. É melhor passar apenas cadeias de caracteres codificadas em ASCII, mas a função interpreta a cadeia de entrada como ISO-8859-1 se contiver caracteres não-ASCII.

source: Rich compare two Unicode strings and return one of the following:
pt_pt: Compara ricamente duas cadeias de caracteres Unicode e retorna um dos seguintes:

source: ``NULL`` in case an exception was raised
pt_pt: ``NULL`` em caso de uma exceção ter sido levantada

source: :c:data:`Py_True` or :c:data:`Py_False` for successful comparisons
pt_pt: :c:data:`Py_True` ou :c:data:`Py_False` para comparações bem-sucedidas

source: :c:data:`Py_NotImplemented` in case the type combination is unknown
pt_pt: :c:data:`Py_NotImplemented` em caso de a combinação de tipos ser desconhecida

source: Possible values for *op* are :c:macro:`Py_GT`, :c:macro:`Py_GE`, :c:macro:`Py_EQ`, :c:macro:`Py_NE`, :c:macro:`Py_LT`, and :c:macro:`Py_LE`.
pt_pt: Valores possíveis para *op* são :c:macro:`Py_GT`, :c:macro:`Py_GE`, :c:macro:`Py_EQ`, :c:macro:`Py_NE`, :c:macro:`Py_LT` e :c:macro:`Py_LE`.

source: Return a new string object from *format* and *args*; this is analogous to ``format % args``.
pt_pt: Retorna um novo objeto de cadeia de caracteres a partir de *format* e *args*; isto é análogo a ``format % args``.

source: Check whether *substr* is contained in *unicode* and return true or false accordingly.
pt_pt: Verifica se *substr* está contido em *unicode* e retorna verdadeiro ou falso de acordo.

source: *substr* has to coerce to a one element Unicode string. ``-1`` is returned if there was an error.
pt_pt: *substr* tem de ser coercionado para uma cadeia de caracteres Unicode de um elemento. ``-1`` é retornado se houver um erro.

source: Intern the argument :c:expr:`*p_unicode` in place. The argument must be the address of a pointer variable pointing to a Python Unicode string object. If there is an existing interned string that is the same as :c:expr:`*p_unicode`, it sets :c:expr:`*p_unicode` to it (releasing the reference to the old string object and creating a new :term:`strong reference` to the interned string object), otherwise it leaves :c:expr:`*p_unicode` alone and interns it.
pt_pt: Internar o argumento :c:expr:`*p_unicode` no local. O argumento deve ser o endereço de uma variável de ponteiro que aponta para um objeto de cadeia de caracteres Unicode do Python. Se existir uma cadeia de caracteres internada que seja igual a :c:expr:`*p_unicode`, define :c:expr:`*p_unicode` para ela (libertando a referência ao antigo objeto de cadeia de caracteres e criando uma nova :term:`referência forte` ao objeto de cadeia de caracteres internado), caso contrário, deixa :c:expr:`*p_unicode` inalterado e interná-lo.

source: (Clarification: even though there is a lot of talk about references, think of this function as reference-neutral. You must own the object you pass in; after the call you no longer own the passed-in reference, but you newly own the result.)
pt_pt: (Esclarecimento: embora haja muita discussão sobre referências, pense nesta função como neutra em relação a referências. Deve possuir o objeto que passa; após a chamada, já não possui a referência passada, mas passa a possuir o resultado.)

source: This function never raises an exception. On error, it leaves its argument unchanged without interning it.
pt_pt: Esta função nunca levanta uma exceção. Em caso de erro, deixa o seu argumento inalterado sem o internar.

source: Instances of subclasses of :py:class:`str` may not be interned, that is, :c:expr:`PyUnicode_CheckExact(*p_unicode)` must be true. If it is not, then -- as with any other error -- the argument is left unchanged.
pt_pt: Instâncias de subtipos de :py:class:`str` podem não ser internadas, ou seja, :c:expr:`PyUnicode_CheckExact(*p_unicode)` deve ser verdadeiro. Se não for, então -- como com qualquer outro erro -- o argumento é deixado inalterado.

source: Note that interned strings are not “immortal”. You must keep a reference to the result to benefit from interning.
pt_pt: Note que as cadeias de caracteres internadas não são "imortais". Deve manter uma referência ao resultado para beneficiar da interning.

source: A combination of :c:func:`PyUnicode_FromString` and :c:func:`PyUnicode_InternInPlace`, meant for statically allocated strings.
pt_pt: Uma combinação de :c:func:`PyUnicode_FromString` e :c:func:`PyUnicode_InternInPlace`, destinada a cadeias de caracteres alocadas estaticamente.

source: Return a new ("owned") reference to either a new Unicode string object that has been interned, or an earlier interned string object with the same value.
pt_pt: Retorna uma nova referência ("proprietária") a um novo objeto de cadeia de caracteres Unicode que foi internado, ou a um objeto de cadeia de caracteres internado anteriormente com o mesmo valor.
