Repository: NyaPuma/python-docs-pt-pt
Catalog: c-api/unicode.po
Languages: pt_pt

source: Python may keep a reference to the result, or make it :term:`immortal`, preventing it from being garbage-collected promptly. For interning an unbounded number of different strings, such as ones coming from user input, prefer calling :c:func:`PyUnicode_FromString` and :c:func:`PyUnicode_InternInPlace` directly.
pt_pt: O Python pode manter uma referência ao resultado, ou torná-lo :term:`imortal`, impedindo que seja recolhido pelo recolhedor de lixo prontamente. Para internar um número ilimitado de cadeias de caracteres diferentes, como as provenientes de entrada do utilizador, prefira chamar diretamente :c:func:`PyUnicode_FromString` e :c:func:`PyUnicode_InternInPlace`.

source: Return a non-zero value if *str* is interned, zero if not. The *str* argument must be a string; this is not checked. This function always succeeds.
pt_pt: Retorna um valor não-zero se *str* estiver internado, zero se não estiver. O argumento *str* deve ser uma cadeia de caracteres; isto não é verificado. Esta função é sempre bem-sucedida.

source: A non-zero return value may carry additional information about *how* the string is interned. The meaning of such non-zero values, as well as each specific string's intern-related details, may change between CPython versions.
pt_pt: Um valor de retorno não-zero pode conter informações adicionais sobre *como* a cadeia de caracteres está internada. O significado de tais valores não-zero, bem como os detalhes específicos de cada cadeia de caracteres relacionados à interning, podem mudar entre versões do CPython.

source: The :c:type:`PyUnicodeWriter` API can be used to create a Python :class:`str` object.
pt_pt: A API :c:type:`PyUnicodeWriter` pode ser usada para criar um objeto :class:`str` do Python.

source: A Unicode writer instance.
pt_pt: Uma instância de escritor Unicode.

source: The instance must be destroyed by :c:func:`PyUnicodeWriter_Finish` on success, or :c:func:`PyUnicodeWriter_Discard` on error.
pt_pt: A instância deve ser destruída por :c:func:`PyUnicodeWriter_Finish` em caso de sucesso, ou por :c:func:`PyUnicodeWriter_Discard` em caso de erro.

source: Create a Unicode writer instance.
pt_pt: Cria uma instância de escritor Unicode.

source: *length* must be greater than or equal to ``0``.
pt_pt: *length* deve ser maior ou igual a ``0``.

source: If *length* is greater than ``0``, preallocate an internal buffer of *length* characters.
pt_pt: Se *length* for maior que ``0``, pré-aloca um buffer interno de *length* caracteres.

source: Set an exception and return ``NULL`` on error.
pt_pt: Define uma exceção e retorna ``NULL`` em caso de erro.

source: Return the final Python :class:`str` object and destroy the writer instance.
pt_pt: Retorna o objeto :class:`str` final do Python e destrói a instância do escritor.

source: The writer instance is invalid after this call.
pt_pt: A instância do escritor é inválida após esta chamada.

source: Discard the internal Unicode buffer and destroy the writer instance.
pt_pt: Descarta o buffer Unicode interno e destrói a instância do escritor.

source: If *writer* is ``NULL``, no operation is performed.
pt_pt: Se *writer* for ``NULL``, nenhuma operação é realizada.

source: Write the single Unicode character *ch* into *writer*.
pt_pt: Escreve o caractere Unicode único *ch* em *writer*.

source: On success, return ``0``. On error, set an exception, leave the writer unchanged, and return ``-1``.
pt_pt: Em caso de sucesso, retorna ``0``. Em caso de erro, define uma exceção, deixa o escritor inalterado e retorna ``-1``.

source: Decode the string *str* from UTF-8 in strict mode and write the output into *writer*.
pt_pt: Descodifique a string *str* de UTF-8 no modo estrito e escreva a saída em *writer*.

source: *size* is the string length in bytes. If *size* is equal to ``-1``, call ``strlen(str)`` to get the string length.
pt_pt: *size* é o comprimento da string em bytes. Se *size* for igual a ``-1``, chame ``strlen(str)`` para obter o comprimento da string.

source: See also :c:func:`PyUnicodeWriter_DecodeUTF8Stateful`.
pt_pt: Veja também :c:func:`PyUnicodeWriter_DecodeUTF8Stateful`.

source: Write the ASCII string *str* into *writer*.
pt_pt: Escreva a cadeia ASCII *str* em *writer*.

source: *str* must only contain ASCII characters. The behavior is undefined if *str* contains non-ASCII characters.
pt_pt: *str* deve conter apenas caracteres ASCII. O comportamento é indefinido se *str* contiver caracteres não ASCII.

source: Write the wide string *str* into *writer*.
pt_pt: Escreva a string larga *str* em *writer*.

source: *size* is a number of wide characters. If *size* is equal to ``-1``, call ``wcslen(str)`` to get the string length.
pt_pt: *size* é um número de caracteres largos. Se *size* for igual a ``-1``, chame ``wcslen(str)`` para obter o comprimento da cadeia.

source: Writer the UCS4 string *str* into *writer*.
pt_pt: Escreva a cadeia UCS4 *str* em *writer*.

source: *size* is a number of UCS4 characters.
pt_pt: *tamanho* é um número de caracteres UCS4.

source: Call :c:func:`PyObject_Str` on *obj* and write the output into *writer*.
pt_pt: Chame :c:func:`PyObject_Str` em *obj* e escreva a saída em *writer*.

source: Call :c:func:`PyObject_Repr` on *obj* and write the output into *writer*.
pt_pt: Chame :c:func:`PyObject_Repr` em *obj* e escreva a saída em *writer*.

source: Write the substring ``str[start:end]`` into *writer*.
pt_pt: Escreva a subcadeia ``str[start:end]`` em *writer*.

source: *str* must be Python :class:`str` object. *start* must be greater than or equal to 0, and less than or equal to *end*. *end* must be less than or equal to *str* length.
pt_pt: *str* deve ser um objeto Python :class:`str`. *start* deve ser maior ou igual a 0 e menor ou igual a *end*. *end* deve ser menor ou igual ao comprimento de *str*.

source: Similar to :c:func:`PyUnicode_FromFormat`, but write the output directly into *writer*.
pt_pt: Semelhante a :c:func:`PyUnicode_FromFormat`, mas escreve a saída diretamente em *writer*.

source: Decode the string *str* from UTF-8 with *errors* error handler and write the output into *writer*.
pt_pt: Descodifique a string *str* de UTF-8 com o manipulador de erros *errors* e escreva a saída em *writer*.

source: *errors* is an :ref:`error handler <error-handlers>` name, such as ``"replace"``. If *errors* is ``NULL``, use the strict error handler.
pt_pt: *errors* é um nome de :ref:`gestor de erros <error-handlers>`, como ``"replace"``. Se *errors* for ``NULL``, use o gestor de erros estrito.

source: If *consumed* is not ``NULL``, set *\*consumed* to the number of decoded bytes on success. If *consumed* is ``NULL``, treat trailing incomplete UTF-8 byte sequences as an error.
pt_pt: Se *consumed* não for ``NULL``, defina *\*consumed* como o número de bytes descodificados em caso de sucesso. Se *consumed* for ``NULL``, trate as sequências de bytes UTF-8 incompletas finais como um erro.

source: See also :c:func:`PyUnicodeWriter_WriteUTF8`.
pt_pt: Veja também :c:func:`PyUnicodeWriter_WriteUTF8`.

source: Deprecated API
pt_pt: API obsoleta

source: The following API is deprecated.
pt_pt: A seguinte API está obsoleta.

source: This is a typedef of :c:type:`wchar_t`, which is a 16-bit type or 32-bit type depending on the platform. Please use :c:type:`wchar_t` directly instead.
pt_pt: Este é um typedef de :c:type:`wchar_t`, que é um tipo de 16 bits ou 32 bits, dependendo da plataforma. Use :c:type:`wchar_t` diretamente em vez disso.

source: In previous versions, this was a 16-bit type or a 32-bit type depending on whether you selected a "narrow" or "wide" Unicode version of Python at build time.
pt_pt: Nas versões anteriores, este era um tipo de 16 bits ou 32 bits, dependendo se você selecionou uma versão Unicode «estreita» ou «ampla» do Python no momento da compilação.

source: Do nothing and return ``0``. This API is kept only for backward compatibility, but there are no plans to remove it.
pt_pt: Não faça nada e retorne ``0``. Esta API é mantida apenas para compatibilidade com versões anteriores, mas não há planos para removê-la.

source: This API does nothing since Python 3.12. Previously, this needed to be called for each string created using the old API (:c:func:`!PyUnicode_FromUnicode` or similar).
pt_pt: Esta API não faz nada desde o Python 3.12. Anteriormente, era necessário chamá-la para cada string criada usando a API antiga (:c:func:`!PyUnicode_FromUnicode` ou similar).

source: Do nothing and return ``1``. This API is kept only for backward compatibility, but there are no plans to remove it.
pt_pt: Não faça nada e retorne ``1``. Esta API é mantida apenas para compatibilidade com versões anteriores, mas não há planos para removê-la.

source: This API does nothing since Python 3.12. Previously, this could be called to check if :c:func:`PyUnicode_READY` is necessary.
pt_pt: Esta API não faz nada desde o Python 3.12. Anteriormente, ela podia ser chamada para verificar se :c:func:`PyUnicode_READY` era necessário.
